{"label": "NOT_SARCASM", "context": "@RandomGuy_Sucks @slightlysluggy @PIGPUNCHERTV Hate speech is not free speech.", "text": "@Fox_Galewarden @RandomGuy_Sucks @slightlysluggy @PIGPUNCHERTV Ok, then.  Please don't criticize police, advocate f… https://t.co/PMxPWx6kme"}
{"label": "NOT_SARCASM", "context": "I love my friends so very much. I couldn't ask for more lovely people to have in my life. You all stay lovely. 💖", "text": "@Hazelnut_Fawny Aaaaa love u too Fawny!!!!!!"}
{"label": "NOT_SARCASM", "context": "@matt_dobos @Coachatheart @jennerific713 @realDonaldTrump Are you asking a serious question or trolling?", "text": "@lamarlogan9 @matt_dobos @Coachatheart @jennerific713 @realDonaldTrump Nothing sticks just hearsay. Both had good a… https://t.co/wID0ocUMMO"}
{"label": "NOT_SARCASM", "context": "Ms. Shondalynn making Banana Pudding and I’m punishing that bihhh On God", "text": "@Chase_The_Money We’re you eating at ?"}
{"label": "NOT_SARCASM", "context": "I was told that I am a very negative person on Twitter.   To keep this anonymous, I am going to use a poll.   Do yo… https://t.co/Ojqg4n9ahP", "text": "@MunaNawabit1 I just started following you and I wouldn't have done that if you were a negative person. Your posts… https://t.co/cq300hXiRw"}
{"label": "NOT_SARCASM", "context": "can’t wait to get drunk and reckless", "text": "🤦🏽‍♀️🙄daddy wanna act up https://t.co/7VBPozY95A"}
{"label": "NOT_SARCASM", "context": "@OUkomah @Buchyogba @GovernorIkpeazu Haahaahaahaahaa, kindly ask someone in Ebonyi you know to show you how Abakili… https://t.co/OgwtbV26XD", "text": "@10racle @OUkomah @Buchyogba @GovernorIkpeazu This is enugu,there is only two streetlight on one pole, you can see… https://t.co/vhysJUctFw"}
{"label": "NOT_SARCASM", "context": "shawn I get that you're in love, but did you deadass forget to sing this line with camila yesterday? https://t.co/h8A7qaiHcO", "text": "@putshawnaboveme Did u have to call him out like that jshdhd"}
{"label": "NOT_SARCASM", "context": "@shenanigansen A fine addition to my reaction image collection https://t.co/8cPbpiZzUh", "text": "@SappySappster @shenanigansen you cropped the watermark out. you criminal"}
{"label": "NOT_SARCASM", "context": "@_kohai Happy Birthday, Brooooseffff!!🎉🎉🎉💚💚💚", "text": "@prisciface Thanks mannnnnnnn :')) 💗💗"}
{"label": "NOT_SARCASM", "context": "LETS FUCKING GOOOOO https://t.co/8rkJCMmLk8", "text": "@__holyschmidt KING"}
{"label": "NOT_SARCASM", "context": "We were drawing with chalk outside and we noticed that the rain made it liquidise. The children decided to get some… https://t.co/gF69Rmidwn", "text": "@a_eke1 Wow well done class, they look like fireworks!"}
{"label": "NOT_SARCASM", "context": "@Bookdr3ams @OneBookishMom @StalkintheBooks @elocin17 I’m hearing lots of praise for Yong-jiu Grocery Store (Taiwan… https://t.co/vfthYJYLoK", "text": "@vespertyne @Bookdr3ams @OneBookishMom @StalkintheBooks @elocin17 Gosh... Misaeng! It's not my usual fluffy watch b… https://t.co/Xa9jnMCVcV"}
{"label": "NOT_SARCASM", "context": "who's available for a reference sheet 🤔", "text": "@growlshift If you're down for being a test subject I've been meaning to make some examples since I'm planning to o… https://t.co/u5k1zTUCyZ"}
{"label": "NOT_SARCASM", "context": "Happiness: yellow 🌞🌼💛 https://t.co/uREL0qjhfp", "text": "@ToriWootan you're the absolute cutest"}
{"label": "NOT_SARCASM", "context": "@abndpcaucus 44yrs prior to NDP  conservatives with the richest of oil mismanaged the best economy in history Crony… https://t.co/1mh8KRTjCe", "text": "@nottoct @abndpcaucus @jkenney Boy are you full of it. Jobs were always plentiful until the NDP got into power and… https://t.co/vhkVN04x7g"}
{"label": "NOT_SARCASM", "context": "@BelindaOng1 Ain’t nobody waiting until 2021. That’s too long to wait for a drama or relationship. I truly don’t be… https://t.co/nhzr3nYQBy", "text": "@Michell36537371 @BelindaOng1 \"Baddest Girl\" wow! Such a \"Rocking\" description ..❤❤"}
{"label": "NOT_SARCASM", "context": "Without my wife, the Russia hoax would have been etched into history as fact. She believed in me when I lost friend… https://t.co/8BFaRTV4HT", "text": "@GeorgePapa19 I did believe in you my love and you know what? I WAS RIGHT ❤️ #hero #winner"}
{"label": "NOT_SARCASM", "context": "Tomorrow on #CarlosandLisa! So many fun guests...but I'm really fired up about a survey that found most people HATE… https://t.co/mq12H4e1aP", "text": "@LisaRemillard @beondtvofficial @CarlosTVRadio 😂😂😂😂😂😂😂😂😂😂😂 Tell em Sister!!!!"}
{"label": "NOT_SARCASM", "context": "@icklenellierose 2/2 We side with our own version of Trump who has been proven to be no less of a moron but with a… https://t.co/lELY7wSbhH", "text": "@ADSpongy @icklenellierose Surely having morals is a good thing? Regardless using the ‘Nothing we can do will chang… https://t.co/H6KOJTbHyh"}
{"label": "NOT_SARCASM", "context": "There will be a new force from #IndianNavy  Name: Sagar Prahari Bal Strength: 1000 They will be in charge of Protec… https://t.co/W40virc2wr", "text": "@VinodDX9 SPB has existed for a long time 🤔"}
{"label": "NOT_SARCASM", "context": "@flipkartsupport hii I am order your site spry paint 450 ml but spry is only 100 ml Bad service in your company", "text": "@SatyaNehaSingh1 Sorry about that. Be assured, we'll have this checked and one of our specialists will get in touch… https://t.co/BMMkRXyIGY"}
{"label": "NOT_SARCASM", "context": "the egg nog daquiris dropped yet?", "text": "@quiarathedon Yes ma’am."}
{"label": "NOT_SARCASM", "context": "Al Jazeera's @TeresaBo has been intentionally tear-gassed in the eyes by Bolivian police while on air. She was simp… https://t.co/I2cExyio86", "text": "This woman has more courage and strength in her pinkie finger than @mrandyngo will ever have in her life.   This is… https://t.co/ADDCoNFqfJ"}
{"label": "NOT_SARCASM", "context": "So I saved a sound birthday card for 10 years and https://t.co/1j4R5sxpAB", "text": "Opening a portal to hell at Wildcat School https://t.co/mqSDVOpZWx"}
{"label": "NOT_SARCASM", "context": "@BobBurrowsI @PeterGrantMP @afneil @NicolaSturgeon Must promise to use the Euro at a time of their own choosing, Bob. There's a difference.", "text": "@baxterparp @BobBurrowsI @PeterGrantMP @afneil @NicolaSturgeon Said the little boy with his finger in the dam"}
{"label": "NOT_SARCASM", "context": "I got the most comfortable bed", "text": "i swear i do everyone should come over and take a nap https://t.co/se2KDZuPqg"}
{"label": "NOT_SARCASM", "context": "My father came home from work while I was walking my dog and she sniffed his scent all the way from the FUCKING ELE… https://t.co/rHgqOWFNaY", "text": "@Top_Neph your dog is so fucking cute"}
{"label": "NOT_SARCASM", "context": "Puppy tried a gimp suit and had some difficulties. Also didn’t realize how tiring it would be. https://t.co/BeaABlDXkP", "text": "@PupWiggles Such a cute lil pupper"}
{"label": "NOT_SARCASM", "context": "Is that based on backlash from Twitter? Why was it not announced with the other fines? https://t.co/zYpk5WwY4C", "text": "@ByJonHeath Probably for trying to rip the helmet off of Myles Garrett’s head at the beginning of this whole disaster"}
{"label": "NOT_SARCASM", "context": "Would you ever sleep there again? 😱 https://t.co/u2oyAShkmD", "text": "@dodo @texastammers Not after I burned the house down..."}
{"label": "NOT_SARCASM", "context": "EXPLICO EL CHISTE: EXTRA-PAIR MATING AND FERTILIZATION. MATE GUARDING MEDIATED BY AGGRESSION TOWARDS MALE RIVALS https://t.co/H16sycJs1D", "text": "@spermifex AND EXPRESSION OF INHERITED GENES (BUT A LITTLE BIT OF LAMARCKISM)."}
{"label": "NOT_SARCASM", "context": "I love Lamar Jackson he is absolutely killing it this season BUT if Jimmy threw for 170 yards in a game the media w… https://t.co/Rrv1kfTGpz", "text": "Not if he also threw for 5 tugs and ran for another 95 https://t.co/2xGMXYdCKD"}
{"label": "NOT_SARCASM", "context": "ternyata teman w udah one step ahead alias dia punya sugar daddy the fuck", "text": "@_gtfobae Woah congrts @.craybub"}
{"label": "NOT_SARCASM", "context": "ahh my application to enroll into a uni was successful... ahh....... hhahhh... do I really wanna.....?", "text": "@Xyie_Sheep Omgg congrats xYIEEE 😳😳🔥💕"}
{"label": "NOT_SARCASM", "context": "@RBWMsupport 24 hours to fix? These pot holes are getting worse everyday! When will it be resolved? Tried clicking… https://t.co/sxm7FyKrYc", "text": "@JakePlaskitt @fixmystreet We have heard back from the Highways team. As per the pledge the location was attended w… https://t.co/imR3Hq79cN"}
{"label": "NOT_SARCASM", "context": "mullets are by far the ugliest haircut anyone can get. pls don’t do it to yourselves boys.", "text": "@AnnaMarieLynnR youre wrong"}
{"label": "NOT_SARCASM", "context": "Is it important for your boyfriends friends and family to like you for y’all relationship to work or no ?", "text": "In my opinion I’m not in a relationship with his family or friends so if they don’t like me then so what.. i can ei… https://t.co/1KUYKQnkFI"}
{"label": "NOT_SARCASM", "context": "👀 #SwingTheAxe https://t.co/rPMYc4VK1R", "text": "Whoa https://t.co/kQkQF4U9cQ"}
{"label": "NOT_SARCASM", "context": "In India, Muslims are watching the secular democratic principles of their country crumble. What is it like when you… https://t.co/qyfWgt9XCt", "text": "@Slate @marysdesk @RanaAyyub How many muslim countries or even muslim majority states allow multiculturalism!?"}
{"label": "NOT_SARCASM", "context": "Jesus Christ. What makes it worse is his centre half partner doesn't even get onto him about it in fact watch him.a… https://t.co/qekRUthl58", "text": "@Shorto12 That is bordering on match fixing, that is shocking"}
{"label": "NOT_SARCASM", "context": "kings lookin nice,, i don’t get why they record so horrible tho 🤷🏽‍♂️", "text": "@Eli2rare ur ex head coach fault lol. we started off bad but we been playing good lately"}
{"label": "NOT_SARCASM", "context": "@AndiswaMadikazi @Julius_S_Malema South African exceptionalism is about murdering Africans with impunity in the tow… https://t.co/K4pr4aNPnd", "text": "@tinashe5m @AndiswaMadikazi @Julius_S_Malema Oh and the rest of Africa are saint🤔🤔🧐🧐 like there isn't mass genocide… https://t.co/rpbVBaVAQy"}
{"label": "NOT_SARCASM", "context": "I’m gassing 😂 https://t.co/dVOU9csoYl", "text": "@ravnxhana This is like a game of where's Wally but instead I have to find you😂"}
{"label": "NOT_SARCASM", "context": ".@PubPeer says they don't blacklist people. I don't think that's true. Latest comment to be axed, on visual percept… https://t.co/iCRI0UM4oe", "text": "Olfaction Warps Visual Time Perception https://t.co/RzuL6UdP6B linked the energy-dependent creation of the sense of… https://t.co/TEpZdb1eGl"}
{"label": "NOT_SARCASM", "context": "I have a crush on you.   But I'll rather carry it to my grave than open my mouth and tell you", "text": "@Mezie_Chi To what end?"}
{"label": "NOT_SARCASM", "context": "For your consideration. https://t.co/11KCPBtYGK", "text": "So appreciate, Mr. Nordlinger, the humble, gentle way in which you share your commentaries.  Your pushy, narcissist… https://t.co/impnm2mvJM"}
{"label": "NOT_SARCASM", "context": "I just ate too much garlic bread", "text": "It be like that sometimes https://t.co/kqT1ecrw53"}
{"label": "NOT_SARCASM", "context": "what time is the award going to end anyway? it's late, i wanna rest, but it's not ended yet. 😂", "text": "@ongnielive039 Sameeeee~"}
{"label": "NOT_SARCASM", "context": "Since 2007, US coal-powered electricity has fallen from its peak back down to 1980 levels. 27 years of increasing c… https://t.co/PXuLi1Y2cQ", "text": "When people ask why I’m a climate optimist I’ll just show them this graph https://t.co/q09o1Cws92"}
{"label": "NOT_SARCASM", "context": "This brings back memories doesn't @gatwin78 https://t.co/d7GS6pwatI", "text": "@LyfeLessons662 @gatwin78 Nope"}
{"label": "NOT_SARCASM", "context": "@HotwaxAngie @lennythepen @ward_wardk4 @deanyb71 @FrankBullitt39 @seanpaulday @The_LCDC @TootlestheTaxi @TM1654… https://t.co/FOIcpqUIJ9", "text": "@guidoacasa @HotwaxAngie @lennythepen @ward_wardk4 @deanyb71 @FrankBullitt39 @seanpaulday @The_LCDC @TootlestheTaxi… https://t.co/ZdyDkfOQei"}
{"label": "NOT_SARCASM", "context": "Nobody will care but I’m doing an unfollow spree , reply with pics of Taehyung...  https://t.co/O87l6EK3vd", "text": "@luvvXtae30 https://t.co/c6MePBLnX1"}
{"label": "NOT_SARCASM", "context": "@Firehorsegirly @FromLoveWonder @AndrewYang @TheRoot Indeed. Yang has some great ideas but tries to perpetuate the… https://t.co/fsg8kaWEP4", "text": "@MostMuscle @Firehorsegirly @FromLoveWonder @AndrewYang @TheRoot He doesnt claim without data, he saw the data that… https://t.co/RokLzwFfOq"}
{"label": "NOT_SARCASM", "context": "Good morning, bitch.   (Say it back, or else.)", "text": "@NeonVerte It’s 1533"}
{"label": "NOT_SARCASM", "context": "Who said Padmavati was a phenomenon restricted to medieval Rajput ethos? https://t.co/b9keJHZpH5", "text": "@vajrayudha11 Yes the very fact it happened in 1990 in #JK is the Moot point"}
{"label": "NOT_SARCASM", "context": "Yoo this takes video of the Year. WHY ARE KIDS SO BOLD 😂😂😂 https://t.co/K9eGeSZvX3", "text": "LMFAOOOOO don’t let that cap boost your head up no more. https://t.co/Cd6LeRa5N1"}
{"label": "NOT_SARCASM", "context": "I went on 3 dates in one night before. One of the best nights of my FUCKING life. I lied the entire night. It was a… https://t.co/IUfiZPy1sZ", "text": "Women really just want to live the life they complain about men living. https://t.co/ayfUlwO8A5"}
{"label": "NOT_SARCASM", "context": "Gonna have to mute @NotToBeTrite for the day, just because I don't need him finally convincing me that Jerry might… https://t.co/7ZvbYvv5wq", "text": "@dallas_indallas You had me in the first half."}
{"label": "NOT_SARCASM", "context": "The 25 linebacker finalists for the #NFL100 All-Time Team!  Which 12 players will make the final team?  📺: #NFL100… https://t.co/tW5fVT0Gvb", "text": "@NFL @nflnetwork 😡"}
{"label": "NOT_SARCASM", "context": "My phone has told me it’s gonna update “later tonight” for the past 4 nights...", "text": "@alexisbernal3 Gotta connect to WiFi and while it charges"}
{"label": "NOT_SARCASM", "context": "Try the #kombezaonthego #mukombezamusakufuna https://t.co/dZL2snqud3", "text": "where can we find it??? https://t.co/7TCddEGOqq"}
{"label": "NOT_SARCASM", "context": "Pretty sure I’ve decided upon my GW14 transfer  Explosive player ✅  Great Value &amp; PPM ✅  Good Fixtures ✅  Attacking… https://t.co/2D0lJsRW30", "text": "@johnsmithspurs Just been listening to the captaincy vid from @FFScout and they've put a compelling case forward fo… https://t.co/C4ipvBZmds"}
{"label": "NOT_SARCASM", "context": "@mrshananto @poponkerok gak ngerti gua. Ini orang sebenarnya minta SJW dan Feminis untuk bersikap terhadap Video Ni… https://t.co/AGwBk0KSTF", "text": "@sandianif @mrshananto @poponkerok how in the hell this popon guy bcm rape culture-endorser?? what a premature conc… https://t.co/4j9fz3TvIG"}
{"label": "NOT_SARCASM", "context": "Please quote tweet this with your most controversial food opinion, I love controversial food opinions", "text": "Peanut butter on waffles is godlike  Ketchup and Brown rice is crack  Tomatoes are disgusting on everything all the… https://t.co/IgWRM7yo5S"}
{"label": "NOT_SARCASM", "context": "@buzztronics @Jeopardy @austintylerro @Technomonk3000 I'm wondering how many fans caught the \"Not Australia\" joke i… https://t.co/1GjHM9Valt", "text": "@annekem @buzztronics @Jeopardy @austintylerro @Technomonk3000 I DID NOT CATCH THIS JOKE ANNEKE.  lol"}
{"label": "NOT_SARCASM", "context": "@SirIzenWorth @Phil_Is_Daddy *ruffles youre hair* youre fun to mess with you know☺", "text": "@walela5 @Phil_Is_Daddy uh oh"}
{"label": "NOT_SARCASM", "context": "@ExumAM @jaketapper Is this some absurd and disgusting distraction from Trump? The whole State Dept. is in disarray… https://t.co/7wD35zUEDq", "text": "@AlexandraHemmin @ExumAM @jaketapper YES, YES, and YES, keeping them and their families in much needed prayer, as t… https://t.co/qifkK20PG0"}
{"label": "NOT_SARCASM", "context": "@Itamar1710 Tonight made more sense because he made some. The season as a whole, I'm with you. But at this point, 1… https://t.co/WQ1pv5Qyy3", "text": "@BenDuBose @Itamar1710 Today we really got McLeMORE and not McLeless, tbh. 🤔"}
{"label": "NOT_SARCASM", "context": "If anyone doubts the power of marketing, I point them to the Cowboys popularity vs their actual on-field success in… https://t.co/PWsNSUnw8v", "text": "@YoPaulieNJ 20"}
{"label": "NOT_SARCASM", "context": "@PerpetualRaine Omg watch out, it might be a bug, but if you choose a the top option, the game accidentally matches… https://t.co/IUzswGsYSZ", "text": "@picogram_art @PerpetualRaine You can actually circumvent the bug with the following steps:  -Press “Home” -Press “… https://t.co/irRBCmwbFr"}
{"label": "NOT_SARCASM", "context": "Warner Bros. currently has no plans to #ReleaseTheSnyderCut of #JusticeLeague either in theaters or on HBO Max: \"Th… https://t.co/zdpmYik4nJ", "text": "Nice of them to not even acknowledge the fact that the director of the movie, it's whole cast, the director of phot… https://t.co/kxxxlLlk43"}
{"label": "NOT_SARCASM", "context": "waiting for the day seungyoun and ong greets each other on stage 🥺🥺🥺🥺", "text": "ini maksudnya pgn bikin gw kejang kejang yha. https://t.co/qLFnCk75GZ"}
{"label": "NOT_SARCASM", "context": "@RailaOdinga @TheRealBBI They visited 7,000 Kenyans and Punguza visited 1,200,000 Kenyans. BBI MUST be mutilated by… https://t.co/bVK6a8k4tg", "text": "@FrankLoiter @RailaOdinga @TheRealBBI And if those positions are created what will you do? #BBI"}
{"label": "NOT_SARCASM", "context": "Please quote tweet this with your most controversial Lord of the Rings BOOK opinion. I love controversial book opinions.", "text": "@theoneringnet What about the song verses?BORING... skipped them all."}
{"label": "NOT_SARCASM", "context": "fuck wrong witchu? what you was thinkin? fuck you thought it was? https://t.co/j1uB58zR7b", "text": "@guthrie_trevor You're nuts 🥜"}
{"label": "NOT_SARCASM", "context": "Quote tweet your most controversial opinion about birds.", "text": "I think pigeons are actually great https://t.co/3dW37RliEC"}
{"label": "NOT_SARCASM", "context": "@abcpoppins @juliegirling @BrunoAm05317727 @cotswolds4eu Have a trade deal with the USA and any other country in th… https://t.co/OWAhLl5p4r", "text": "@DaveAtherton20 @abcpoppins @juliegirling @BrunoAm05317727 @cotswolds4eu After 3 yrs, David is stuck on the basics… https://t.co/3E21VhbsFq"}
{"label": "NOT_SARCASM", "context": "Man, this movie", "text": "@intothecrevasse i think i was just in the mood to FEEL THINGS and that’s why it worked for me"}
{"label": "NOT_SARCASM", "context": "@UberNaffa @hibryanj @AdyBarkan @ewarren Warren is trying to make this abo process and not about movement. This is… https://t.co/lin1M5AzZm", "text": "@JSherman6918 @UberNaffa @hibryanj @AdyBarkan @ewarren People who support M4A attacking Warren and her supporters a… https://t.co/dTVtgSYMp8"}
{"label": "NOT_SARCASM", "context": "On the back of another thread... what's your favorite vulnerability, and why? Anything older than 25 years has a sp… https://t.co/QRmp09vHd0", "text": "@attritionorg My favorite that I wrote?  Or that I read?  Despite his current trajectory, I still loved @moxie's ol… https://t.co/9FGSsdlniX"}
{"label": "NOT_SARCASM", "context": "Sadboi, the best boy  Which, starter did you choose?  #PokemonSwordShield #NintendoSwitch https://t.co/7prL5bzgNs", "text": "@Raierae I picked Scorbunny 😊"}
{"label": "NOT_SARCASM", "context": "And in the title story, in a world ravaged by flood and riven by class, experts have discovered how to “fix the equ… https://t.co/G6hyCDniq3", "text": "I still have this book o. I should find time to read it. Bought it from you. Thanks https://t.co/0bhrvS22je"}
{"label": "NOT_SARCASM", "context": "Big shoutout for the 5 STAYs who kept voting for a month and faced so much h*te during that period. You're the BEST… https://t.co/k4OeJEowBf", "text": "AWWW CONGRATS 💙 THE 5 OF U MADE STRAY KIDS PROUD https://t.co/X8BHqVNSeK"}
{"label": "NOT_SARCASM", "context": "Tundra strong &amp; Lightning fast ⛰⚡️ Those are the skills @TeamCanadaRD's Jr. Squad will see from 2 Prince George gir… https://t.co/2VyQidHcqC", "text": "Yay Taylor!! @dptstrojans https://t.co/JfDruEsPd8"}
{"label": "NOT_SARCASM", "context": "\"well, we buy grocery exclusively with ebt, don't eat out, and don't buy anything frivolous, but are still barely s… https://t.co/RHveoafymC", "text": "@one_mae_bee Uugghh I know how you feel. Like...just let us eat please??"}
{"label": "NOT_SARCASM", "context": "Sirfetch’d I’m coming for you  Jk I have a big project due I will not even open the shrink wrap https://t.co/x6BqqiVOV1", "text": "@katieguo I'm trying to get sirfetchd but evolving this flicker is a nightmare"}
{"label": "NOT_SARCASM", "context": "Telkom was started by the State, Vodacom was started by Telkom when Telkom was State owned, MTN was started by Tran… https://t.co/iRaJrBnjJp", "text": "@KhandaniM The fact is SAA is a liability to rona di tax payers and average majority of blacks that are taxed, are… https://t.co/izycnTZaj8"}
{"label": "NOT_SARCASM", "context": "The worst kind of feeling is when you try to catch a Pokémon but accidentally made it faint because of a critical hit", "text": "@itsDahyunsworld ESPECIALLY IF ITS A SHINY"}
{"label": "NOT_SARCASM", "context": "\"To quote Jung himself: 'It fares with us all as with Brother Medardus in Hoffmann's tale The Devil's Elixir: somew… https://t.co/hfDTE16dwF", "text": "@jungianLaura Keeping up with your posts gives me a welcome small diversion from work and fills it with BIG things… https://t.co/CxalaTexfi"}
{"label": "NOT_SARCASM", "context": "Lol. Lies! Your husband has shown you the evangelical money to be made. https://t.co/qFq2zrhnxQ", "text": "@Playm8z Please let people be. You don’t always know everything"}
{"label": "NOT_SARCASM", "context": "It's kind of funny. I got a ton of hot sauce for my birthday this year, paid for by my mother in law with gift card… https://t.co/Ihnmv3CGtr", "text": "@ImprobableJoe If I did what I really wanted, I'd eat hot curry every day, but I try not to do it too much bec it s… https://t.co/b2qcFJfAK6"}
{"label": "NOT_SARCASM", "context": "day 15 in the field without a shower. not happy.", "text": "@kyliekriner1681 RIP"}
{"label": "NOT_SARCASM", "context": "The highlight of my day today was seeing Adriana 🥰", "text": "@AstridJeffriess so fuck me huh?"}
{"label": "NOT_SARCASM", "context": "i think we all know whose hand that is 😳 https://t.co/uN3ETrqChG", "text": "@strawberrywoong Woong? Lmao 😂"}
{"label": "NOT_SARCASM", "context": "@Mika_Abraham1 Come and let me tu gu wu su eh?", "text": "@MutomboDaPoet Hmm 🤔 no comment."}
{"label": "NOT_SARCASM", "context": "I’m dying at that papa johns interview mans said he ate 40 pizzas in 30 days and then had the nerve to say it’s nas… https://t.co/EuMWS2U5uj", "text": "@mzzanastasia Them shits big trash"}
{"label": "NOT_SARCASM", "context": "Did anyone else buying Camila tickets get the randomized ticket selection. Like with P1 P2 P3. And not being able to choose your own seat??", "text": "@nbtsvanessa That’s how it is with AXS when finally they do general sale then it’ll let you choose your seat"}
{"label": "NOT_SARCASM", "context": "@TeamPulte Its $5 Tuesday at the theater tonight. Think I might go catch a movie tonight", "text": "@Grantman90 @TeamPulte Nice!  What do you want to see?"}
{"label": "NOT_SARCASM", "context": "@MaraWilson @TwitterMovies Ohhhhhhhhhkay", "text": "@rianjohnson @MaraWilson @TwitterMovies TAP. THAT. ASS. (the musical) cc: @NTJohnson"}
{"label": "NOT_SARCASM", "context": "@ACTFibernet three days no internet. No contact from any engineer. No nothing except a red face in front of guests… https://t.co/DFy33iQurJ", "text": "@eNVyranka We regret the inconvenience caused. Please be assured that our team is looking into this."}
{"label": "NOT_SARCASM", "context": "@VOCMNEWS The nice thing about it is if you have kids you can take them and then, if you wanted to, still go out wi… https://t.co/00r3AUnrg4", "text": "@AbbottGroves @VOCMNEWS If it's to late maybe it wasn't meant for small kids just a thought"}
{"label": "NOT_SARCASM", "context": "Nah but why is so many ppl going missing", "text": "Every time a car slows down near me God knows I move mad and start shuffling https://t.co/rSNjYJDe43"}
{"label": "NOT_SARCASM", "context": "Lmfao when you get the same cab driver from earlier &gt;&gt;&gt;", "text": "@AliyahExplains Be careful"}
{"label": "NOT_SARCASM", "context": "@lindavi71381731 mouthful and a half in a good or bad way? 👀 tell me, i wants to know!   as far as the girls: i get… https://t.co/8Ib6GUwLor", "text": "@hasbleidy_ @lindavi71381731 Realistically, they had semen from the victims and I doubt that even if this \"professo… https://t.co/loCEDDxHuR"}
{"label": "NOT_SARCASM", "context": "@RailMinIndia @IRCTCofficial @PiyushGoyal PNR - 8123182595 cancellation/refund ID - 100000377667953 refund issued o… https://t.co/kVxmHhmc1V", "text": "@rottenpen Kindly share mobile no through Direct Message .   -IRCTC Official"}
{"label": "NOT_SARCASM", "context": "I will be in Amsterdam at this time next week and I’ve been informed I will be doing marijuana I love being a teenager in my 40s.", "text": "@shitfoodblogger Is this a Bilderberg Illuminati thing because they have really great hotels with very nice coffee stations."}
{"label": "NOT_SARCASM", "context": "GP Live shot of DC's airspace rn: https://t.co/pRVObstmiG", "text": "@Gormogons I would disagree"}
{"label": "NOT_SARCASM", "context": "Do you want be one of the girls of the calendar camgirls 2020? Increase your personal brand and followers with our… https://t.co/vg7wReKfts", "text": "What the hell is this??? They use and sell your image and tells to not to worry, THEY WON'T CHARGE YOU WTFFFFFF  Gi… https://t.co/rPG8bABafK"}
{"label": "NOT_SARCASM", "context": "Nothin but sexy ladies tonight https://t.co/biHPXjCnBG", "text": "@PokerThug7duece Oh yeah!!! https://t.co/ncG5kAi3LX"}
{"label": "NOT_SARCASM", "context": "🇵🇭 [PH G.O.] #SkzEmpire_GO  'Straykids Official Lightstick'  FORM is ready 😊 WE WILL DROP SOON!  Waiting for the Pr… https://t.co/bnJ3JCO86Z", "text": "@skzempirePH Ship internationally?"}
{"label": "NOT_SARCASM", "context": "@king__Cares @Ifetomiwa30 @life_of_mrey @olasmarto @paponzo10 @sinzuugram @moslekogun @labush8 @Olumotta… https://t.co/9sWDf84krM", "text": "@hoye_khalifa @king__Cares @Ifetomiwa30 @life_of_mrey @paponzo10 @sinzuugram @moslekogun @labush8 @Olumotta… https://t.co/CCJr0b5fmw"}
{"label": "NOT_SARCASM", "context": "49ers. Ravens.   Can't wait for this Sunday 🍿 https://t.co/N0dkYSlxoW", "text": "Baltimore❗️❗️😈😈😈 https://t.co/OMBuaI68yR"}
{"label": "NOT_SARCASM", "context": "Sunbathe your asshole, for wellness https://t.co/50pmdiohZ1 https://t.co/OfLGulPqL2", "text": "Get rid of the winter blues 🤣 https://t.co/aAhhUViLx2"}
{"label": "NOT_SARCASM", "context": "God send me somebody who matches my energy😩", "text": "@Queennise_ okay, i got somebody just right"}
{"label": "NOT_SARCASM", "context": "How’s your bottom 10 offense looking these days with your first Rd RB with the worst elusive rating and bottom 3 overall PFF grade?", "text": "@Zach_Kaz Love all this hate!! Inject it into my veins"}
{"label": "NOT_SARCASM", "context": "found the absolute worst car sticker today https://t.co/xFnoCFnUz4", "text": "I HATE when families come with these as matching shirts.... https://t.co/eUT0roXq5M"}
{"label": "NOT_SARCASM", "context": "@lzzmills Liz have you heard Mona Lisa? I'm sure you have bc I'm so behind on music.", "text": "@BpGAS_station The singer? Lol"}
{"label": "NOT_SARCASM", "context": "Tax season coming up soon BM season 😂😂😂😂", "text": "Swear🤣🤣 https://t.co/VMlgfGCIDy"}
{"label": "NOT_SARCASM", "context": "More footage showed how one #HongKong protester killed an 70-years old man. RIP.  https://t.co/tGMp5lZzei", "text": "@liamstone_19 HK is allowing it’s take over by a feral mob of fanatic teens with little conscience. They will trash… https://t.co/TMvyfI0HQw"}
{"label": "NOT_SARCASM", "context": "mama 2018... when during their speech hoseok was trying so hard to keep his smile while crying &amp; when seokjin talke… https://t.co/mBnJf3xRWm", "text": "@btsinpics @jiminseutopia @BTS_twt i made this sound that made everyone in my class turn to me this shit hit HARD"}
{"label": "NOT_SARCASM", "context": "How about a mothers Thread https://t.co/U7mIATS5dx", "text": "@bruno_KUg Finally somewhere I can participate 😊 https://t.co/aVSsVDofRg"}
{"label": "NOT_SARCASM", "context": "I don't wanna live for someone else https://t.co/xKa7TVGJLD", "text": "@ntsikimazwai I've often asked myself if I really had kids because I wanted to, or societal expectations. Tbqh I'm… https://t.co/KQj7WS74uQ"}
{"label": "NOT_SARCASM", "context": "remember in high school musical when sharpay wanted everyone to stick to the status quo cuz she was scared of chang… https://t.co/baG8uunj89", "text": "@hantheloser Why would you insult my queen like that"}
{"label": "NOT_SARCASM", "context": "We need an income cap, period.  That was FDR's view: A minimum wage law, passed in 1938, should be matched by a max… https://t.co/waPPWq8ksn", "text": "@PaulHRosenberg @yourauntemma Paul, that is really silly.  If a pro football player has to pay 100% tax on income o… https://t.co/cM2qGOQ0Jb"}
{"label": "NOT_SARCASM", "context": "Like Bambi on ice, our @wmasjacklewis makes easy work of the mud 😬 https://t.co/IcqycS64WV", "text": "I blame the driver for parking in the mud 😉. This is actually a graceful and stylish return to the aircraft, you ju… https://t.co/707lpHtM6P"}
{"label": "NOT_SARCASM", "context": "The @ChiefRabbi Ephraim Mirvis has accused @JeremyCorbyn and the Labour Party’s leadership of not doing enough to r… https://t.co/vYv6SAU06G", "text": "If you vote Labour, you’re ignoring how threatened many Jewish people feel. If you vote Tory, you’re ignoring how t… https://t.co/QVGUeP5iRf"}
{"label": "NOT_SARCASM", "context": "@smitaprakash So you are arguing that people should choose subjects according to their financial and class standard… https://t.co/UqqXvElbyY", "text": "@Joeltm3 @smitaprakash If you are serious about being independent and not be a freeloader, you would study somethin… https://t.co/8KpgkAPMtd"}
{"label": "NOT_SARCASM", "context": "except for 3 idiots", "text": "@jackdylanblaz3r and Zindagi na milegi dobara"}
{"label": "NOT_SARCASM", "context": "I wore Aeropostale polos almost EVERY DAY in high school.  WHAT🥴", "text": "@CallmeKrej The glo up is real though"}
{"label": "NOT_SARCASM", "context": "@TranslateRealDT Wait- people do not lie under oath?  Why would they not say they are under oath, and then lie anyway?", "text": "@NicanBun @TranslateRealDT Perjury is a federal crime that can lead to up to five years if imprisonment if convicte… https://t.co/BqdSFwDbzb"}
{"label": "NOT_SARCASM", "context": "Suns Twitter is debating religion as if the last decade of Suns basketball didn’t prove definitively that there is no God.", "text": "Gangs all here now,Would have been better last night in wee hours of night but our middle aged band of brothers nee… https://t.co/JLiEUUTRTs"}
{"label": "NOT_SARCASM", "context": "anyone who can beat a seal with a bat is a monster no if ands or but’s", "text": "@sarahislevy Who tf???"}
{"label": "NOT_SARCASM", "context": "@ReformedBroker If you don’t blast Biden on this as much as Trump on anything then you’re not nearly as analytical… https://t.co/8FxWmnjsHH", "text": "@JackBeTrader @ReformedBroker I agree both should pay the price. Agree with you. Both are going down"}
{"label": "NOT_SARCASM", "context": "@VuzzLightyear @taytilla_ Comes with being at the top of the food chain.", "text": "@ProblemDaGOAT @VuzzLightyear if you don't agree with my tweets/retweets then just don't reply to them, i definitel… https://t.co/HmMDMbV2KI"}
{"label": "NOT_SARCASM", "context": "Idk, idc, this got to be the dumbest video I've seen this year  https://t.co/Aw4xlCR6bo", "text": "Imagine these idiots. Just imagine https://t.co/4SNY20RGis"}
{"label": "NOT_SARCASM", "context": "@jeffwoolf95 I’m really not sure why you think custodial care is limited to provision by family members when that’s… https://t.co/XOUm7EOu8w", "text": "@UnionSaltBae @jeffwoolf95 Also, here's what CMS says about custodial care:  It is \"ordinarily provided by personne… https://t.co/B8acp51QhP"}
{"label": "NOT_SARCASM", "context": "I love him and his armpits! https://t.co/yNRnGZI3KC", "text": "@sweetjimla88 @loves5HINee You should make a Minho’s armpits love you account."}
{"label": "NOT_SARCASM", "context": "This clown in Berkeley County needs another charge.  You either dress redneck, or gangster, but not both!  #LivePD", "text": "@DavetheKraut Pimp daddy Jethro"}
{"label": "NOT_SARCASM", "context": "@mackenziehnc @sydster999r @TheLittleSonic @ChibiTifa @VeridisJoe Yakno every cosplayer gets hate right. And the wh… https://t.co/OwhbQpPvjv", "text": "@xXRedWolf69Xx @mackenziehnc @sydster999r @TheLittleSonic @ChibiTifa @VeridisJoe The difference is white people don… https://t.co/jDZznKTN5o"}
{"label": "NOT_SARCASM", "context": "@littlethunderr Join violence?Join to the people who kill for peace?", "text": "@Eshark_tea huh, funny. i thought it was the police shooting people, and the white shirts with metal rods..."}
{"label": "NOT_SARCASM", "context": ".@nw_nicholas this gets good on about 10 minutes #Browder https://t.co/kkF6PrQfFA", "text": "@financialeyes Thanks, I know Lucy and told her about the Times article."}
{"label": "NOT_SARCASM", "context": "I suppose we can put Josh Doctson in the Michael Floyd and George Iloka category of moves we thought would have a b… https://t.co/kaLwlpfqfH", "text": "@MatthewColler Says more about Treadwell."}
{"label": "NOT_SARCASM", "context": "atinys divert your energy into voting pls", "text": "@jmnmja they dont know how to do that"}
{"label": "NOT_SARCASM", "context": "@nytimes America continues to fall to the bottom with the news of this lady running for governor.", "text": "@BRADSPORTS2020 @nytimes It's Arkansas.  Nuff said"}
{"label": "NOT_SARCASM", "context": "Day napping just is the best thing evaaaa", "text": "@tashtranter0 Lazy x"}
{"label": "NOT_SARCASM", "context": "Gonna tell my kids these are American judges, police and politicians. https://t.co/QgAdh1F3wh", "text": "@Travon @frankieboyle Democrats"}
{"label": "NOT_SARCASM", "context": "yooo don’t sleep on my #Browns we going to the playoffs", "text": "@jankyriley999 Lol"}
{"label": "NOT_SARCASM", "context": "It's FUCKING HILARIOUS how quickly meat eaters run up to pet a dog but then eat meat. I don't understand.", "text": "@rhystothestars3 This."}
{"label": "NOT_SARCASM", "context": "I was resisting tweeting about the Nicene creed but I just remembered something so I have to.  I started attending… https://t.co/9HflhvBJGx", "text": "@megmcdermott92 Thiiiiiiis whole thing."}
{"label": "NOT_SARCASM", "context": "@zoeyag @ACanadianinUSA @Valgb1961 @screenwriter36 And you *choose* to be in that discriminatory bubble.", "text": "@harpertweeted @zoeyag @ACanadianinUSA @Valgb1961 @screenwriter36 Best way to branch out is to visit community of c… https://t.co/6QaH5545d3"}
{"label": "NOT_SARCASM", "context": "This idea is disturbing. “The idea that morality dictates healthy people pay less, and sick people more, has been f… https://t.co/jST3UY7N7D", "text": "Insurance pricing is based on actuarial and economic principles, not morality.  People who live where flooding is l… https://t.co/KzdIONGAjm"}
{"label": "NOT_SARCASM", "context": "And, belatedly, for the few who did read to the end of this thread, I do think that antisemitism in the Labour Part… https://t.co/RmMQfceza2", "text": "@KeithKahnHarris (1/2) Thanks for sharing this. I'm canvassing for Labour and meeting Jewish people who seem genuin… https://t.co/A9MO21c2wi"}
{"label": "NOT_SARCASM", "context": "@AngelaBelcamino @realDonaldTrump Can’t say exactly who bought them, but the little dagger next to the ranking mean… https://t.co/kNFxfu97yp", "text": "@BellanMelissa @AngelaBelcamino @realDonaldTrump The Bible says jealousy is crueler then the grave!So sorry for you… https://t.co/UgGoGVlZUW"}
{"label": "NOT_SARCASM", "context": "I’ve been in Texas far too long and still haven’t had whataburger or pluckers 😭", "text": "I’m trying it this week to see what the hype is all about 🙄 https://t.co/wA1Q0OM0dH"}
{"label": "NOT_SARCASM", "context": "@SJ_NEWS_JP アカウント分けて欲しい。  SJでこの人の情報流さないでくれ。不愉快だ。", "text": "@norobuto @SJ_NEWS_JP La desagradable sos vos, ridícula. C:"}
{"label": "NOT_SARCASM", "context": "Forever passing on work potlucks", "text": "Them niggas forever tryna invite me. Hard pass. We are GOOD. https://t.co/moUEvbJV3Y"}
{"label": "NOT_SARCASM", "context": "It is more expensive to fly to Kenya than Dubai from Kigali. What a wow!", "text": "With @FlyJambojet launching its KGL-NBO route, this won’t be a problem no more 😁😁 https://t.co/lv2mdXTOjM"}
{"label": "NOT_SARCASM", "context": "Leicester 2015-16  40.9% possession https://t.co/ipeI7E6mcB", "text": "@Dc930Mike Picking one data point out of hundreds proves nothing. Look at the larger trends and patterns and it becomes clear."}
{"label": "NOT_SARCASM", "context": "Just kidding. Apparently that deal is only eligible for new customers. Screw you Verizon. I’ve been with y’all for twelve years 🙃", "text": "@carolinacatgirl At least we get Disney+ I guess?"}
{"label": "NOT_SARCASM", "context": "NASCAR Fans: WE WANT CONSISTENCY TO MATTER!  Crafton: Wins the Championship off of consistency  NASCAR Fans: He DoE… https://t.co/7KNFGqm37I", "text": "@yfz77 Ummm he didn't win this title on consistency. Not even close. But rahhhh hypocrisy rahhh"}
{"label": "NOT_SARCASM", "context": "Kwiatkoski Is the best LB on the roster https://t.co/VonKPKRqzj", "text": "@ChadNash13 @WCGridiron Controversial not dumb haha"}
{"label": "NOT_SARCASM", "context": "@SpineAcht I just want to set play him back 😔😔😔", "text": "@Aru762mmR @SpineAcht Hilda?"}
{"label": "NOT_SARCASM", "context": "Chilly one this morning! ❄️🥶 https://t.co/AChbyQehqp", "text": "@ChelseaFC Let's go get this win boys! COYB!!"}
{"label": "NOT_SARCASM", "context": "#PrayerWarriors Would you lift my husband, David, up in #Prayer. He is having back surgery on Wednesday to repair a… https://t.co/tBEyTCjbzZ", "text": "@lifeofpings @SticksMix Praying for both of you."}
{"label": "NOT_SARCASM", "context": "that WAIST https://t.co/H2EFJVuylF", "text": "the THIGHS https://t.co/nK2WKIT39F"}
{"label": "NOT_SARCASM", "context": "😐 https://t.co/naHH7my2wC", "text": "@foeyeahboi well it'll be better than Man of Steel but still not what I want"}
{"label": "NOT_SARCASM", "context": "Not a solar panel in sight. All that wasted energy. https://t.co/rnEbtTFWls", "text": "@LNPvoterfail @MSMWatchdog2013 Solar panels and water tanks should be compulsory on new homes ...#auspol"}
{"label": "NOT_SARCASM", "context": "This is an interesting story-- regardless of whatever phenomenon might or might not be abroad in the land or in the… https://t.co/AGDzE9MfKG", "text": "@saucerlife Definitively maybe. I'd have to concur."}
{"label": "NOT_SARCASM", "context": "@neal_katyal @USATODAY This is all because I was outed by @JayCaruso and @JoeNBC on national television. It's worse… https://t.co/TufRubox2y", "text": "@RadioFreeTom @neal_katyal @USATODAY @JayCaruso @JoeNBC Makes perfect sense now why Tom left the GOP, unlike Rick P… https://t.co/ipndY631NE"}
{"label": "NOT_SARCASM", "context": "Hey, remember that time when the Chief Rabbi congratulated his “long-standing friend” Boris Johnson on becoming PM?… https://t.co/C3mLZX4RTN", "text": "@gracelovesldn Add diplomacy to the long list of things you don't understand. Do you remember when Mahmoud Abbas co… https://t.co/FTmf8eWUvX"}
{"label": "NOT_SARCASM", "context": "@kyletringas @fifthquarterfsu @biggameJames_36 😂 bro they blocked me cuz I called out their BS", "text": "@jonny_k34 @kyletringas @fifthquarterfsu @biggameJames_36 I wonder if all fanbases are as dysfunctional as ours :).… https://t.co/nD1mvYocEB"}
{"label": "NOT_SARCASM", "context": "Thanks to Mark Andrews' clunker last night, I'm down to one guillotine league. I'm in mourning, so be nice to me today.", "text": "@PaulCharchian I’m sorry charch. Sucks when you get so close! Check our this team that got eliminated in one of my… https://t.co/KH19z5Hjz8"}
{"label": "NOT_SARCASM", "context": "Im not sure why but I feel a very personal connenction to this Pokémon... #pokemon #pokemonswordshield #pokémon… https://t.co/VqQS5vSNm0", "text": "@BrothersMurph The Nickit is not extinct. Nick caught them all. #gotttacatchemall #pokemon"}
{"label": "NOT_SARCASM", "context": "This is just... how it be sometimes... ((“explicit” content)) https://t.co/ESZdTx4Mv4", "text": "@thebrigittemoya @sarah_nicolez Goofy is a bottom do not @ me"}
{"label": "NOT_SARCASM", "context": "पलट के आऊंगी शाखों पे खुशबुएँ लेकर, खिज़ां की ज़द में हूँ मौसम ज़रा बदलने दे! Thanks Mah for memorable 5yrs as your… https://t.co/ApHTTIrejK", "text": "@fadnavis_amruta @Dev_Fadnavis @BJP4Maharashtra Truth and Honesty always wins and definitely @Dev_Fadnavis will be… https://t.co/DwXYKO0oy1"}
{"label": "NOT_SARCASM", "context": "🔴 @WayneRooney  😲 @petercrouch  ⚫️ Papiss Cisse  🏴󠁧󠁢󠁥󠁮󠁧󠁿 @JackWilshere  🦂 Olivier Giroud 🦅 @andros_townsend… https://t.co/oPfSVXHHBf", "text": "😍😍 https://t.co/RIU6Co4jFI"}
{"label": "NOT_SARCASM", "context": "نالائق اور نااہل حکمرانوں کی نالائقی اور نااہلی سے ملک کا کوئی فرد اور ادارہ نہیں بچا 🤐", "text": "@SaeedGhani1 Sindh ka kutay tu sanmbhal lo pehlay..buhat bhonktay hain or abb tu kat bhi rahay hain....Selected Chairman ka chamcho."}
{"label": "NOT_SARCASM", "context": "BREAKING NEWS: Victorian truck drivers killed at work to be counted in the workplace death tally. @DanielAndrewsMP", "text": "@TWUVicTas @DanielAndrewsMP Why were they not included?"}
{"label": "NOT_SARCASM", "context": "I’m just going to put this out there @HuskerSports every game I’ve been to football, baseball, basketball, and soft… https://t.co/xyja9TFddz", "text": "@Fresh402 @HuskerSports Ah hem!! maybe travel to Boulder earlier this year my man. The last 3 Football games I’ve a… https://t.co/BBZuitp0cK"}
{"label": "NOT_SARCASM", "context": "Help us choose who will be moving on to the final round in our search for the 2019 #ArtistoftheYear!   This week vo… https://t.co/IK2G5gWJwR", "text": "I can’t believe I’m even in this company!!!! 🥰🥰 https://t.co/D1fmZanthO"}
{"label": "NOT_SARCASM", "context": "The @geoff_calkins Show is next on @929espn  9:25 @GaryParrishCBS  10:00 @HerringtonNBA  10:20 @JessicaHuseman  92.… https://t.co/uS0y9eIYNw", "text": "@JWright929espn @geoff_calkins @929espn @GaryParrishCBS @HerringtonNBA unless I've started to cover sports I think… https://t.co/BTBOQ6cpCZ"}
{"label": "NOT_SARCASM", "context": "The Modern Hanbok that Jungkook wore started selling at the Busan Lotte Department Store! Zijangsa, the company, al… https://t.co/aQMh8kFHaW", "text": "Yesssssss I need to go get me one when I visit my parents next month! #jungkook #전정국 #GrupoDoAno #POPTimeAwards… https://t.co/4eenBP9hxm"}
{"label": "NOT_SARCASM", "context": "haha imagine if i moved out to LA in January haha imagine haha", "text": "@iIovecamprock haha do it haha"}
{"label": "NOT_SARCASM", "context": "Before work my sister told me that all her female friends (most of which have bfs) think im hot LMAOOOOO", "text": "@KassidyMurfin yes we all know you are hot this is not news to anyone"}
{"label": "NOT_SARCASM", "context": "@kilundeezy @chipukeezyvini We badala utoe ngoma kali utafutwe unaanza kubeg interview. This won't last long but a hit song will do", "text": "@HashDashTheReal @kilundeezy @chipukeezyvini Tupe YouTube link ya hiyo ngoma yako kali mwimbaji tukaskie tuache kuskia #BombYaSadam"}
{"label": "NOT_SARCASM", "context": "Won it, lost it, drawn it: @Panchero and I relive a wild one at Bramall Lane as the Blades draw 3-3 with #MUFC - li… https://t.co/PhIuqm20MF", "text": "@bladespod @Panchero listening now. Totally right about how the 'love in' from others could help going forward. I s… https://t.co/7vHPjcXcQE"}
{"label": "NOT_SARCASM", "context": "Extremely nervous about my 12-hour #stream tomorrow 😳  Someone gas me up or at least give me advice 🤩😂 https://t.co/YgZbPsJ5Di", "text": "@aquacheeseplz Take a 15 minute break every hour and stay hydrated. And PLEASE try and sleep as much as you can ton… https://t.co/yB86ZnKWRD"}
{"label": "NOT_SARCASM", "context": "Disgusting https://t.co/1S4uSUJydi", "text": "@swaggy_b_ This doesn’t sit well with me"}
{"label": "NOT_SARCASM", "context": "@AmosChewZiJun @jamesdeangeliz @JamieKennedy @JAllenMc @JamesWillems @notCIB Yes please", "text": "@LetsGetHaunted @AmosChewZiJun @jamesdeangeliz @JamieKennedy @JAllenMc @notCIB I wanna get spooked."}
{"label": "NOT_SARCASM", "context": "Forgot to post this before! Drew it late last night when the idea struck me. https://t.co/X6Cc6TG1W3", "text": "Ah this one I can approve https://t.co/Md3k2lScRT"}
{"label": "NOT_SARCASM", "context": "The Papa John interview is lovely https://t.co/bpDMDm9t9G", "text": "It sounds like they’ve altered his voice to protect his identity but forgotten to dim the lights &amp; sit him in front… https://t.co/X9CM76vzSe"}
{"label": "NOT_SARCASM", "context": "\"Good morning human~! I came by to give you this delicious secret pie I made yesterday~ Would you like one?\" https://t.co/d2fbFdH1nd", "text": "@meru_says S: It looks suspicious, does it have a horny potion or something??"}
{"label": "NOT_SARCASM", "context": "She said maybe more right? Am not giving up!!! @tiffanyyoung crossing my fingers for another #OpenHeartsEvePartII s… https://t.co/vYQtL7jKlW", "text": "@kimfany0801 @tiffanyyoung uhmmm where can u find she said more concerts for asia? i thought there are 2 in asia ?🤔"}
{"label": "NOT_SARCASM", "context": "@Maswanganye @provincialGeo @lwah_maMzi @Maphumzah @Lulubel_hlela @CB_Nkwana @somkheleomkhulu @DrMkhize4 Talk to @DrMkhize4  I need the sea", "text": "@mahlats57266765 @Maswanganye @provincialGeo @lwah_maMzi @Maphumzah @Lulubel_hlela @CB_Nkwana @DrMkhize4 Go play uB… https://t.co/vkmAXJ02ns"}
{"label": "NOT_SARCASM", "context": "and thank you for following me luv y'all https://t.co/9zk1RZcPZY", "text": "@dcsmacaroon I thank you for your existence luv~"}
{"label": "NOT_SARCASM", "context": "Those who shifted during the partition, do they ever dream of coming back?", "text": "@thecuriouself Nope"}
{"label": "NOT_SARCASM", "context": "Almost exactly 15 years apart. https://t.co/ZWcd2ngoRX", "text": "This doesn’t correlate https://t.co/HTuqPsOf7G"}
{"label": "NOT_SARCASM", "context": "Want to turn your love for #photography into a career? We asked one of our customers on how to get started as a… https://t.co/DeaRuTCtx0", "text": "@Payoneer Hello, I transferred my monthly payments to my Payoneer account - as I regularly do. It usually takes up… https://t.co/NZ8udG1wia"}
{"label": "NOT_SARCASM", "context": "sooo bri i kinda did something.. I hope you love it as much as I love you. Thank you for being such a big light in… https://t.co/AMJWhB1gXe", "text": "@onlysutherland @JonahMarais arely you fucking didn’t"}
{"label": "NOT_SARCASM", "context": "@Robrt_M_Goldste @AriMelber @BillKristol @GeorgeWill Apparently, the Constitution is meaningless to #BillBarr.", "text": "@mterr337 @Robrt_M_Goldste @AriMelber @BillKristol @GeorgeWill It appears to me that the Constitution is meaningles… https://t.co/nt82ZhPzdm"}
{"label": "NOT_SARCASM", "context": "KING JAMES ON THE ATTACK! 🔨  @Lakers | #LakeShow https://t.co/5Ruo77u5oq", "text": "@NBA @Lakers Skip on life control"}
{"label": "NOT_SARCASM", "context": "Luke has Corey Joseph on LeBron...on purpose??", "text": "@UnwrittenRul3s First half LeBron was primarily guarded by either Joseph or Bjelica and somehow neither was a disaster."}
{"label": "NOT_SARCASM", "context": "Thinking about smoking cigarettes again", "text": "@FaZeYaxn https://t.co/JSRQn99ku7"}
{"label": "NOT_SARCASM", "context": "@12PitchAtBat @TRHLofficial Different spectrum. The traditional axis was never a measure of the size of government.", "text": "@MikkelsonsMad @12PitchAtBat @TRHLofficial On which is it right wing? Economic Freedom? Group vs. Individual? It wa… https://t.co/uTuQIjQ6Qk"}
{"label": "NOT_SARCASM", "context": "The House of Representatives will not get President Donald Trump's financial records for now, the Supreme Court sai… https://t.co/3iypuVhgbp", "text": "@kaitlancollins WHAT IN THE HELL IS HE HIDING???"}
{"label": "NOT_SARCASM", "context": "@JimKerr1973 @jeremycorbyn @Telegraph Yep, and those will be the managers. Lecturers, meanwhile: https://t.co/kGXpOflYPf", "text": "@UssFact @JimKerr1973 @jeremycorbyn @Telegraph So work hard and earn a top job (nepotism aside), I don’t get your p… https://t.co/RebwKSxqGY"}
{"label": "NOT_SARCASM", "context": "It’s that time of year where you immediately stop thinking a guy is hot after he posts a hunting picture", "text": "@Stew4rt_LiTTle 😂😂😂"}
{"label": "NOT_SARCASM", "context": "Best. Fans. In. The. League.  Here's to 350 consecutive sellouts! #DubNation https://t.co/JETPwtnfoB", "text": "@warriors Can’t believe this many fans are coming to see you lot lose &amp; not make playoffs 😬"}
{"label": "NOT_SARCASM", "context": "@spotmccormick Yep. Planning on a slightly earlier release. Hopefully in time for your Turkey Day drive", "text": "@BetterRivals @spotmccormick Welp, letting my wife know i've got the playlist sorted then."}
{"label": "NOT_SARCASM", "context": "TOP SHOTTA SHIT ... 😂😭 https://t.co/oaSClUDojn", "text": "Are you even Jamaican if you don't recount a story with a whole bunch of theatrics? https://t.co/TQUxdEH3Nl"}
{"label": "NOT_SARCASM", "context": "A great #horror movie character? Who is the first that popped into your head. For me, when I thought of the Q, Dr.… https://t.co/x7KKPg8F1p", "text": "@HMFAhorrorfan Julia from #Hellraiser https://t.co/8acYXHTyag"}
{"label": "NOT_SARCASM", "context": "@KairenMurphy That shirt giving me expired gym membership vibes", "text": "@ro3l_ @KairenMurphy I really love yah energy when you off the drugs 😭"}
{"label": "NOT_SARCASM", "context": "@nkolakowski Oh my god this is the best thing ever", "text": "@PauljGarth @nkolakowski None of you will ever be in the pizza category."}
{"label": "NOT_SARCASM", "context": "Which Housewife can I get on Cameo to end a friendship for me? This is brutal. #BrokeUpOnCameo https://t.co/jfr6gluovz", "text": "@LoveAndyC Dorinda if you wanna make it nice  Ramona if you wanna make it sting...er"}
{"label": "NOT_SARCASM", "context": "THAT WAS ENERGY ENERGY NON STOP TF", "text": "@wanggayee jackson at the end of hard carry performance... DID YOU SEE THAT"}
{"label": "NOT_SARCASM", "context": "@ha3chie sexxiii 😏 i got a six hour shift lets talk after 🙈", "text": "@jeosmos omg at what time?? 😏 i’m closing 👎🏼"}
{"label": "NOT_SARCASM", "context": "I’ve had this same number since I was 19. I’m officially changing my number 2020!!", "text": "@True_Dee82 U say this every year"}
{"label": "NOT_SARCASM", "context": "Not that I'm counting, but the Sens have 11 losses and the Leafs have 12.", "text": "Mom come get me, I’m scared... https://t.co/yoxRllElAO"}
{"label": "NOT_SARCASM", "context": "Controversial food opinion: pomelos are better than grapefruits, but they are more annoying to eat.", "text": "@distributedcog Recently tried pomelo for the first time and I had exactly the opposite experience!"}
{"label": "NOT_SARCASM", "context": "me and karime leaving the brockhampton show https://t.co/K8bceZSUAx", "text": "@doomtechs did u tell matt i said hi marry me"}
{"label": "NOT_SARCASM", "context": "People who can rock a middle part are dangerously powerful.   However. Let it be known I’ve never been one of them. https://t.co/pvMrjqcwJU", "text": "Bring back the Michael Gagliano middle part 2020 https://t.co/BdNNONgcPH"}
{"label": "NOT_SARCASM", "context": "Today is my Friday 😩🙌🏽", "text": "@lexamillionn Same! I’ll see them on Monday, don’t call meeeee 🤣"}
{"label": "NOT_SARCASM", "context": "“Tried camouflaging my feelings but now my armor fatigued”  @blackxparty - Purple Heart ft @LouisianaBeedy |… https://t.co/Ctc1tCspdu", "text": "@LouisianaBeedy @blackxparty 🔥🔥🔥🔥"}
{"label": "NOT_SARCASM", "context": "They’re afraid to make nearly as many new, original IP’s as they should be. Rely on the flagships more than anyone.… https://t.co/TykWaHVzsy", "text": "@IntroSpecktive I mean Splatoon and Arms exist. Astral Chain too if that counts"}
{"label": "NOT_SARCASM", "context": "1️⃣8️⃣🥳 https://t.co/TtHPdS7isR", "text": "@sandraa__h Happy birthday 🥳"}
{"label": "NOT_SARCASM", "context": "I’ve been working all day. No one thought to send me this picture? Real fucking interesting. https://t.co/GllOBbwheI", "text": "@jazminiemin SORRY I DIDNT KNOW YOU HADNT SEEN IT. I SAW IT SUPER LATE."}
{"label": "NOT_SARCASM", "context": "mAn y'all would be the luckiest if minsik actually goes to the cupsleeve event", "text": "@sojuremix we hope so huhuhu"}
{"label": "NOT_SARCASM", "context": "..... 9 times in one day is nothing.", "text": "@MayraTweeets I..."}
{"label": "NOT_SARCASM", "context": "Tonight was clean out the fridge egg fried rice.   What did you have?? https://t.co/qGr70w8Dca", "text": "@WendyWings Some of the best meals are the ones made from ‘all of the bits’. Looking good!"}
{"label": "NOT_SARCASM", "context": "@faridyu Yelich has a 190 wRC+ at Miller and a 150 wRC+ away. He’s got a helluva lot of weird home help and almost… https://t.co/DAMlVDvPIw", "text": "@dwest9cubs @faridyu So a .310 isn’t good for a road BA? Also, Miller Park is a hitter-friendly Park. Plus, after t… https://t.co/kldIIiXch2"}
{"label": "NOT_SARCASM", "context": "Kinda very drunk ama hoes", "text": "@PlatanoRanger wanna run away together?"}
{"label": "NOT_SARCASM", "context": "Repitan conmigo y dejen de frivolizar: la austeridad no es qué reloj me pongo, qué ropa uso, dónde vivo o en qué lu… https://t.co/5S4o9q5vw8", "text": "¿Y de dónde crees que salen los relojes, la ropa, las casas y las comidas, querido Hernán? https://t.co/GhVneTjJ5D"}
{"label": "NOT_SARCASM", "context": "@Eric_M888 I don't think at all it would take Torres and the Indians know that", "text": "@BobbyMilone29 @Eric_M888 So what would it take?"}
{"label": "NOT_SARCASM", "context": "To the folks grieving their loved ones, homes, pets and wildlife lost to the Fires. Your Leader’s priority was ensu… https://t.co/AgWMCVh7Z1", "text": "@Lynny_Pinnie He really is a repugnant bucket of tick infested dog vomit with the intelligence of a corpse"}
{"label": "NOT_SARCASM", "context": "I swear this girl done been here before dawg lmao https://t.co/OIumXEgJRR", "text": "Reminds me of the girl you sucked on her bloody tampon🥴 https://t.co/LncPxu238K"}
{"label": "NOT_SARCASM", "context": "Seen elements of Firmino/Benzema in Martial this season. Wonder if that's a model Solsjkaer may be keen to replicat… https://t.co/8NX9xAqkem", "text": "Marcus and Haaland are actually brilliant playing in-between the channels. If Ole is really considering him, it mak… https://t.co/dvkQ11aHpr"}
{"label": "NOT_SARCASM", "context": "Ok so I've been thinking! Let's say @realKILLERkross does sign with @MLW   Should he first fued with… https://t.co/Wn1kyAYO0W", "text": "@JoeDiano247 @realKILLERkross @MLW @OneWorldWarrior @TheBadReed @TeddyHartIsBACK @SAMOANWEREWOLF Kross vs fatu!!! I… https://t.co/g9R7Po4Csd"}
{"label": "NOT_SARCASM", "context": "I wached this entre thing and then read this. I'm baffled.   https://t.co/z3xe0HO22z", "text": "@acolaizzi Very strange."}
{"label": "NOT_SARCASM", "context": "If you were as moved as I was by Ambassador Yovanovitch‘ s testimony today , retweet #BravoMasha !", "text": "#BravoMasha I was brought to tears a few times during the testimony today. I can’t even express how grateful for th… https://t.co/m9MOoCLCQn"}
{"label": "NOT_SARCASM", "context": "Doctors always think just because you’re not on b.c you’re trying to get pregnant like girl the shit is poison🙄🙄🙄🙄", "text": "I was scheduled to get my tubes tied the same week I found out I was pregnant 🤒 I was sick! https://t.co/G1PBnq60tG"}
{"label": "NOT_SARCASM", "context": "https://t.co/hwENLAwjWf", "text": "@MisserCain nooooooooooooo"}
{"label": "NOT_SARCASM", "context": "#ShuklaSeMatDaroBahuGang? 😂🤣 #BiggBoss13 trends have been super crazy this time!", "text": "@panku_ Ikr! It’s the counter of #ShuklaSeMatDaroSalman"}
{"label": "NOT_SARCASM", "context": "@iammickyjones I took my daughter last week. It was powerful. I was so moved when she said she wasn’t going to stop… https://t.co/s2LMeoWcOr", "text": "@julianaabraham @iammickyjones can I take my 8 and 9 year old who already have a pretty clear understanding of raci… https://t.co/LKzQceBryg"}
{"label": "NOT_SARCASM", "context": "when you have a group member who always just wants to write the executive summary   and the executive summary’s 1 p… https://t.co/su78Y0FvRW", "text": "@lu3_bunny honestly why do group projects even exist"}
{"label": "NOT_SARCASM", "context": "Living in Ohio was by far the worst time of my LIFE.", "text": "When you lived up there and what part ? https://t.co/1DX6vVxi0e"}
{"label": "NOT_SARCASM", "context": "Hockey is played by predominantly white males. It has a history of embracing misogynist behaviour. The cost exclude… https://t.co/NZtc11bJQZ", "text": "@AllyGarbs Your telling the truth. Hockey claims it's a diverse sport or at least tries. But incidences like this p… https://t.co/DGIQ60dYre"}
{"label": "NOT_SARCASM", "context": "BROOOOOOOO!!!!!!!! https://t.co/Vzvy2u0IYi", "text": "OMFGGGG🥴🥴🥴🥴🥴🥴 https://t.co/nZldfaUwQm"}
{"label": "NOT_SARCASM", "context": "Dear MDC. You will not get @nelsonchamisa into the State House if you continue failing to communicate.  Don’t rely… https://t.co/kLAetgFsXm", "text": "Your point is well taken. Although I am of course biased I dont think it is so much a failure to communicate, becau… https://t.co/ajL5g8YjmW"}
{"label": "NOT_SARCASM", "context": "Anyone who says free Palestine and won’t say free Khalistan a joker man keep that same energy", "text": "@FreeKhalistan01 Difference is that majority of Palestinians don’t want to be part of Israel while majority of Sikh… https://t.co/a6i5g4pZI7"}
{"label": "NOT_SARCASM", "context": ". @RissasPieces__ https://t.co/6veJ8w6XRP", "text": "@extraordinaRAY Why I comment back with my emoji? 😕"}
{"label": "NOT_SARCASM", "context": "You are more than caffeine and less than cocaine for me.", "text": "You are more than caffeine and less than chai ❣️ for me   As chai  is❣️ https://t.co/dDVmu7yZZL"}
{"label": "NOT_SARCASM", "context": "I actually do wanna do a Santa con this year lol 😂 it’s be fun being a drunk little Santa for a day", "text": "@Ambitious_Dena Asbury might not have it this year 😕"}
{"label": "NOT_SARCASM", "context": "$xrp- why is it everytime we should be going up we go down ?  litraly at the exact moment its always a down not up ! https://t.co/SNSX3Jqcuy", "text": "@shane_xrp2 It’s refusing to break through that 50 MA on the 1hr (XRP/USD) but the gooseneck is forming..."}
{"label": "NOT_SARCASM", "context": "I'm so sorry for not being able to respond today. This was my last day at work. From tomorrow onwards, I'm all tech… https://t.co/asGk8b67ne", "text": "@stufflistings All the best buddy, and welcome home :)"}
{"label": "NOT_SARCASM", "context": "“نوجوت سنگھ بنیادی طور پر قادیانی ہے” غفور حیدری #JUI https://t.co/14ZppfCwTc", "text": "نوجوت سنگھ سِدّھو صاحب @sherryontopp انوں ہُن تسی ہی جواب دیو ساڈے وس دی گَل نئی ۔۔ 😉  @ImranKhanPTI… https://t.co/LoehRL7WN0"}
{"label": "NOT_SARCASM", "context": "Hopefully twitter doesn’t butcher this, BUT I now have my favorite my favorite artist on my body. I can’t explain h… https://t.co/q0ORBeBF08", "text": "@NapsPartTime @GanjaWhiteNight @Scrawford98 YESSSS!! 😍"}
{"label": "NOT_SARCASM", "context": "Everyone knows you can’t keep bottling up the pain when the glass is see through.", "text": "@mekiyaaah Girl what kinda shit is this?"}
{"label": "NOT_SARCASM", "context": "I want to draw ppls OCs but if I even try I feel like it's not asking for their permission hhhhh", "text": "@melonkolly every single person I know literally cries when someone draws their oc's so.... XD"}
{"label": "NOT_SARCASM", "context": "help a semi-famous tiktoker responded to my dm fksidakkx help when it comes to talking i’m awkward as heeeeLLL https://t.co/CtyYrimQ7g", "text": "@JOONSJORTS treat them like a friend"}
{"label": "NOT_SARCASM", "context": "Film Twitter finally stopped fighting with me this week and became positive again.  Let's keep it going.  WHAT is y… https://t.co/Em5qCnNFCv", "text": "@ashleylynch Galactic Gigolo. It leaves so many questions. Like \"How the hell did this guy pitch the plot and why t… https://t.co/yQLUPXNzBa"}
{"label": "NOT_SARCASM", "context": "@elonmusk Think @elonmusk will make a model with a bigger bed, more for a contractor. I don’t see me putting tool b… https://t.co/ZwprYqsxje", "text": "@McLogey @elonmusk Bed opens for toolbox near gate. https://t.co/eAf9XaNbyy"}
{"label": "NOT_SARCASM", "context": "https://t.co/JeLMtOsTcg", "text": "Nah just 50 bike go carry me go where I go plug as many as I want 😋😋😋 https://t.co/1yyQyZ5Gn4"}
{"label": "NOT_SARCASM", "context": "\"We are not going to privatise @Eskom_SA. We are not going to sell Eskom. Eskom will continue being owned by our go… https://t.co/w2lN9yb5bH", "text": "@mzwandileMasina @Eskom_SA @CyrilRamaphosa So it can be easy for the looters to continue looting and then after req… https://t.co/9UgCxw0uAI"}
{"label": "NOT_SARCASM", "context": "One of the Finest Urbane, Intelligent &amp; Quintessential Gentleman @DrJoeAbah on this app, well opinionated   I strol… https://t.co/yNhH0QpPNM", "text": "@AgernorAgernor @DrJoeAbah I'm not sure he will stick to an opinion even where superior arguments prove them wrong.… https://t.co/Awwta8kl6c"}
{"label": "NOT_SARCASM", "context": "Well done! Acing it as always! #LGBTQ #racingpride https://t.co/XWFsm6Rrlv", "text": "@racingprideuk Well done @CammieRacing I was trying to upload @racingprideuk logos on to Gran Turismo to put on min… https://t.co/zi5nOhm3PD"}
{"label": "NOT_SARCASM", "context": "Please quote tweet this with your most controversial food opinion, I love controversial food opinions", "text": "I've hosted Thanksgiving for a crowd my entire adult life (except for last year when I was 9mo pregnant). I cook co… https://t.co/IrvFjylbmp"}
{"label": "NOT_SARCASM", "context": "Hey guys I wanna thank you all for your amazing support! Reminder that the nade jump kill competition is still on g… https://t.co/CJFQgUZatp", "text": "@RemixTytan U nice asf for doing this hope u be big"}
{"label": "NOT_SARCASM", "context": "Ya favorite birthday girl staying foxy 🦊 https://t.co/P9WMFPUB85", "text": "@Bravebebe HAPPY BIRTHDAY ❤❤❤❤ https://t.co/JYDzSwduN4"}
{"label": "NOT_SARCASM", "context": "ボールが跳ねまくる動画です https://t.co/KIJLCrcTyD", "text": "Thanks Japan! 🇯🇵 https://t.co/6qPJQTxkIC"}
{"label": "NOT_SARCASM", "context": "Imagine if they cloned baby Yoda and used him on the Imperial side in the new movies similar to Jango, that would b… https://t.co/cDXX4wHSLK", "text": "@Joe2596 Apart from the fact that he's not Yoda so he might not be force sensitive at all lmao, although there are… https://t.co/F8bumTnj81"}
{"label": "NOT_SARCASM", "context": "Just wondering how people are supposed to feel when their MP’s decide to go to resort towns where they’re incentive… https://t.co/blCIlTnXso", "text": "@iMisred The have repeated the point over and over again.   They are running away from one person only not the parl… https://t.co/gUOfhKnjfv"}
{"label": "NOT_SARCASM", "context": "茜ちゃんとインタノン選手との試合は茜ちゃんのギミックワールドが輝きを放つから楽しみにしています(°▽°)✨✨  #山口茜 ちゃん #akaneyamaguchi #HongKongOpen 2019 #再春館 https://t.co/t3dPfSoFoJ", "text": "@castella0128 fantastic match by Yamaguchi💪🏽🙌🏽"}
{"label": "NOT_SARCASM", "context": "Billboard is changing the rules to its album charts, affecting the way sales will be counted on those tallies in re… https://t.co/Zt6Kj5M56b", "text": "say what you want about Nicki Minaj, but that bitch has never been caught up in a lie https://t.co/xzeYsOtr7J"}
{"label": "NOT_SARCASM", "context": "Cried in the parking lot because I had to take the trash out at work and I’m too short to open the dumpster", "text": "@mononokoi you’re so precious 🥺"}
{"label": "NOT_SARCASM", "context": "I just wanna be held and be validated is this too much to ask?", "text": "@yaboy2hatz yes, you needy bastard"}
{"label": "NOT_SARCASM", "context": "You cannot make everybody happy, You’re not a taco", "text": "Watch me Keili https://t.co/DC0KYGuBqf"}
{"label": "NOT_SARCASM", "context": "a diva https://t.co/X3C9pJRiK8", "text": "@kdaakali omg that plushy I need"}
{"label": "NOT_SARCASM", "context": "seeing as my dad has many fans i thought i’d share that its now his birthday", "text": "@newtsrapp Happy birthday to your dad!"}
{"label": "NOT_SARCASM", "context": "I’m running for Congress to represent CA-25. If we fight together for this seat, it will be the People’s seat. Figh… https://t.co/2Vi07QjxV8", "text": "@cenkuygur “Women, ignore these at your peril,” he wrote. “Rule 1: There must be some serious making out by the thi… https://t.co/hsIWocKfMc"}
{"label": "NOT_SARCASM", "context": "@MysterySolvent He doesn’t know what a can is", "text": "@StevenErick1976 @MysterySolvent Diet Coke cans...but that’s it."}
{"label": "NOT_SARCASM", "context": "I ain’t dark. I’m chocolate. https://t.co/Ny9FNivlye", "text": "Wait because this might have changed my mindset https://t.co/UuBF4HFDAB"}
{"label": "NOT_SARCASM", "context": "Does anyone actually preheat an oven? 🤔", "text": "@pinktastic615 My ex wife. Used to drive me nuts"}
{"label": "NOT_SARCASM", "context": "@RayFinkleLives @leawood241 @AdamSchefter He finished the season with Alex Smith's team and helped lose the superbowl.", "text": "@erin_rose80 @RayFinkleLives @leawood241 @AdamSchefter Except he was the best player on the field in the super bowl"}
{"label": "NOT_SARCASM", "context": "\"show decency'? He lived here for 30 YEARS and never applied for citizenship. There are \"decent\" people waiting yea… https://t.co/is19aWJcai", "text": "@UNLVRebelGrl No doubt, esp when my wife spent $4k in fees &amp; 3 years to get her residency status &amp; eventual citizenship."}
{"label": "NOT_SARCASM", "context": "Is your christmas tree up yet? 👀", "text": "@GGAAHHHHH not enough space in our tiny apartment....but it would have been up Nov. 1st"}
{"label": "NOT_SARCASM", "context": "y’all still watching the aaas?????", "text": "@seunqminz not me  😗✌️"}
{"label": "NOT_SARCASM", "context": "made an only fans and i do NOT like it... why is this so official... why do they want my government name??? im mad", "text": "@stillxampd Becuase it’s a real job"}
{"label": "NOT_SARCASM", "context": "Nobody:  Rainbow 6 gamers: https://t.co/41BRUmPTXp", "text": "I am in tears tyvm https://t.co/UhnG7v1I4A"}
{"label": "NOT_SARCASM", "context": "Hey @newbiestoreuk, saw a dress we loved in your Milton Keynes store but think we just missed out on it. Can't find… https://t.co/JKaoUE9pgZ", "text": "@Schneffni Hey @Schneffni, we're so glad that you liked the dress 😊Here is a link to it on our online store: https://t.co/yZQ7x7mGeN"}
{"label": "NOT_SARCASM", "context": "I don’t know why folks just can’t admit that they hate to see black boxers winning. If a fighter knocks his opponen… https://t.co/uPW4rervt2", "text": "@Reese_Sr35 Im a fan but all Wilder has is a big right hand though.... and I love Floyd and shakur as well. A big p… https://t.co/KcIe5fLzJF"}
{"label": "NOT_SARCASM", "context": "Dear @WashArchdiocese, I was very disturbed to hear that two of your priests, Fr. Richard Mullins and Fr. Andrew Wa… https://t.co/dWs8y27wbp", "text": "This public denunciation of priests by name for doing something innocent is very bad. This is much worse that criti… https://t.co/yDOejkQikc"}
{"label": "NOT_SARCASM", "context": "Another year !! Thank you 🙏🏼🙏🏼🙏🏼 21 again😂😂😂🍻🙏🏼🙏🏼🙏🏼👊🏼 https://t.co/BxaY82fZIF", "text": "@rafaserna1 Happy Birthday Nephew! https://t.co/VF7LT40htc"}
{"label": "NOT_SARCASM", "context": "ITS MY BIRTHDAY 🍾🥳", "text": "HAPPY BIRTHDAY https://t.co/3cTveRRFXT"}
{"label": "NOT_SARCASM", "context": "#TheDeadBeats 💋 I was thinking about sharing favorite album art ~ even if it came off a CD or whatever ~ always be… https://t.co/BcSH6MPByt", "text": "@SimonJester007 @JanGilson @LJDYGK @McAmberdawn @cocozl2 @Cool_Phoenix333 @GeGe0603 @JacobsLytle @ithrah69… https://t.co/i3LWOFy0Jp"}
{"label": "NOT_SARCASM", "context": "Good Morning🥰  It’s tired Tuesday for me but I hope you all have an amazing day 🌻🌼", "text": "@MsStone37 myaaaaawning wyd this morning..."}
{"label": "NOT_SARCASM", "context": "I've been single for 7 months. If anyone wants to confess their feelings now is the time.", "text": "@Evanit0 Ive been single for 20 ***pained screams***"}
{"label": "NOT_SARCASM", "context": "OK, so much for mobile telecoms. But are Amazon, Apple, Google, Facebook, Twitter, Instagram &amp;c. paying their fair… https://t.co/RqAqnkZjD8", "text": "@bryankav123 If they own any spectrum, then clearly not."}
{"label": "NOT_SARCASM", "context": "@djishh Me and @IsaiahGrigsby always talk about this.", "text": "@Johnas_Street @IsaiahGrigsby Y'all need to start tagging me in on these conversations"}
{"label": "NOT_SARCASM", "context": "@Thomas_BurnerAC @CallMeAgent00 A Disney-owned network could make that happen", "text": "@Far2Optimistic @Thomas_BurnerAC @CallMeAgent00 Nigga if nasa can’t go to space regularly What makes you think Disney can."}
{"label": "NOT_SARCASM", "context": "It’s going to be interesting to see how @Lj_era8 success changes the QB evaluation. It won’t change the type of QB… https://t.co/SUGeSrsvZ1", "text": "All I can think of is how many QBs were passed over because of these boxed in standards.   @loumoore12, what’s your… https://t.co/5B9yzJFmUo"}
{"label": "NOT_SARCASM", "context": "BIG TRUUUUUSSSSSTTTTTTTT https://t.co/jkEPmWhF9V", "text": "Bro just stop....ur not hopping in this bandwagon https://t.co/Ogr2qeiUNt"}
{"label": "NOT_SARCASM", "context": "Do I look similar to this cutie little dragon? :O https://t.co/2SxqUHa5tL", "text": "@wheeinyo It's a salamander-"}
{"label": "NOT_SARCASM", "context": "@_Dija_h @adamu_maddibo Not to sound rude, but i think thats all you guys bring to the table", "text": "@uxtaz @_Dija_h You’ve said it Bro😂😂😂🙅🏽‍♀️"}
{"label": "NOT_SARCASM", "context": "I love the accounts I follow, but if y'all going to keep liking Hillary, AOC and Schiff tweets so they keep appeari… https://t.co/bFhWKs4QnK", "text": "@Natersh13 https://t.co/EdOAKSlVY9"}
{"label": "NOT_SARCASM", "context": "Very very very occasionally I’ll think “wow I’m lonely it would be nice to be in a relationship” and then I see/hea… https://t.co/h0mZklLxMB", "text": "@2chis1dogmom There‘s a lot to be said for having another person to share everything w/ including love &amp; support. S… https://t.co/2QeCDUNHw4"}
{"label": "NOT_SARCASM", "context": "My god! The yoon trolls are out in force are they no? 😱 I’ve blocked about 40 already!!", "text": "Its fun isnt it? It's like a gaming app! https://t.co/CiK8yK9mB2"}
{"label": "NOT_SARCASM", "context": "My opener this weekend boutta just be \"hey babe, I got Disney plus\"", "text": "@C4mpyy I did and made 95$ off of it"}
{"label": "NOT_SARCASM", "context": "wow why aren't we talking about this more https://t.co/y1XbWfLSI2", "text": "@TheBenCrook Why do you have google alerts instead of espn🧐"}
{"label": "NOT_SARCASM", "context": "@CaraKorte @BernieSanders That’s exactly how I feel, sometimes I wonder if I’m even democrat? I think I don’t belon… https://t.co/LDeyxsacvO", "text": "@IlirSaipi @CaraKorte @BernieSanders Great then you’ll be helping Trump win. And Bernie isn’t a Democrat.  So start there."}
{"label": "NOT_SARCASM", "context": "One of those days which started with such promise. With tears of musical joy. And yet now just this deep feeling of… https://t.co/bRvXvGF7ZS", "text": "@CzarinaRMusic Mmmorning... if you’re in the USA (I get confused, thought you once called Singapore home) . Hope yo… https://t.co/qCzedfsTea"}
{"label": "NOT_SARCASM", "context": "First time playing it ever, and I approve. One of the better arcade games I've played. They also had Joust which was excellent.", "text": "@nullterm Joust is right up there, especially 2 player"}
{"label": "NOT_SARCASM", "context": "How many Provinces have you been to? Me: 4 https://t.co/qLPM2keNnS", "text": "EC; KZN; WC; FS; GP https://t.co/LylCim1TTG"}
{"label": "NOT_SARCASM", "context": "IDW made a story arc in which Amy kissed Charmy Bee", "text": "I dont like that https://t.co/zWiHE2Uu3X"}
{"label": "NOT_SARCASM", "context": "#Chanakya https://t.co/XpGZkRWmh8", "text": "@ArunudoyB Whatever has happened is not good  Whatever will happen is not good. ( as of now)."}
{"label": "NOT_SARCASM", "context": "Junior doctor life is having NFI whether I start work in my own city in 8 weeks or 600km away instead.", "text": "@c3convertase Which is truly not acceptable. Yet we are still viewed as expendable “bums on seats” ☹️😡"}
{"label": "NOT_SARCASM", "context": "“From Russia if you’re listening to Ukraine, 'Take out Joe Biden for me', Donald Trump making clear that he can’t w… https://t.co/LZYr6qG0zl", "text": "This statement should’ve been said four years ago. When the media picks their favorite......smh   @Wonderbitch82 https://t.co/g0P6fenlKd"}
{"label": "NOT_SARCASM", "context": "This is my short form summary on the Beat with MSNBC’s Ari Melber - of all that’s wrong with this bribery/extortion… https://t.co/qj0iWLgh4l", "text": "@JonFlan This should be your mascot🌟 https://t.co/sZDhV90H0Z"}
{"label": "NOT_SARCASM", "context": "My beautiful baby girl straight out of heaven 😍#BellaBug #BellaBoh   11/15/19 https://t.co/mpyaDowtRl", "text": "@boh_boh11 Congratulations Neboh"}
{"label": "NOT_SARCASM", "context": "@AfcWecaredoyou @GoonerFanzine @Arsenal Why everyone in a panic to panic...? Chill tf out... Let the season take it… https://t.co/pUNcgOtQv8", "text": "@AFCbenlavin @AfcWecaredoyou @GoonerFanzine @Arsenal Can't you see what's happening? The club are in a decline. Get… https://t.co/cmP72I6Tay"}
{"label": "NOT_SARCASM", "context": "I feel like I’d look nice with an eyebrow ring", "text": "@soju_nights with those eyebrows?? yesss"}
{"label": "NOT_SARCASM", "context": "Battleborn servers are closing in January 2021:  - Game has now been delisted from digital storefronts - Virtual cu… https://t.co/DBg5tFQKjM", "text": "@Toadsanime @AtlsShrugd people play this.........i thought the servers were already gone"}
{"label": "NOT_SARCASM", "context": "Don't know what to do for Thanksgiving? Just come down to 'lil Miss Ery's cafe! @Panzucakes will take right proper… https://t.co/G0xGyt7LbD", "text": "@erakir @Panzucakes Think I'll come on down while Urth hangs with folks. Gonna want like... all your eggs and bacon."}
{"label": "NOT_SARCASM", "context": "i guess shower pics are my thing now? https://t.co/8Gmu0GrCyb", "text": "sky out here showing bitches how to do the thing😍 https://t.co/mcxnBaowBX"}
{"label": "NOT_SARCASM", "context": "Update - OL I495 beltway near Rt355 Rockville Pike, debris from roadway went through windshield of car &amp; struck dri… https://t.co/QaCpoitrpD", "text": "This is crazy, smh. https://t.co/KCFmIPcUU6"}
{"label": "NOT_SARCASM", "context": "I have 10k RP I need to give away. That means there are 10 people I will give 1k RP to. All you have to do is reply… https://t.co/GpBCqHPn2e", "text": "@RiotVedius https://t.co/0hGGRaZeYg"}
{"label": "NOT_SARCASM", "context": "Vote Murray, get Corbyn!  Voters in Morningside and Merchiston today who have previously voted for Ian telling me t… https://t.co/8WucWgDlxg", "text": "@CllrNickCook What’s your ideal Brexit deal with the EU, Nick?"}
{"label": "NOT_SARCASM", "context": "@NyaswitchNya Usually, from all the commissions I got, artists can take from 2 days to 10 days, sometimes longer and sometimes shorter.", "text": "@mysterious_kaos @NyaswitchNya It greatly depends on current workload and other factors.  Many of mine take a month… https://t.co/ZikgSRGR9g"}
{"label": "NOT_SARCASM", "context": "Triller King? 🙃 https://t.co/5akTikDcH6", "text": "na i need to learn how do thisvtriller thing man https://t.co/mbtURC9BsP"}
{"label": "NOT_SARCASM", "context": "New product alert - reusable sanitary towels! - https://t.co/GI0bm6rcCD https://t.co/WP0n3hs4gk", "text": "@mamalunayoni Nice one !"}
{"label": "NOT_SARCASM", "context": "Melo drops 25 in 31 minutes 🔥 https://t.co/pHbeirmqB0", "text": "@MikeMiller_Time 👀 https://t.co/skarR9YS8Z"}
{"label": "NOT_SARCASM", "context": "I have to say that my college life has drastically improved since August and thank god for that", "text": "@Starbuckles What changed?"}
{"label": "NOT_SARCASM", "context": "Timing is everything. https://t.co/1t1O9CESjX", "text": "@GrahamSmyth Reckon this is his way of saying he is staying Graham? You heard anything on todays rumour?"}
{"label": "NOT_SARCASM", "context": "Find out how we developed a thrilling new mode for Shovel Knight Showdown - Chester's Choice, an ever-shuffling rou… https://t.co/o6gaUkQGXn", "text": "@YachtClubGames Is that all the characters"}
{"label": "NOT_SARCASM", "context": "I stand behind ravens &amp; patriots going to the super bowl this year. Browns......yea, anyways https://t.co/Vpr4xy5O4m", "text": "@Isthatpariss Aye aye aye we gone shock the world I promise no super bowl but a playoff appearance fasho"}
{"label": "NOT_SARCASM", "context": "Blue Story: UK cinema ban called 'institutionally racist' https://t.co/53bptgJLcO", "text": "Check My Thoughts On It   TSTALKS: Vue Cinema Bans Blue Story https://t.co/GqPHBgAQrr https://t.co/OmkeN2iPzi"}
{"label": "NOT_SARCASM", "context": "Tag @BTS_twt and tell me who is my Bias? Or who should be my Bias ?  If you guess it right.... I won't give you any… https://t.co/sJkzGnWiA6", "text": "@Littlevijeta @BTS_twt mochi @BTS_twt"}
{"label": "NOT_SARCASM", "context": "Only thing stopping me from throwing this controller through the wall is knowin my mama might stab me", "text": "@arionnafr 😂"}
{"label": "NOT_SARCASM", "context": "@vijayshekhar dear sir..a senior citizen neighbour was defrauded of Rs98000 when someone called him to load Rs5 int… https://t.co/bmsL9vNoRj", "text": "@Guru20044997 Hi! Please share the query reference no. (if any)/ registered mobile number via DM so that we may ass… https://t.co/b30kHjpNpT"}
{"label": "NOT_SARCASM", "context": "also: i had a giftcard on me https://t.co/V3xvYVsAXx", "text": "@destxt omg i’m jealous ;-;"}
{"label": "NOT_SARCASM", "context": "UPDATED: Toronto police investigating 3rd incident of feces being dumped on person  https://t.co/WzZxF2TFjG https://t.co/ozgO9AHaHF", "text": "LMAOO what is this mans motive? is this a political statement? what’s going on https://t.co/CXQKwlR1Zb"}
{"label": "NOT_SARCASM", "context": "Don’t mind Devin talking smack in the back ground ⚡️ Saturday workouts are my fave https://t.co/miQk4qXimX", "text": "God when ooooo https://t.co/vVhsUMerlC"}
{"label": "NOT_SARCASM", "context": "@pragmatometer Nope. There is no intent to confuse, nor an experiment in progress, other than the usual one, which… https://t.co/AzFfljc6t3", "text": "@BretWeinstein @pragmatometer Again, you rock, but the root of the problem is that your perceived expertise on Chri… https://t.co/crN6aa8njk"}
{"label": "NOT_SARCASM", "context": "I'm outlining a book that doesn't have any weird shit in it. No alien children or possibly imaginary panthers. It's… https://t.co/m8rBlCsNTe", "text": "@davidowenauthor What I suspect you're trying to tell us, David, is that you're writing a novel for adults!"}
{"label": "NOT_SARCASM", "context": "Cam gave out free Thanksgiving meals to 1,300 underprivileged kids on Monday.  The QB says it’s been a “trying year… https://t.co/RGyBzCUvOn", "text": "I want him out of Carolina so bad. I want to cheer for Cam 100%. https://t.co/HMhvo51KDV"}
{"label": "NOT_SARCASM", "context": "Always be aware of your surroundings https://t.co/1QfJhL5Ou4", "text": "omg.... i live there thats scary https://t.co/Q7MzHAPj19"}
{"label": "NOT_SARCASM", "context": "Im TIRED of being bullied &amp; harassed by men. @JacobsLuzuko fetch yourself real quick 'cause you really don't want m… https://t.co/8q8zs5rHoc", "text": "@YoliShade I would really appreciate to know what your motivation is. Honestly. I don't keep tweeting. I have only… https://t.co/pbUMP6PbzC"}
{"label": "NOT_SARCASM", "context": "@AppleSupport I need help 13.2 update made my app anyfont non functional how can this be fixed?", "text": "@Dragons_Quest Hello and thanks for your message today!  We’re glad to be able to assist you.  What device are you… https://t.co/9EzY0Zdiip"}
{"label": "NOT_SARCASM", "context": "@LateRoundCorner @Yoshi2052 I think that was the makeup punt from when he drew a 12 men penalty got pulled for tucker who then got pulled.", "text": "@Brendanc2000 @LateRoundCorner @Yoshi2052 no after that sam punted"}
{"label": "NOT_SARCASM", "context": "Would you rather have Sean McVay/Jared Goff going forward or Kliff Kingsbury/Kyler Murray?", "text": "@radiojody Lol!! Stupid question! Goff is Garbage!!"}
{"label": "NOT_SARCASM", "context": "@Abramjee @JoburgMPD @AsktheChiefJMPD Why would you kill someone for a Kia Picanto 😭😭", "text": "@IsaacKgafela @Abramjee @JoburgMPD @AsktheChiefJMPD It's a Rio sedan but still to kill a lady traveling on her own… https://t.co/d3eGvTP3vj"}
{"label": "NOT_SARCASM", "context": "Women belong to the Kitchen...You Can join them there https://t.co/vuvks8oWLC", "text": "@ItsKubasu Dream on!!! You will  still find us in places that are not kitchens . like in interview panels looking t… https://t.co/D2Gz4xpJyQ"}
{"label": "NOT_SARCASM", "context": "following terrible accounts has finally paid off 🙌🏻👏🏻🙏🏻 https://t.co/SYkyLWdkDe", "text": "@girthygal Where did you find this"}
{"label": "NOT_SARCASM", "context": "The strength of a woman https://t.co/5wGktt6gGk", "text": "@Sydney_Talker @Gifted___beauty come laugh smalk😂😃😄😅😆"}
{"label": "NOT_SARCASM", "context": "Quote tweet this with your most controversial opinion about Arsenal", "text": "Arsene Wenger would have made top4 last season and this season with this squad. https://t.co/YLhOqMMkyK"}
{"label": "NOT_SARCASM", "context": "Wah what a day... My phone is broken.. touchscreen totally gone... My car's horns are not working suddenly.... My t… https://t.co/a3t2V7vL2Y", "text": "@RSfangirl Oh poor girl..Not everyday has to be the best right..it's ok things will get better.. sending u all the… https://t.co/zlQr2TNJOc"}
{"label": "NOT_SARCASM", "context": "@owl_navy this gon be us one day https://t.co/VqHlM8Nq80", "text": "@AverageManta ITIS GONNA BE US ONE DAY (oh looks like we have he plague too)"}
{"label": "NOT_SARCASM", "context": "@udieerudite @paul_bolaji  if I see anything concerning both of you am going to retweet 🤣🤣🤣🤣", "text": "@iam_Folabello @udieerudite Na to come add skushis to ur drip remain"}
{"label": "NOT_SARCASM", "context": "#MostAnnoyingThingAboutTwitter  When you like someone's tweet and then they follow you and like and comment on ever… https://t.co/0v4JrIiyvA", "text": "@BettyB919 I make no apologies for trying to save the city every day. https://t.co/0llph0DyAn"}
{"label": "NOT_SARCASM", "context": "People incarcerated in West Virginia prisons will soon be charged $3 an hour to read books and $15 an hour for vide… https://t.co/lu105F74dI", "text": "What type of Jim Crow shit are they pulling in VA.   How do we raise a reading fund for these inmates? Who needs ba… https://t.co/oYH5svSY7I"}
{"label": "NOT_SARCASM", "context": "mickey waffles https://t.co/XpbAmlSAix", "text": "just me or is mickey looking a little scary? https://t.co/3vxnfj4Ijb"}
{"label": "NOT_SARCASM", "context": "Raab will lose his seat if Labour supporters lend their votes to the LibDems.  https://t.co/51le7g7rvG", "text": "Oi, @UKLabour you want to get the Tories out? Get out one of the worst, stand down your candidate in Esher and Walt… https://t.co/WAzZouOp2V"}
{"label": "NOT_SARCASM", "context": "Q. But what about a corrupt government? If you remove guns, you remove every protection we have from a corrupt gove… https://t.co/8wBsjbHMW5", "text": "@designmom I doubt any type of guns will defeat a corrupt &amp; tyrannical government that controls access to fighter j… https://t.co/nS2LpWRIDy"}
{"label": "NOT_SARCASM", "context": "@metheridge @McCallumTheatre Relaxed = the crowd sat 🤔", "text": "@pabarker10 @metheridge @McCallumTheatre The theater staff does not let you stand."}
{"label": "NOT_SARCASM", "context": "You wey you get money tell me places you go fit chill for tadi. Champs, vienna then where? Town wey Dem no get sing… https://t.co/d7hZtY8F7n", "text": "@Boison__ You don’t say"}
{"label": "NOT_SARCASM", "context": "Wish I had that special person that sent me memes 😔", "text": "@BrotherNature say less https://t.co/58L8sjP9hO"}
{"label": "NOT_SARCASM", "context": "#MyDebonairsExperience", "text": "Ordered online and order was accepted, endlini asiphekanga angithi phela and we waited until it was 8pm and they we… https://t.co/UrlnbCMCdk"}
{"label": "NOT_SARCASM", "context": "Hey DOJ types, I have a question. I know that DOJ can agree to represent an official in their personal capacity, su… https://t.co/UZU0m5U3kR", "text": "@NatlSecCnslrs Huh, good question. I'm sure it's because Barr. Calling @RickPetree or @NastyOldWomyn I know you wer… https://t.co/V56a8beR8o"}
{"label": "NOT_SARCASM", "context": "Never letting a woman sit on my face again 💩🤮🤢😪 https://t.co/LV9KFpeOig", "text": "CHILL OUT😂😂😂I forgot you made this shit https://t.co/gBI2Ine2lc"}
{"label": "NOT_SARCASM", "context": "No dog filter or emoji in this pic Breaking my egirl selfie streak for this smh https://t.co/NF9XaH2DKX", "text": "@Bayleefium ASDFGHJKL https://t.co/XH0gyHaqMU"}
{"label": "NOT_SARCASM", "context": "Video shows Arizona sheriff's deputy tackle a 15-year-old boy with no arms or legs; internal investigation launched. https://t.co/9ceHda1Hie", "text": "What the hell is wrong  with this individual I'm in tears as I read this https://t.co/nk8s5PVbdd"}
{"label": "NOT_SARCASM", "context": "@XboxKaneda No doubt it is a beautiful way to cook turkey but Bon appetit did all the different ways and they were… https://t.co/zl12Ybtba4", "text": "@tltd_adam @XboxKaneda I smoked a turkey a few weeks ago and it was great.  But I know a few people who deep fry it… https://t.co/BA3YAB4wxy"}
{"label": "NOT_SARCASM", "context": "DS is so relaxing 💜🎶 #PS4share #DeathStranding https://t.co/8xZMvNa5Id", "text": "@TRQ47 @HIDEO_KOJIMA_EN you a second floating carrier and you can snowboard those mountains ;)"}
{"label": "NOT_SARCASM", "context": "i wanna watch the stranded AHHH", "text": "@forgmmtv you should i started it yesterday and it’s good !!!"}
{"label": "NOT_SARCASM", "context": "Some people are just daft in this country so they can pay 75k for a whatsapp group Chai 🙆‍♂️🙆‍♂️🙆‍♂️", "text": "@haywhydot85 maybe na all these gangbang group 😌"}
{"label": "NOT_SARCASM", "context": "Just more of the absurd victimhood claim from the overly religious right. “ I am oppressed because I am a Christian… https://t.co/dP28BXAMwN", "text": "@zjsmith104 I’m perfectly fine with anyone getting married, don’t think the govt should be involved with marriage w… https://t.co/1euRVKV3G9"}
{"label": "NOT_SARCASM", "context": "Bro was too scared I stg 🤣🤣🤣 go ahead &amp; call the cops AGAIN @blountskii https://t.co/SX7WCEcGV9", "text": "You a bum on baby 😂😂😂 https://t.co/U5TTyMGMCk"}
{"label": "NOT_SARCASM", "context": "This is what happens when economic development happens behind closed doors.  We don’t get to talk about labor, safe… https://t.co/GNVxKlEkHR", "text": "@Misso4Congress We're past due in NY for a discussion about ending the power of unelected, unaccountable IDCs. The… https://t.co/T8t4DV0V91"}
{"label": "NOT_SARCASM", "context": "Happy Birthday Whoopi! Give my best to your fugitive friend Roman! And thanks for hating on me and KG so much, it g… https://t.co/7AAOZMh2Xp", "text": "@DonaldJTrumpJr The NYT feels “bulk sales” propelled this piece of fiction to #1. Kind of like when your grandparen… https://t.co/tEHUGqIoxz"}
{"label": "NOT_SARCASM", "context": "퇴근하고 싶은 사람 〰️ 박수치기 ~~~ !!! https://t.co/uvZjBNaZbX", "text": "NAAAWWWWW BABIES 🥺🥺🥺🥺🥺🥺🥺🥺🥺🥺🥺🥺 imma get yall outta THERE https://t.co/aL1TREE7K3"}
{"label": "NOT_SARCASM", "context": "Seems like it’s easier for you to be happy without me around. I’m happy for you.", "text": "@chadillactic You literally never texted me back after you left. I’m appalled &amp; slightly offended."}
{"label": "NOT_SARCASM", "context": "Baby im perfect for u", "text": "@sophiamarie_m You’re also just perfect 😘"}
{"label": "NOT_SARCASM", "context": "The oldest functioning orbiter at #Mars—which got there in 2001—is still truckin' along and sending back data! https://t.co/6zRxZsGLn9", "text": "@tanyaofmars Great to hear our 2001 Mars Odyssey getting a mention!  These are my most widely seen Odyssey mission… https://t.co/jqArzEBSoM"}
{"label": "NOT_SARCASM", "context": "My friend just offered to buy me a new computer. I don’t know whether or not to take her up on that. I don’t like t… https://t.co/3G4s1z3A6k", "text": "@BoltTheBee is it for sure the power supply?  Is the current computer you have good enough for today?    I'm sure i… https://t.co/i9KDwg4SNW"}
{"label": "NOT_SARCASM", "context": "Does anyone besides Adam Schiff think Trump’s mean, crude and stupid tweets today constitute “witness intimidation?”", "text": "@EliLake pretty much everyone does."}
{"label": "NOT_SARCASM", "context": "Gonna tell my kids she’s alive and well https://t.co/1ElJB708eO", "text": "@biconkorra @witchy_writes_s Unless the kids have seen the show already, then they might lose hope if they really adored allura :("}
{"label": "NOT_SARCASM", "context": "Yes!!!!! @johnreichardwes @JessieLynnFans @JessieLynnJL @ignitionCountry @mjschneider_777 @Backpackjohn1… https://t.co/J39ZlDQqEi", "text": "@JessieLynnFans @JessieLynnJL @ignitionCountry @mjschneider_777 @Backpackjohn1 @EdHarrisMusic @CathyHill53… https://t.co/8WbOGaqBhu"}
{"label": "NOT_SARCASM", "context": "Daniels (sir @uwumelia ) has a huge add daddy kink 😳 doNT ASK HOW I KNOW", "text": "@YE0LSHEAVEN huge add? Is it one I can skip?"}
{"label": "NOT_SARCASM", "context": "#KoreVeleVele I've dismally failed to secure 3 orders of my book #DrowningInOwnTears today 😭😭😭but it is never too l… https://t.co/aEFHS2KfaB", "text": "@MeshackBevhula Mara Best Selling Author? Hay ndi Lost"}
{"label": "NOT_SARCASM", "context": "Omg I hateeee waking up early 🤯", "text": "@hotgirlmira Man!! I’m Lowkey getting use to it I’ve been finding myself waking up before my alarm"}
{"label": "NOT_SARCASM", "context": "Browsing twitter outside of my home gets my adrenaline pumping its russian roulette for what shows up on the timeline", "text": "@JonahVirtanen jesus christ man"}
{"label": "NOT_SARCASM", "context": "Meet The Ascensor Alien!  Or an explanation as to why I was running round Leeds as an alien a couple of weeks back!… https://t.co/HWzbCT4vpV", "text": "@hannyyyy Explanation..... I just thought you were off ya tits H😯😁😁😁😁😁🙄"}
{"label": "NOT_SARCASM", "context": "Three months in Malaysia 🇲🇾 - really missing the #Palace #cpfc #eagles 🦅🔴🔵", "text": "@Alex_Duncan_2 Just think of those short hops to places people go for one off holidays, school trips which will blo… https://t.co/PUQonG6ikC"}
{"label": "NOT_SARCASM", "context": "折り紙ミクちゃん https://t.co/VOKXkDP9Nh", "text": "@DVolaric https://t.co/PpFHqyEGnQ"}
{"label": "NOT_SARCASM", "context": "someone told me I look like @eringilfoy at emo nite and not gonna lie I cried.  ¯\\_(ツ)_/¯", "text": "@amme_92 @eringilfoy You can @ me it’s ok"}
{"label": "NOT_SARCASM", "context": "What’s y’all favorite song from Tinashe album? I’m going to give it a spin lol", "text": "Besides the album I would say it’s out of Know Better and Cash Race... also Story of Us https://t.co/TtWUPz6iCr"}
{"label": "NOT_SARCASM", "context": "finally started all american! why didn’t anyone tell me @TayeDiggs was in this?! i would’ve started long ago", "text": "@siqqsnaps @TayeDiggs That show is great and is being slept on when it comes to CW shows."}
{"label": "NOT_SARCASM", "context": "@WarThunder Will the ME-262 A-2a ever return? Some of us console players really want that amazing 6.7 in our lineup… https://t.co/vOB8kAkjCs", "text": "@TerenceBellerby @WarThunder Should’ve got it in the event like other console players."}
{"label": "NOT_SARCASM", "context": "I'm gonna take the start of \"Under the Sea\" to let y'all know that The Little Mermaid is one of the best rides at D… https://t.co/J4xPWdi61v", "text": "@SomewhereApart I can go on that one! When we eventually do get to go together, I will go on it with you multiple times!"}
{"label": "NOT_SARCASM", "context": "Name a food that you believe people only pretend to like?", "text": "Pickled Eggs. https://t.co/WP3XsQjbJ1"}
{"label": "NOT_SARCASM", "context": "Dr Gerard Henderson attacks ⁦@Milliganreports⁩ and David Marr ⁦@GuardianAus⁩ over their George Pell case commentary… https://t.co/0JZxPm2TIN", "text": "@QuentinDempster @GuardianAus Honestly, Quentin, don’t copy me in on commentary from this vile bully. I don’t want… https://t.co/wDOJmsPbjr"}
{"label": "NOT_SARCASM", "context": "Anyone from Ermelo here? #GirlTalkZA", "text": "@Miss_Palee Yes"}
{"label": "NOT_SARCASM", "context": "Hi everyone", "text": "@ltalianBasilisk Behave ma’am lmao"}
{"label": "NOT_SARCASM", "context": "@joevazquez31 Who is even left", "text": "@Erika_Obre @joevazquez31 Me"}
{"label": "NOT_SARCASM", "context": "Hi folks!Apply to our 4 day #publichealthnutrition policycourse. Day1'll introduce #MOM, determinants, consequences… https://t.co/1ddbfkrR90", "text": "@shwetaPHN @PMenonIFPRI @thePHFI @DorairajPrabha1 @EmoryRollins @mahajan_anubha @chronicpainind"}
{"label": "NOT_SARCASM", "context": "👑 191116 음악중심 미니팬미팅 #연태  쇼듕한 우리 누기  #인투잇 #YEONTAE #IN2IT https://t.co/cS8X6vu5f7", "text": "Jek enlisted the one of the eldest to help warm up his bestie.   Aw...  Also, it LOOKS freezing cold, gah. https://t.co/CU2H6cXJpU"}
{"label": "NOT_SARCASM", "context": "she almost passed him and she isn't even trying https://t.co/kiXKElB1r8", "text": "U ppl still think that insta likes r more important than sales and tours . Tell me when she suprasses him in sales… https://t.co/66JkNAc55d"}
{"label": "NOT_SARCASM", "context": "So...who already been dealing with relationship drama / the theme of love this week? This New Moon in Sagittarius (… https://t.co/81nkXu2Aw4", "text": "Yo... I been SO lovey dovey this week. Like with my friends, relationships, animals, just everybody lol https://t.co/UCgqKoiID4"}
{"label": "NOT_SARCASM", "context": "at 7pm every day from sunday till thursday, my phone pops up a message asking to run a shortcut that sets 5 wakeup… https://t.co/xVDtGToncw", "text": "@beargolightly dear god man"}
{"label": "NOT_SARCASM", "context": "I’m going to say something unpopular about Melania. I think she’s beautiful. I don’t care if she’s a former escort… https://t.co/UZQYQk47fk", "text": "@TrueFactsStated LOL. No.  Compassion and empathy should be at the top of the list for any parent so their kid can… https://t.co/VUOsrbMAe6"}
{"label": "NOT_SARCASM", "context": "I'M STILL LAUGHING SO HARD ON THIS SCENE LMAOOO 😂😂😂 https://t.co/Ll4hVBxav0", "text": "nah i’m really bout to start gintama https://t.co/EA1acgRS78"}
{"label": "NOT_SARCASM", "context": "@jdforward It's pretty much the same as Christianity, but with more holidays.", "text": "@Todo266 @jdforward We're not fond of Idols, icons, crosses or confused late second temple carpenters"}
{"label": "NOT_SARCASM", "context": "and for those of you who are wondering, i was not high and this is a real event that happened most likely due to th… https://t.co/gw2lGBrQ5l", "text": "@crankybloom i hope ur cowboy frog angel lives his best life in dreamland"}
{"label": "NOT_SARCASM", "context": "@finance_rich @pereslael I told yall that shit was trash long ago lol", "text": "@SirEdwardNigma @finance_rich @pereslael All liquor not good. Except for Anejo, I still drink henny from time to time though lol"}
{"label": "NOT_SARCASM", "context": "Curry sauce is so overrated", "text": "@russkrispies What a horrible thing to say"}
{"label": "NOT_SARCASM", "context": "im so embarrassed sweet baby jesus https://t.co/jrVbdmRsVb", "text": "@blanchedubu Now she’s gonna ask if you’re a kpoppie."}
{"label": "NOT_SARCASM", "context": "And our newest member @chaylene_guinto !", "text": "@TheVizardOfAhs @chaylene_guinto Great way to cap off an amazing week! Chaylene you may be on the opposite coast but your now a BTUG member!"}
{"label": "NOT_SARCASM", "context": "Delighted to be at the #RepublicSummit. Watch my speech. https://t.co/PNj3pb5ovt", "text": "@narendramodi Mr Moodi. No need for the fake celebrations."}
{"label": "NOT_SARCASM", "context": "One thing I appreciate about Nany is &amp; always will, she is fantastic television😜 #thechallenge34.  https://t.co/k3vYH2PyE8", "text": "@PaulParmar1 There is one word(s) i still can't figure out what she is saying in this clip lol"}
{"label": "NOT_SARCASM", "context": "Big Liggs. That boy something special @GregLiggs21 https://t.co/2JZ4HhWhmX", "text": "Had big shoes to fill 3💪🏾🙏🏾 https://t.co/9Si3EQKUkx"}
{"label": "NOT_SARCASM", "context": "VFX Artist React 15 is LIVE and if you haven't watched it.. WHAT ARE YOU DOING?! Watch here -… https://t.co/SYWipo7jOq", "text": "@CorridorDigital I composited this shot from the Quicksilver sequence and Niko is correct. The cheek ripple is from… https://t.co/lXuknvX7CO"}
{"label": "NOT_SARCASM", "context": "Canada’s largest potash mine announced it will temporarily shut down and lay off 550 employees as a result of the C… https://t.co/aIH1DunCFp", "text": "Hey @JustinTrudeau nothing to see here, just an economy getting decimated by union thugs.    But don’t worry about… https://t.co/fOAz7WlUav"}
{"label": "NOT_SARCASM", "context": "Almost half of people don't change underwear daily: study https://t.co/52df53xn0T https://t.co/aRwoNXpdWM", "text": "Half of these people are disgusting AF https://t.co/unc4K4fnaL"}
{"label": "NOT_SARCASM", "context": "Certainly not gonna blow that https://t.co/kK9n0TjijY", "text": "@safistication 🤣🤣🤣"}
{"label": "NOT_SARCASM", "context": "LEBRON JAMES JUST KILLED SOMEONE https://t.co/LBpOOoxt9H", "text": "@LakersEmpire @SOULbeautifulme Baptized that man in the Lake 😂😂😂"}
{"label": "NOT_SARCASM", "context": "If BBI passes, that means Uhuru will rule us for another 7years as the executive prime minister. Holy crap! Raila O… https://t.co/rWR9vuZF8y", "text": "@allen_arnold Politically, We are Always between a Rock &amp; a Hard Place. On any ballot paper, the choice is Always b… https://t.co/lZfF7hy5gp"}
{"label": "NOT_SARCASM", "context": "\"This is why institutional inequality persists. Not because of white hoods and racial slurs. It is because this ins… https://t.co/dVsZM8F3cj", "text": "\"Get-along moderates would rather make shit up out of whole cloth than wade into the waters of reality. Pete Buttig… https://t.co/BLotiliftT"}
{"label": "NOT_SARCASM", "context": "Let the games begin https://t.co/OWTopjsuya", "text": "@LabanonTheTurnt This says 8:31pm. Probably sent a couple others between 8:27 and 8:31"}
{"label": "NOT_SARCASM", "context": "@agitarahmi BUJUK @chamhomile", "text": "@zaliaasafaa @agitarahmi Well i probably would love to but hm you know like if we want to get the tickets you know 🤔"}
{"label": "NOT_SARCASM", "context": "Wait me toooo https://t.co/exn2ij4MQ2", "text": "@_Waltt_ wait, you decided???"}
{"label": "NOT_SARCASM", "context": "@amazonIN Dude.... could you please explain why can't i call you as cheater?????", "text": "@RRuummyyy That's quite a remark! Could you let us know what went wrong? We're here to help. ^MM"}
{"label": "NOT_SARCASM", "context": "Look at my friend but not too much, I’ll fight you! https://t.co/sJvSKtcYdQ", "text": "@beccajlh Fite me"}
{"label": "NOT_SARCASM", "context": "Brexit party MEP: why listen to you, what do you know about economics   @MollyMEP: actually I am an economics profe… https://t.co/NoaVypiPUJ", "text": "@StevePeers @MollyMEP Even people with degrees and in government don’t know what’s going to happen so how does anyone really 🤷🏽‍♂️"}
{"label": "NOT_SARCASM", "context": "@TeamTrump @realDonaldTrump @thebbtcenter Yeah... that was cancelled.  Trump refused to pay up front for his use of… https://t.co/ay2ebq9NtR", "text": "@Patty22830948 @TeamTrump @realDonaldTrump @thebbtcenter Which cities did he stiff? How do you know this?"}
{"label": "NOT_SARCASM", "context": "DRAGON BALL SUPER: WHy GOHAN and the Z-FIGHTERS Need a SPINOFF SERIES Without Goku and Vegeta!… https://t.co/sQBCub6GNG", "text": "@ComicBookNOW No"}
{"label": "NOT_SARCASM", "context": "Kosmo gently picking up sheith baby by her shirt with his teeth and making a baby delivery to Keith or Shiro", "text": "@viribirb I need to draw this omg that's the cutest thing"}
{"label": "NOT_SARCASM", "context": "Yes, UT's demand was sheer blackmail, but in hindsight, maybe 2.5 yrs for DF as CM, then the next 2.5 as Deputy CM… https://t.co/inggkSD4KS", "text": "Many many credits to @narendramodi and @AmitShah for not falling into that trap. We have seen this movie with Mayaw… https://t.co/zwk8U1poQu"}
{"label": "NOT_SARCASM", "context": "@MasterChuck81 @supercorpnethe1 this is not monitor's fault, this Lena's choices. nobody didn't make her to kill hi… https://t.co/kBHmblKBZr", "text": "@Harley_Quinn_30 @MasterChuck81 @supercorpnethe1 Pff.. “Lena has darkness” yeah right that’s totally why the medall… https://t.co/xKu59FpF0p"}
{"label": "NOT_SARCASM", "context": "what did i miss while i was drawing", "text": "@princjy https://t.co/psrZvvZ7kh"}
{"label": "NOT_SARCASM", "context": "Saw someone who is in a Dom and Sub relationship posting about making cookies for her Dom?! And now I’m like damn I… https://t.co/tGgwxxh1kj", "text": "@Shaydozer Oh hun, I'mma feared you have 'make cookies energy' not recieve cookies energy. Now be a good boy and cl… https://t.co/8sl5yjBsuV"}
{"label": "NOT_SARCASM", "context": "@LiliBodo @Carla56725378 @VINAY99996 @Lily_Tmlily @jet_new @Fer_M66 @S_Ph_A_ @V2_N_St0 @Ame_2I @Sa_ra2ii… https://t.co/JSY71zykod", "text": "@sasha_stana @LiliBodo @Carla56725378 @VINAY99996 @jet_new @Fer_M66 @S_Ph_A_ @V2_N_St0 @Ame_2I @Sa_ra2ii… https://t.co/fMKfXy3rTi"}
{"label": "NOT_SARCASM", "context": "My boss asked my what kind of goodbye cake I wanted and I said a kitten firing a weapon riding a unicorn. I’d say h… https://t.co/2jX15Hlold", "text": "@CecileJuliette What an awesome cake!! You’re going to be missed, but I wish you the best of everything in your new career!"}
{"label": "NOT_SARCASM", "context": "You can’t show up at Black folks’ house and hardly anybody knows or vouches for you, and claim you’ve been down.  W… https://t.co/kuCgPLeJyn", "text": "@MsPackyetti This guy will never understand. https://t.co/n4C6cJMxtY"}
{"label": "NOT_SARCASM", "context": "HE LOOKS MISERABLE!  No dog deserves to be packed up, carted from state to state, and paraded in front of a stadium… https://t.co/juPiTAbICJ", "text": "first Bevo came for Uga, now PETA. I’m ready to fight https://t.co/FU8kUvCb2u"}
{"label": "NOT_SARCASM", "context": "@curryspcworld if I take out the 3 year guarantee does that cover accidental damage?", "text": "@adambirkettt Hi Adam,   There are some conditions, but yes. It does include protection in case of mishap.  Many thanks, Matt"}
{"label": "NOT_SARCASM", "context": "This lady is jogging with vetkoeks in her hand 🤭", "text": "Where are you seeing me? https://t.co/zQuJ0mZ2qj"}
{"label": "NOT_SARCASM", "context": "@piersmorgan So, breaches of the law should be just ignored?", "text": "@EricInAdelaide @piersmorgan 1) There’s a specific law signed during Clinton administration that codified law enfor… https://t.co/b97IZaeEjb"}
{"label": "NOT_SARCASM", "context": "apple daily live reporter notes that 'even some foreigners are holding up their hand' and some even shout slogans i… https://t.co/WsXY3Iiz4f", "text": "@stegersaurus As long as they are striving for the same goal, cherishing the freedom of #HongKong, then they are al… https://t.co/yIczjKwAWy"}
{"label": "NOT_SARCASM", "context": "As the festive speshal approaches, Shaun Ryder wants to know... what was your favourite \"NEXUS OF '19\"?? https://t.co/2qDqt68GNE", "text": "@unsungpod Was the Grohl cancellation this year?"}
{"label": "NOT_SARCASM", "context": "If inner beauty was a person✌ https://t.co/hmK0waKXH4", "text": "@eyevanO I don’t know how u saw the inner beauty but let’s talk about the outer beauty u mean u didn’t see it 👀👀👀"}
{"label": "NOT_SARCASM", "context": "I count one woman sitting at that table, and zero ethnic minorities.  Amazing how the EU somehow thinks that /no/ p… https://t.co/vm7VtulurM", "text": "@tomhfh Europeans are white though"}
{"label": "NOT_SARCASM", "context": "We know when y’all are faking 😂😂 https://t.co/uBV9LjXN3W", "text": "Cruel people go into the medical field because it's a stable position of authority that allows them to assert power… https://t.co/lzZOMgU5LP"}
{"label": "NOT_SARCASM", "context": "New Wildcats. Same Wildcats spirit! 🐾❤️ Start streaming High School Musical: The Musical: The Series now, only on #DisneyPlus.", "text": "i don’t approve. https://t.co/gxuY6cz67g"}
{"label": "NOT_SARCASM", "context": "Not that I'm counting, but the Sens have 11 losses and the Leafs have 12.", "text": "@BonksMullet 5 points back with 3 games in hand 🤣"}
{"label": "NOT_SARCASM", "context": "#OnceAlways #UpDaBucs ☠☠❤ https://t.co/wBi4E5I2Vx", "text": "Hebanna! https://t.co/l3Ooj99G1n"}
{"label": "NOT_SARCASM", "context": "Conclusion: Jetpacks have been around for quite many decades BEFORE the events taking place in The Rise of Skywalke… https://t.co/oe9gJxISgE", "text": "That’s the Fandom Menace douchebags in a nutshell. Ignore context, ignore that we haven’t seen jetpack troopers in… https://t.co/iJJcgTNst5"}
{"label": "NOT_SARCASM", "context": "Real Nerds Cry.  What comic based content (movie, book, video game etc) make you shed tears?  I, personally, am a s… https://t.co/KYi4eg6rvT", "text": "@CJPendragon I will never forget reading this. I was on a plane and didn't know Kurt was going to die and was a sob… https://t.co/a0i5YtpAxf"}
{"label": "NOT_SARCASM", "context": "woke up at 4am, stressed so i booked a one way ticket to dubai by myself.   packed a suitcase &amp; left by 1pm. i’ll b… https://t.co/VdDNu7t8Za", "text": "I usually just treat myself with an extra boiled egg.. same difference https://t.co/ByHHz3xkyQ"}
{"label": "NOT_SARCASM", "context": "OUTTA THIS FOO FOO ASS JOB https://t.co/EV8wLuVEjR", "text": "@KuyaDaryll Get yo braces off"}
{"label": "NOT_SARCASM", "context": "Goooood morning!  Great show and great job with the #CFB crib notes by @DanRivera228 @troy5515 @edortiz1026.  Here… https://t.co/vZNeUftlxw", "text": "@EricGlazer @DanRivera228 @troy5515 @edortiz1026 @RJinVegas @kenthomson87 @Dave_Essler Announced yesterday: Arizona… https://t.co/r7GeMXX458"}
{"label": "NOT_SARCASM", "context": "@umucado I saw these Xmas socks today ...  Could be reindeer, I suppose, but they certainly look like avacados in C… https://t.co/eBbLskmOCr", "text": "@CoffeeJezus Looks like I gotta make my way over to my local H&amp;M asap....😱❤️"}
{"label": "NOT_SARCASM", "context": "@KassandraSeven @JackRottie I'm saying many POCs would agree that after centuries of the effects of racism and defi… https://t.co/WCeQHuZq7D", "text": "@BBWave2020 @KassandraSeven @JackRottie Bro you're wrong.   Having grown up around blacks all my life, nothing I sa… https://t.co/LJkXpHrOr4"}
{"label": "NOT_SARCASM", "context": "Small but meaningful feature from Uber. Your driver can now thank you when you give a tip. Makes me want to tip aga… https://t.co/3m1dp19k08", "text": "@TheRideshareGuy Idk...you shouldn’t have to thank someone for paying you to do your job. I think this isn’t great… https://t.co/9UDYfdaF53"}
{"label": "NOT_SARCASM", "context": "mmmmmmm yes i love drunk men trying to flirt and flag me down while im trying to cross the fucking street", "text": "@koyaus Ew"}
{"label": "NOT_SARCASM", "context": "A Shawol asked me to try this on One Minute back and I’m honestly mindblown at how the background vocals sound... t… https://t.co/9Aw1TtfhYT", "text": "@RealUnkle1932 have u tried \"I say\"? if you alrrady did please give me the link 😘😘😘"}
{"label": "NOT_SARCASM", "context": "CRYINGGGGGGGG https://t.co/VGAIre25P0", "text": "2 accounts ago smfh https://t.co/2rTck1WszX"}
{"label": "NOT_SARCASM", "context": "@g_gezana Nakamura × Zayn 🔥🔥🔥🔥", "text": "@BossyGoddess @g_gezana 🤣🤣 I smell Nakamura turning against him at one point"}
{"label": "NOT_SARCASM", "context": "Yo, who’s in? @Ninja @timthetatman @CouRageJD https://t.co/CVhP0zVceO", "text": "@DrLupo @Ninja @timthetatman @CouRageJD Looks like my friends but it's hard to tell! Urias Family Globe of Death? 🤔🙂 https://t.co/3i26iop8qf"}
{"label": "NOT_SARCASM", "context": "Man I need to worry more about music and less about politics #skpoli @cityandcolour", "text": "@codysast @cityandcolour Please do"}
{"label": "NOT_SARCASM", "context": "Breaking news: Law minister Farogh Naseem resigns. Just as Shafqat Mehmood, Sheikh Rasheed and Shahzad Akbar we’re… https://t.co/pUb7LZ5jVF", "text": "To represent the COAS as a lawyer: Sheikh Rashid https://t.co/5oae6wYCam"}
{"label": "NOT_SARCASM", "context": "Hate when people say there’s no such thing as an ugly baby cause uhhhh yeah bitch there is a thing as an ugly baby.… https://t.co/dQprvjW7Mv", "text": "@onahleaa Facts my oldestlooked like the men in black alien baby for a min"}
{"label": "NOT_SARCASM", "context": "Ont. Premier Doug Ford has a message to the Unemployed in Alberta - MOVE TO ONTARIO - Ford says Ont. is DESPERATE f… https://t.co/q9cZgZZtR7", "text": "@gtlem I'd like to know more about all these jobs, I'm in a small town in Ontario and can't find a job, or at least one that pays the rent."}
{"label": "NOT_SARCASM", "context": "getting drunk and not fucking after&lt;&lt;&lt;", "text": "Going rape somebody. https://t.co/JxDa4UUSgj"}
{"label": "NOT_SARCASM", "context": "Blizzards expect in the Atlantic north east with temperatures around -4 to -8'c  Pert place to take a quarter of a… https://t.co/FYhuKhejWM", "text": "@thealso Think of the adventure 😉"}
{"label": "NOT_SARCASM", "context": "taeyong said he will turn on vlive again when he goes to new york", "text": "ur kidding https://t.co/sR0bro2Bda"}
{"label": "NOT_SARCASM", "context": "Good morning &amp; Happy Tuesday, friends! 🥰🙏🇺🇸 https://t.co/ipCtGxgWhl", "text": "@R5Eileen Good morning Eileen and all.  Hope you all have a great day and are not stressing over Thanksgiving prep."}
{"label": "NOT_SARCASM", "context": "Today while I was walking out the bank this man grabbed my arm and said “Hi” and I went excuse me and walked away.… https://t.co/HsqxEAlSLi", "text": "@LexBarajas23 oh hell no be careful ! keep a taser or pepper spray on you!"}
{"label": "NOT_SARCASM", "context": "Maytag is the #SexiestApplianceAlive. Is it hot in here? Or is Maytag just pre-heating? 🌡️ #SexiestManAlive https://t.co/e85VLZyGa3", "text": "@TheMaytagMan What happened for the downgrade into an appliance comercial from Star in a hit Sci-fi series Eureka..… https://t.co/bEjOREQmDr"}
{"label": "NOT_SARCASM", "context": "Top 5 Bruce Springsteen songs. 1.  2.  3. 4. 5.  None. Bruce Springsteen sucks. https://t.co/TZ54ajqnUl", "text": "@exjon Welcome back to the USSR  …  that was him right?  .cc @karol"}
{"label": "NOT_SARCASM", "context": "Our democracy is in a mess. Power is too far away from people.  Parliament is unrepresentative. The voting system i… https://t.co/EF5TXa9VbG", "text": "Peter Tatchell talking about democracy! That's a joke. He wants to erode heterosexuality as the norm, sexualise our… https://t.co/1BL8IwxZMV"}
{"label": "NOT_SARCASM", "context": "Last Friday, @SilverRupee_ took the first qualifier spot on Team Toronto for the Street Fighter League Amateur US 2… https://t.co/AwewcpeK4w", "text": "These graphics are so damn clean....I'm feeling these for real!! haha https://t.co/7Bs8Hjjsv3"}
{"label": "NOT_SARCASM", "context": "This is what happens when those most impacted don't have a seat at the table. The people that are closest to the pr… https://t.co/hcpXF58f7n", "text": "@Randerson041 I Love the Campain! I don’t care if your talking good about it, or bad about it... at least the Much… https://t.co/SNbuceglTm"}
{"label": "NOT_SARCASM", "context": "@Heavensnewbaby @sherrig108 @saferprint @1SunnySideSue @COccupants @Cathereni @redsand2 @BiggiPommerin @Wrix2… https://t.co/J1I9j8VBCi", "text": "@ComesAnnemarie @Heavensnewbaby @sherrig108 @saferprint @1SunnySideSue @Cathereni @redsand2 @BiggiPommerin @Wrix2… https://t.co/kf2FGmewh8"}
{"label": "NOT_SARCASM", "context": "She like the way I be vibin, big boy diamond https://t.co/mTMjfESHPx", "text": "Devin look tall as shit https://t.co/wN9EQPJcI6"}
{"label": "NOT_SARCASM", "context": "Cause he dunked Belijca!?!? -TPJ https://t.co/C1OiJ7BeIM", "text": "@HoopsNBrews Common TPJ year 17 man"}
{"label": "NOT_SARCASM", "context": "Sunbathe your asshole, for wellness https://t.co/50pmdiohZ1 https://t.co/OfLGulPqL2", "text": "White people, I need an explainer https://t.co/aKiVoNF6he"}
{"label": "NOT_SARCASM", "context": "In case you didn't know, #CapricornFMTurns12 TODAY and we are setting Limpopo on Fire. Tune in to #TheUltimate326 w… https://t.co/rYNrssS9cu", "text": "@CapricornFM @tlou_tlolane @DjComplexion Can I please have the interview on Children and social media, in an audio clip format if possible"}
{"label": "NOT_SARCASM", "context": "@jeffuhz Kocoum was her husband in real life. Disney turned him into a jealous jilted lover. And made a liar (John… https://t.co/H2xEdCahLP", "text": "@IAmLeoGlaze @jeffuhz Her real husband was John rolfe"}
{"label": "NOT_SARCASM", "context": "My CAC picture always turns out horrible 😂", "text": "@TueChainz CAC CARD*"}
{"label": "NOT_SARCASM", "context": "Jesus, is that you? https://t.co/1NcbJDfghi", "text": "@PART_RIOT Where are all those bottles of wine coming from? Best person to be in a party with"}
{"label": "NOT_SARCASM", "context": "Following @jkenney's controversial appearance in a \"I ❤️ Oil &amp; Gas\" hoodie at #greycup2019, we want to know what th… https://t.co/mzVjBNXr5Y", "text": "@Adrienne_Pan @jkenney @CBCRadioActive I’m thinking this here might be just a little more controversial. Don’t you? https://t.co/DyD9S0vWIw"}
{"label": "NOT_SARCASM", "context": "Found this on my way back home and I just want to say , this food is the OG..saved us those years in Awka https://t.co/4IVAGqOw5v", "text": "You know this!! https://t.co/qk2Mmh6Ut1"}
{"label": "NOT_SARCASM", "context": "Hundreds and hundreds of you have explained to me that a life insurance policy won't protect against an armed intru… https://t.co/4132AR8tnC", "text": "She’s doubling down today and the comments just keep rolling in. 😂 https://t.co/YAib2xQTno"}
{"label": "NOT_SARCASM", "context": "stolen from everyone on my tl  moots reply to this and i'll like it if u intimidate me https://t.co/wyRSU2xvcr", "text": "@Golden_Dasiavuu ✌🏼"}
{"label": "NOT_SARCASM", "context": "@armchairshrink @Brett_Shavers @ABananaRambling Fair enough, though I guess that goes both ways.  I'm not sure why… https://t.co/KkIZ53vvSb", "text": "@Dahlspils @armchairshrink @Brett_Shavers @ABananaRambling It’s only a debate because you seem to want special cook… https://t.co/m0IZZuqElW"}
{"label": "NOT_SARCASM", "context": "New Beginnings Gen 4 gets rolling with lots of surprises in Chapter 4.02.  When Ryan decides to surprise his wife a… https://t.co/53IXB1fqeU", "text": "Yay! This gen is already drama-filled! Haven't read it? Start now! &lt;3 https://t.co/mjatrvV4to"}
{"label": "NOT_SARCASM", "context": "\"Remember to eat your greens!\"", "text": "@Magikuwu \"I know that.\""}
{"label": "NOT_SARCASM", "context": "I actually thought I’d only tweet Data Science; Engineering; ML and AI stuff here.  My bio even says ‘data guy’.  A… https://t.co/08uEh3O4D4", "text": "@Le_Dumiebi I thought this was a horticulture stan account 🙆‍♂️"}
{"label": "NOT_SARCASM", "context": "this #bears O line is something. Blame Mitch all you want. They are brutal.", "text": "@dwass34 That was a blitz.  They couldn't have covered it.  He needs to check down and make a change, quick throw, or throw it away."}
{"label": "NOT_SARCASM", "context": "@_shorshor @zubaidah_x When should we go?", "text": "@kwakzzzz @_shorshor @zubaidah_x 😉"}
{"label": "NOT_SARCASM", "context": "191116 미팬   🧚🏻‍♂️🧚🏻‍♂️  #진영 #갓세븐  #JINYOUNG #GOT7  #GOT7_CallMyName  #GOT7_니가부르는나의이름  #GOT7_YouCallingMyName https://t.co/kr3aVAtqI1", "text": "he ☺️ https://t.co/X1uTU5UtPf"}
{"label": "NOT_SARCASM", "context": "You can play fetch with the dog in Pokemon Sword and Shield https://t.co/T48Nqn4YFn", "text": "@CanYouPetTheDog I feel sorry for that dog, please put it down."}
{"label": "NOT_SARCASM", "context": "Why are kids getting missing?", "text": "@amigoumar Guysmen need gurush"}
{"label": "NOT_SARCASM", "context": "Vanoss crew ain't normal:  Vanoss - owlllllll boi  Delirious - son of jason and teddy bear lover  Terrorizer - robo… https://t.co/vH0ebAaNGJ", "text": "@OhforFUCKSSAKE6 Yer right"}
{"label": "NOT_SARCASM", "context": "I have a friend from grad school who “couldn’t get into Hillary” because she wasn’t “progressive” enough and now sh… https://t.co/ZtFDB7wIDe", "text": "@annabeleo I wasn't too hot on Hillary for the same reason (still voted for her in the general), I am extremely not hot on Mayor Pete."}
{"label": "NOT_SARCASM", "context": "If it doesn’t excite you, inspire you, challenge you, ask yourself why you're still investing your time and energy… https://t.co/DzWXSK9CW4", "text": "I really need to apply this. https://t.co/lYa9D6HF9W"}
{"label": "NOT_SARCASM", "context": "2k ended quick last night 🤣", "text": "😂😂oml when you blew T I knew it was over with https://t.co/2Yc7CLk7zZ"}
{"label": "NOT_SARCASM", "context": "im voting for whichever candidate denounces roxane gay's engagement rings first", "text": "@_malyoung where can i see"}
{"label": "NOT_SARCASM", "context": "Twitter lesson. If B retweets A's tweet, A does not see any replies to B's retweet. So, if those replying to B want… https://t.co/bmeA0rTEbt", "text": "@DianeMariePosts Ok scratching my head."}
{"label": "NOT_SARCASM", "context": "Washington Democrats in the House and the Senate cannot simply stop legislating because of one hearing in the House… https://t.co/X0PzMKTJbm", "text": "@senatemajldr Gaslighting, Mitch. Gaslighting. You gaslight so much and so often I’m shocked that you haven’t self-… https://t.co/4JuBVqve8X"}
{"label": "NOT_SARCASM", "context": "The koala who was rescued from the bush fires last week has been put to sleep. That's the final straw. I'm going to… https://t.co/liXz1uLQNy", "text": "@Ita99 Oh no, that’s heartbreaking. This drive to dominate and destroy the environment makes me hate mankind (oh th… https://t.co/eslSZkXGXS"}
{"label": "NOT_SARCASM", "context": ".@Camila_Cabello shows her support for her friend @TaylorSwift13 on her Instagram story:  “I can’t even wrap my hea… https://t.co/KTBxqLfmSL", "text": "It’s funny considering she was in cahoots with Epic to screw over the other girls.... https://t.co/NQeOeKu5ai"}
{"label": "NOT_SARCASM", "context": "I have a slightly different take. I think about outrage fatigue. If we get outraged about everything, we’re content… https://t.co/U12D9SzTas", "text": "@toddkashdan Ppl working beyond a healthy number of hours due to pressure on an under-resourced education system (a… https://t.co/ntCU26fwca"}
{"label": "NOT_SARCASM", "context": "Happy 2019. There are a lot of things going on in this country. Here's what matters most. https://t.co/S8g2i3UWw9", "text": "@TuckerCarlson Having just abused a career diplomat - suggesting she was “soft” for taking offense at being publicl… https://t.co/tlESoYAybI"}
{"label": "NOT_SARCASM", "context": "film twitter what’s your favorite gay scene of the decade", "text": "https://t.co/VtAu0jLPY6 https://t.co/4thtyqxCWC"}
{"label": "NOT_SARCASM", "context": "I can't believe buying 20 albums score 0 Hyungwon &amp; Kihyun lyric Photobook.  And  Someone who bought 30 albums had… https://t.co/kc8fdekfU1", "text": "@CtSmacey Girl just buy the pc, unless you’re helping with charting, don’t waste your money, afterall it’s the pc o… https://t.co/81bTmw1XBf"}
{"label": "NOT_SARCASM", "context": "Yaar ze mother is heights. I just don't understand how her mind works. She made traditional maharashtrian Palak chi… https://t.co/sWTXFiDlNz", "text": "@tejujoshi31 Paneer 🥰😍🥰😍🥰😍🥰🥰😍"}
{"label": "NOT_SARCASM", "context": "I have a pretty unflattering ID photo, like most people, so after she looks at my ID for a moment, I go “Yeah, me,… https://t.co/N2zdjhPu84", "text": "@spletcha No! What a jerk 😡😤"}
{"label": "NOT_SARCASM", "context": "WHAT KIND OF BULLSHIT IS THIS??  \"The Brewers Clubhouse Sale will be on December 4th for Full Season &amp; 40 game plan… https://t.co/I7wVqTsYAE", "text": "@diluvsthebrew only those peeps can go?"}
{"label": "NOT_SARCASM", "context": "First up, the Golden Joystick award for Best Storytelling goes to #DaysGone for its story of freakers, bikers, and… https://t.co/o0Khl5wJdS", "text": "YESSSS! 🔥🤘 https://t.co/I6Me4Pxa3x"}
{"label": "NOT_SARCASM", "context": "Congressional recess is not just about Thanksgiving. It’s also about getting a Real ID, a haircut, a dentist appoin… https://t.co/yESBCXER0l", "text": "@RyanLEllis OMG - i have to get a Real ID in the next 3 weeks too UGH!!!"}
{"label": "NOT_SARCASM", "context": "Dawg we really went from Mike Brown to Mike D'Antoni to Byron Scott to Luke Walton and forgot how it was to have a… https://t.co/XzRWBFLwPR", "text": "We get hype over ANY smart adjustment by Vogel https://t.co/0BBF4h1LCk"}
{"label": "NOT_SARCASM", "context": "Need to do more Speedia art so imma do 7 days of Speedia art. One: Holding Hands. https://t.co/T4QXkE7Ely", "text": "@Liam70074 I ship it."}
{"label": "NOT_SARCASM", "context": "https://t.co/S12EC50MSB", "text": "my first ever anime boy. i was 5 and i had a crush on him https://t.co/w06nEnn7zf"}
{"label": "NOT_SARCASM", "context": "#KoreVeleVele I have 29 followers😫😥 https://t.co/Gq4wreUmZk", "text": "@Rosinah_Malemaa You have my follow as soon as I can."}
{"label": "NOT_SARCASM", "context": "Just because I don’t want to hook up with open relationship individuals doesn’t mean I’m against their relationship… https://t.co/xOsRUxayx6", "text": "@BPmeatpack Right there with you. I’m wired to want My Person and only My Person, whoever My Person is at any given… https://t.co/howKCFtbE9"}
{"label": "NOT_SARCASM", "context": "@plugboi101 route 6 at 9:00. be there. i’ll take you on.", "text": "@TurtSoCal @plugboi101 So... are you going to take on all the wooloo trainers at once or one at a time?"}
{"label": "NOT_SARCASM", "context": "Is MTN doing a kind of promo? This is not what I subscribed. https://t.co/oSZts5l0Gq", "text": "@Morris_Monye Morris, please check your akant balance. It's possible let they subscribed on your behalf."}
{"label": "NOT_SARCASM", "context": "I want to see somebody try to play the Ravens in a 4-4 defense.", "text": "@sharpndpensel 5-2 (Edmunds and Milano) - 4"}
{"label": "NOT_SARCASM", "context": "It’s a great mug ☕️ https://t.co/7Sw9JsU6Xt", "text": "@JamesSavageFJ Where does one get ones hands on one ? #mug #want"}
{"label": "NOT_SARCASM", "context": "Whatever this program is called on kameme tv......", "text": "Njanjo ya Mûtûrîre... https://t.co/s3jnOc7iy1"}
{"label": "NOT_SARCASM", "context": "If this doesn’t describe me... :,) https://t.co/Q6kohyn0e8", "text": "@sadiiek3 The Weeknd 👀"}
{"label": "NOT_SARCASM", "context": "@ChefSteps - excited to receive my new Joule immersion circulator until I found out I needed to create an account w… https://t.co/2YQ4A9VHJU", "text": "@kevin__k You do need to create an account to use Joule. This allows the Joule app to know your preferences and sho… https://t.co/vq8ctIUuz7"}
{"label": "NOT_SARCASM", "context": "MAMA without sm, yg , x1 and izone. they want empty audiencei see", "text": "bts and twice going dont worry about them seats sweetie https://t.co/QRWetqODvJ"}
{"label": "NOT_SARCASM", "context": "Neji and Itachi would have been the best uncles...", "text": "@Jashamon Stop that hurts"}
{"label": "NOT_SARCASM", "context": "from now on I'm just tweeting this picture of a duck toy with increasingly desperate wails of torment", "text": "@sannewman Omg, I have one of these. My aunt brought it back from China but it wasn't in a box and she thought it was an antique."}
{"label": "NOT_SARCASM", "context": "@drboycewatkins1 @tariqnasheed If it's not political why go? Will there be free food? Because we were on one accord… https://t.co/uwmu5PqCpU", "text": "@ADOSenthusiast @drboycewatkins1 @tariqnasheed The bottom line is tangibles but when we get them how will we manage… https://t.co/qzjDk3Cc53"}
{"label": "NOT_SARCASM", "context": "never rushing to class again. literally messed up my toes 😔", "text": "@__brendaaaxo smh lol"}
{"label": "NOT_SARCASM", "context": "The main reason I don't want Uncle Joe to be the nominee is because I can see him pardoning this criminal, trump to… https://t.co/Lj4TS27WyQ", "text": "@ToriRob11 He won’t."}
{"label": "NOT_SARCASM", "context": "On an Arunmozhi binge right now ... I miss his voice so much https://t.co/ZHWTkSqXLe", "text": "@jaggenius Next content coming?"}
{"label": "NOT_SARCASM", "context": "Look what we just ordered!! 😍😍  Which one are you grabbing??   Flannel or sherpa 🥰 https://t.co/pcmodflkes", "text": "I just want a flannel sherpa! Is that to much to ask for? https://t.co/KPzaBUL0kd"}
{"label": "NOT_SARCASM", "context": "HOW TO BAKE A PIE LIKE AN ALPHA MALE!!!!  Here's a sneak peek of the madness that ensued.   Full vid:… https://t.co/7Jebe7Drsn", "text": "@ZachNCheeseTV Lmfao I’m gone for a week and all of this happens?"}
{"label": "NOT_SARCASM", "context": "nigga ant said he brought a preroll back to smoke with me from LA like a month ago and my boy still hasn’t smoked it he’s loyal", "text": "@jonnybugginout 2 kings in 1 king missing 🥺"}
{"label": "NOT_SARCASM", "context": "REGISTER TO VOTE!   Registering to vote is one of the most important things you could ever do, and this General Ele… https://t.co/dg5BjeaRhu", "text": "Have you registered to vote yet? Torch TV and I made a video all about the importance of having your say so have a… https://t.co/4vhbcRo7Hd"}
{"label": "NOT_SARCASM", "context": "When yo barber wanna try some new shit and it catch you off guard 😂💀 https://t.co/JUuFIF9BGg", "text": "Niggas ain’t hip...that shit hurt a lil bit😂 https://t.co/3xmEZgVryH"}
{"label": "NOT_SARCASM", "context": "im 28 and just spent $40 at claires just had to get that off my chest", "text": "@carlyincontro hi! i just wanted to let you know that you being so open about your anxiety and therapy have given m… https://t.co/cTHNr6Q5Nl"}
{"label": "NOT_SARCASM", "context": "this whole thing is so funny. anyways, be on the lookout for taeyong’s mixtape 😘", "text": "@tytaped Whats happen dee??"}
{"label": "NOT_SARCASM", "context": "Offering ride quitting adopt me #adoptmetrading #Adoptmetrade #adoptmetraders https://t.co/l7XAEYS2LV", "text": "@ToyAndPetShop1 What color is that convertible??"}
{"label": "NOT_SARCASM", "context": "What’s in Lizzo’s purse? https://t.co/ImJCKRIWZV", "text": "how much sleep i get during award show season.. https://t.co/7i0M4lQXju"}
{"label": "NOT_SARCASM", "context": "#41 for the Rams embodies the entire city of Jax. https://t.co/71ChkSfzLV", "text": "@AnotherJagsPod I wonder what Bible verse he re-sighting? 🤔"}
{"label": "NOT_SARCASM", "context": "So glad everybody is understanding this man mason rudolph is a lil baby back bitch", "text": "@anthonyrxsso bro you cannot be still on this 😂"}
{"label": "NOT_SARCASM", "context": "so are most Walmart bakery pies and they are less than $5!! don’t think you need to go out and buy fancy pies!! don… https://t.co/WIBHMmUQJJ", "text": "oh this is big. HUGE https://t.co/FKA0NkRnA2"}
{"label": "NOT_SARCASM", "context": "Warning: I really, really liked RAW.. 😬.", "text": "@SimonMiller316 I have just watched. That is far too many ups and positive to things to say about WWE. Please delet… https://t.co/OXHdFSm5YE"}
{"label": "NOT_SARCASM", "context": "Hehehe I see ARMY on the tl asking if BTS already won at AAA but no one is watching so no one knows kekekekeke", "text": "@AureliaOT7 I’m watching but don’t expect anything since AAA stands for AN ATTENDING AWARD 🤔"}
{"label": "NOT_SARCASM", "context": "I miss my old boobs", "text": "@selfsabotaged Girl you got chichis for days lmao Remember when you got into a fight with I forgot who and your Chi his popped out lol"}
{"label": "NOT_SARCASM", "context": "I'm smiling cos today is another blessing. Have a great day! https://t.co/u8jZcoZqGb", "text": "@teriwiizi Same goes to you"}
{"label": "NOT_SARCASM", "context": "When I decide to start my YouTube channel, are you guys going to subscribe?", "text": "Co ask https://t.co/wX6Lf0luXH"}
{"label": "NOT_SARCASM", "context": "Australia is using sound to monitor its wildlife and #ecosystem https://t.co/tm2NsLaV9d #acousticecology https://t.co/bFKCnIGlkD", "text": "@cdmblogs I don’t know if you have featured it in the past but Leah Barclay’s River Listening project and her hydro… https://t.co/cTeApZD2fV"}
{"label": "NOT_SARCASM", "context": "#WhiteSox Gold Glove 2B Yolmer Sánchez on outright waivers, sources tell The Athletic. Loomed as non-tender candida… https://t.co/9MyRZYiRND", "text": "@Ken_Rosenthal @mlbtraderumors Good. He can’t hit!"}
{"label": "NOT_SARCASM", "context": "It’s happening....@Prodby_GAGE 😆Nicolas Cage 'in talks' to play Nicolas Cage in meta drama about himself, THR repor… https://t.co/PMvodvntPr", "text": "@wonderbrarian What lol😆"}
{"label": "NOT_SARCASM", "context": "Disappointment for @RossChastain. #Championship4 https://t.co/X94i5lcUvB", "text": "@NASCAR_Trucks @RossChastain The one who should be in victory lane hold the championship trophy"}
{"label": "NOT_SARCASM", "context": "White people, I need an explainer https://t.co/aKiVoNF6he", "text": "@wickdchiq I can not stop laughing.  Thank you for this."}
{"label": "NOT_SARCASM", "context": "I put money I post this nigga I’m not the only one fuckin w him😭😂😂😂❗️", "text": "That’s why you don’t post him 😂 because you really might end up beating his ass https://t.co/l1mMvjbL8T"}
{"label": "NOT_SARCASM", "context": "Nezuko♡ 📸@fanservicerenji #DemonSlayer #demonslayercosplay #nezukokamado #nezuko #nezukocosplay #cosplay #cosplayer… https://t.co/pnumQSowmL", "text": "@IchiTanlove @FanServiceRenji The red eyes make this 10x better"}
{"label": "NOT_SARCASM", "context": "Cyclone hitting the west coast. It’s huge!  @cspanwj https://t.co/k0Z6qWv3MM", "text": "@Tillman_40 @cspanwj 100 percent chance of rain! LOL"}
{"label": "NOT_SARCASM", "context": "The friend who is impatient to return your treat has reciprocation as a critical value. The friend who wants to mos… https://t.co/I8p2xKnO7b", "text": "@nimmypal I invite close Friends home for a hearty meal and heart to heart conversations . My friends do the same &amp;… https://t.co/lZt1gUrLGQ"}
{"label": "NOT_SARCASM", "context": "Top 100 incoming 🎮 ⚽️", "text": "@BrightenedK This ain’t 2010...."}
{"label": "NOT_SARCASM", "context": "Name a video game character better than Cuno.", "text": "@unormal Kim"}
{"label": "NOT_SARCASM", "context": "Hours in a day:24 Sleep : 8 Commute : 3 Work : 8 Lunch : 0.5 Housework : 2 Child time : 2 Personal time : 0.5  Will… https://t.co/IE0pBVrYXF", "text": "@shortsoursweet Or you can do the @jockowillink thing and wake up 04:30 AM ;)"}
{"label": "NOT_SARCASM", "context": "untuk yang mengatakan tidak apa2, dia hanya bicara keturunan, memang itu tidak masalah: mau Jerman, Inggris, Tiongh… https://t.co/vy5jZdprFa", "text": "@BruceEmond I'm not her fan whatsoever but in this case I'm willing to give her a benefit of doubt. As a non-native… https://t.co/ZIMSOVrGup"}
{"label": "NOT_SARCASM", "context": "//why do you guys torcher me with amazing Picture of husbandos .....like do you want me to go on a  Fangirl Frenzy?", "text": "@MissBoomB00m //go ahead your a teacher you got the weekend off"}
{"label": "NOT_SARCASM", "context": "@Arjunkisor @y_kale @savvykapoor @Purva007 @AshishDas17 @Sudhir_1965 @DivyaSh0907 @ShenoySurekha @parikhashit… https://t.co/nX8lCzfCV3", "text": "@AjitSushama @Arjunkisor @y_kale @savvykapoor @Purva007 @AshishDas17 @Sudhir_1965 @DivyaSh0907 @ShenoySurekha… https://t.co/mijSIPeo9o"}
{"label": "NOT_SARCASM", "context": "@bryanalvarez Yeah agree with that. Was great but it just drags out too much. Less is more.", "text": "@RossT17 @bryanalvarez The money that @WWE gets from that third hour of TV outweighs all the criticisms of having t… https://t.co/ipV6rW7Zv6"}
{"label": "NOT_SARCASM", "context": "I can’t be the only one who thinks meatloaf is abhorrently disgusting.", "text": "You definitely aren’t! I hate it too 🤮🤮😂  @mattithephantom https://t.co/465YxossYD"}
{"label": "NOT_SARCASM", "context": "@gmfb @TeeForest @KyleBrandt @heykayadams @PSchrags @nateburleson   At this point I have to say,  Ravens are too sc… https://t.co/MovN2fzXkx", "text": "@SJunkie84 @gmfb @KyleBrandt @heykayadams @PSchrags @nateburleson Many people are thinking the 9ers will@make the S… https://t.co/woMTOV5i9a"}
{"label": "NOT_SARCASM", "context": "@Benniewilson111 No matter who they got in as manager they won’t be able to do a better job than Ole is with these… https://t.co/VXRAOsh70t", "text": "@bloom200 @Benniewilson111 Simply not true...  I like Olé but your opinion is way off...  That is like saying Olé i… https://t.co/wpEd9blWa9"}
{"label": "NOT_SARCASM", "context": "Good morning 😜  Want to see more from sublime model @laurenlouise228 latest shoot!!  Then head over to our… https://t.co/rW1tSUevJk", "text": "@mayfairmag @laurenlouise228 @AdmireMeVIP @laurenlouise228 looking sensationally sexy and insanely 🔥 🔥 🔥 🔥 🔥 🔥 🔥. Hope you're well #ZaraMae?"}
{"label": "NOT_SARCASM", "context": "mario party advance is a good game i dont care what anyone says", "text": "@ZeroJanitor I played a lot of it as a kid. I think it’s an enjoyable single player experience, but unfortunately,… https://t.co/iclRhmIOrM"}
{"label": "NOT_SARCASM", "context": "Watching my boyfriend get slaughtered in modern warfare makes me miss playing so bad. https://t.co/dcNVTDdzqK", "text": "@naminker10 come back to it. but then again this game frustrating"}
{"label": "NOT_SARCASM", "context": "@KanoaLloyd I loved your first episode tonight, especially because of the aroha the couples had for each other ❤️", "text": "@HilaryFenton65 Gorgeous aye? x"}
{"label": "NOT_SARCASM", "context": "To a journalist who knows the story in and out, maybe the hearings didn't reveal much that they didn't already know… https://t.co/tPCY7rAaMX", "text": "@NateSilver538 Maybe if the journalists actually researched the legal issues surrounding this impeachment inquiry i… https://t.co/ogpwp8dTP7"}
{"label": "NOT_SARCASM", "context": "@nkosibooi Lies! You never voted for him. He's been consistent in his revolutionary abrasiveness and nothing would… https://t.co/vZ4f4g4ltX", "text": "@mantakana @nkosibooi But that’s his personal feeling,wat device dd u attach to him that determines whether human e… https://t.co/s6pWCiUcwS"}
{"label": "NOT_SARCASM", "context": "😭 I am so shocked right now!! I was literally taking a nap and my boyfriend woke me up &amp; proposed to me 🥺🖤💕.. Im so speechless rn!!", "text": "😩😩girl congratulations this is beautiful https://t.co/PtsOkN4E8x"}
{"label": "NOT_SARCASM", "context": "@C_VargasHarle 👍 https://t.co/5DkhvwxhGK", "text": "@WW1_Series @C_VargasHarle Thanks to this one I am hooked. I am now waiting for a Ju-52 to hit the stores (Potez 54… https://t.co/Lilj01XblO"}
{"label": "NOT_SARCASM", "context": "Back in the day I deadass thought that one day I’d be able to dance this well...I still have yet to find a lick of… https://t.co/h4lCWezpNq", "text": "@tah_leee I believe in you"}
{"label": "NOT_SARCASM", "context": ".@ravens @Lj_era8 oooooozing with Patience; Vision; Touch; and an Accuracy that allows him to place the ball where… https://t.co/OTpNJcgAI6", "text": "@BaldyNFL @Ravens @Lj_era8 This is a very bad example here... bad ball placement, errant throw and almost got his guy killed."}
{"label": "NOT_SARCASM", "context": "Message to all my friends, i love yall", "text": "@__lazo_ Good night America"}
{"label": "NOT_SARCASM", "context": "We did do this in the 1990s. The Australian teams dominated. Would be the same in 2020 https://t.co/sfMy7HPp3r", "text": "@johnnyddavidson Appreciate the ambition and the enthusiasm but I remember watching the Aussies runs up cricket sco… https://t.co/3MsBL896HK"}
{"label": "NOT_SARCASM", "context": "If you have chronic health issues, have dietary changes made a positive difference in your symptoms?  (even if in t… https://t.co/R5Vuw7nTks", "text": "@bennessb Gluten free, pescatarian &amp; low fodmap for bloating, vomiting &amp; constipation"}
{"label": "NOT_SARCASM", "context": "Remember reach", "text": "@terroreyes_ Are you talking about Halo or wingspan"}
{"label": "NOT_SARCASM", "context": "Great news this morning! We're so very please to announce that our 4th jury panel member for the Midlands Movies Aw… https://t.co/jCnl2K6g0O", "text": "Thank you - looking forward to seeing lots of great films! https://t.co/P4TMhjdkF8"}
{"label": "NOT_SARCASM", "context": "You think air is clean today just because you can see the sky, right ?   Wrong!  You are still breathing poison ☠️… https://t.co/5s5zWlOQsx", "text": "Xiaomi watch 😍😍 https://t.co/pt1f1G3ii9"}
{"label": "NOT_SARCASM", "context": "Sorry I had to retweet this🤣😂😂😭😭😭😜 https://t.co/UYG64svg6w", "text": "@Asiimwecliffe @_MrPatryk @Hoffmansolomon1 😂😂😂"}
{"label": "NOT_SARCASM", "context": "Fascinating interview by @afneil of @NicolaSturgeon - she is really struggling to answer basic questions on how to… https://t.co/jdb5wAktRr", "text": "@murdo_fraser @afneil @NicolaSturgeon Murdo Fraser that will be the deficit ran up by your Tory UK Government's and… https://t.co/e5jzqryExf"}
{"label": "NOT_SARCASM", "context": "@Tesco hello, I was wondering how I can give feedback on a wonderful experience in store if I don’t have my 4 digit… https://t.co/ehvHyrLHhJ", "text": "@draculiine Hey there, thanks for your tweet. I should be able to find out the number for you, can you let me know… https://t.co/nQZnWOy1aa"}
{"label": "NOT_SARCASM", "context": "okay I don't rly go here but this was fun https://t.co/GW3A2UDhs7 https://t.co/EO6ebaHkCN", "text": "LIT TRAINER https://t.co/Xcas0hENgN https://t.co/HwTRVA0fmR"}
{"label": "NOT_SARCASM", "context": "Blonde vs Dark https://t.co/AoZSjd2CIp https://t.co/TpZibUUROL", "text": "Omo. https://t.co/GaKwNlzm9H"}
{"label": "NOT_SARCASM", "context": "We need to have a conversation about this train wreck of a show that was X019. I can't just ignore the direction Mi… https://t.co/FSCTZ9WMj6", "text": "@xMBGx while the show absolutely sucked, the real party will be at E3 2020, both sony and ms will blow mind, pre ne… https://t.co/xliqyg65KT"}
{"label": "NOT_SARCASM", "context": "How this badness work? https://t.co/LcP9CCUgrP", "text": "@BrandonMorris16 @iamKeemy Him madda a buss a bigga gun"}
{"label": "NOT_SARCASM", "context": "Bonsoir min bedo hebbo", "text": "@chaoticmindd Mi🥺"}
{"label": "NOT_SARCASM", "context": "Curious to learn what your future holds? This snickering hyena crone may be able to tell your fortune! Look for thi… https://t.co/DK78C7b7wY", "text": "I mean, just look at this awesome dude. Give him some love https://t.co/YbwK0RhBeQ"}
{"label": "NOT_SARCASM", "context": "I’m not sure how long this will take. I’ll do my best to fix it, but otherwise we may have a real lack of content f… https://t.co/qqvYD0HZ9r", "text": "@HurstyGames Not your fault, mate chin up your haven’t let anyone down we all love ya ❤️❤️ can always stream direct… https://t.co/W5BEvtjyFA"}
{"label": "NOT_SARCASM", "context": "@SleeperAth1etes @RealSkipBayless @Lj_era8 “He’s a RuNnInG bAcK” @keithstone_48", "text": "@Kaleb_Kracman @SleeperAth1etes @RealSkipBayless @Lj_era8 Julian Edelman threw a touchdown pass last week but isnt a quarterback now."}
{"label": "NOT_SARCASM", "context": "why is my new landlord asking me to sign a statutory declaration that I will have no right to stay in the premises… https://t.co/Sfz9MFhqTX", "text": "@hannahlouisef Yer this isn’t housing law. This is what the tenancy agreement does why would there be a need for a… https://t.co/mnS0jxjM8Z"}
{"label": "NOT_SARCASM", "context": "just saw a meme account spell color as colour i never pressed the unfollow button so fast in my entire life 😔🙏💯👊", "text": "@shigeoreum Oof...I spell it like colour 💀"}
{"label": "NOT_SARCASM", "context": "@johnandcrystal4 @MarkKoops @beingkarmin @ithrah69 @Cool_Phoenix333 @christi41435323 @denb0120 @Devona66597696… https://t.co/Qex2gkljjL", "text": "My daughter would like the same! Hatchet throwing is fun. https://t.co/PiuXckX5dE"}
{"label": "NOT_SARCASM", "context": "Yes https://t.co/4xgLzOqvSW", "text": "@sportslogosnet I assume the white one is too? What else is gone for the Nats?"}
{"label": "NOT_SARCASM", "context": "This is literally the best day ever! #Disney+ https://t.co/4w3OMdKuk4", "text": "@BBlackwell13 @JedBlackwell Added it last night as per a @HallThayer02 request!"}
{"label": "NOT_SARCASM", "context": "Suns don't play again until Monday what kinda shit is that 🤨", "text": "@purple_n_orange That the weekend off !!!  MANDALORIAN !!!"}
{"label": "NOT_SARCASM", "context": "@enthahotness @NameFieldmt south indian vs north indian", "text": "@nayanikaaa @enthahotness @NameFieldmt Exactly, what was on my mind"}
{"label": "NOT_SARCASM", "context": "I was really walking around with my child in public today with a straight face but in my head I was tryna figure ou… https://t.co/NJyq3bdTDE", "text": "@freshiegrl you good?"}
{"label": "NOT_SARCASM", "context": "$500 tip tonight an I don't even know who it was 🤦🏾‍♂️ #blessup", "text": "@TheRealElusive See what I'm saying king be patient and we will be treated as kings"}
{"label": "NOT_SARCASM", "context": "Kinda wanna slide to Joeys for wings &amp; bellini’s , kinda wanna lay on the couch curled in a ball.", "text": "@askashleyp Headed to Burnett's in a few."}
{"label": "NOT_SARCASM", "context": "Delete league pls https://t.co/6Y8iAZtIl8", "text": "@firminosdentist Why delete league?"}
{"label": "NOT_SARCASM", "context": "View from my window at The Mission Inn. ⁦⁦@hailingj1⁩ ⁦was a wonderful host for seminar trip. So much cool fungal s… https://t.co/mQKPWm9YE0", "text": "@mcmomany @hailingj1 @UCRCNAS @hyphaltip @sydneyglassman @wenboEffector Was a pleasure having lunch and our deep me… https://t.co/9Czuh9lHKw"}
{"label": "NOT_SARCASM", "context": "@alysewax @peacenik0 https://t.co/qhk3m1k9lQ", "text": "@SlippinMickeys @alysewax @peacenik0 I need more Gillian writing stat! 😅"}
{"label": "NOT_SARCASM", "context": "@brianonthescene @torani @Starbucks @POPSUGAR I've been researching and can't find anything. Is this some sort of e… https://t.co/tDAquTen6U", "text": "@Annecdotally Hi there! Unfortunately, we don't offer a Sugar Free Gingerbread syrup anymore but if you're ok with… https://t.co/Q6jin1VmtH"}
{"label": "NOT_SARCASM", "context": "Again, why didn't any of you recommend Homegoing to me??????", "text": "@_DAYwonder I know you better drop that Goodreads link tho 👀"}
{"label": "NOT_SARCASM", "context": "Our little date was cut short as a mission came up. Lucky we already have our weapons with us. You’re lucky we were… https://t.co/geVm7cGoKs", "text": "@420blaeseit @sunshinezueshi You know I would take it on myself boys."}
{"label": "NOT_SARCASM", "context": "Imagine not voting Ramsey https://t.co/lnPQkkaDBb", "text": "@JujuWithDaJuice Wouldn't make top 2"}
{"label": "NOT_SARCASM", "context": "@xneedymariah @IWontActMyAge @rozzybox Who the fuck- https://t.co/yGRx7JEXPb", "text": "@LouisRevengers @xneedymariah @rozzybox The amount of time she spent blocking 700+ people for no reason 🤣🤣🤣"}
{"label": "NOT_SARCASM", "context": "I’m feelin goooooood ☺️ https://t.co/ZIy29vyvGJ", "text": "@ImKandarr What’s routine are you doing diet and exercise wise? Strong calorie cutting or bulking"}
{"label": "NOT_SARCASM", "context": "Would appear to be exactly what they're saying, Linda https://t.co/fL3KAuSqel", "text": "@terrimcue If they want to give a carer a job discription they will need to start paying us the living wage. We are… https://t.co/jUYSnRdWpO"}
{"label": "NOT_SARCASM", "context": "Not this one EVER in my whole existence https://t.co/xALfNH8IPz", "text": "@Maine_561 Man I wish I would give a bitch that power 😭😭😂😂"}
{"label": "NOT_SARCASM", "context": "I must be the only person in #Jozi who hasn't been to the Fourways Farmer's Market   Need to fix that before the year ends", "text": "What's that https://t.co/DRjGkKn3bU"}
{"label": "NOT_SARCASM", "context": "i got accused for camping??? https://t.co/6XxuOwT2vs", "text": "@SoaRZephy big dick eddie LMFAOO"}
{"label": "NOT_SARCASM", "context": "How to disappear 😭😭", "text": "@pinkjin04_ Are you okay? Talk to me"}
{"label": "NOT_SARCASM", "context": "@KeithSmithNBA @Tjonesonthenba Which is really kinda dumb... the whole point of the challenge is to make sure that… https://t.co/2P9IAQ4T7X", "text": "@MarkW_E01 @KeithSmithNBA @Tjonesonthenba It absolutely makes sense for a team to need to have a timeout in order t… https://t.co/9yrR3ILLoI"}
{"label": "NOT_SARCASM", "context": "Maybe she was upset she looked like Biggie’s side piece in the movie. But that’s what she was LMFAOOOO", "text": "@CapLee27 The only issue I had with the movie is Faith Evans was married to that man she wasn’t fucking him naked?… https://t.co/Tez9hyElnQ"}
{"label": "NOT_SARCASM", "context": "@wijenyum pls LRT", "text": "@Putri_Laurant ykno how confused i was at this....   (yg mn)"}
{"label": "NOT_SARCASM", "context": "The best center in the league had 0 points 😂😂😂😂😂😂 @JuantheGreat25", "text": "@QuanGottii KAT would never. Tried putting niggas on before the season. They ain’t wanna listen😬"}
{"label": "NOT_SARCASM", "context": "@j_camachor Just gonna leave this here https://t.co/b3UjucY5WA", "text": "@econbecon @j_camachor Tag yourself I'm kaczynski cabin asperity zone"}
{"label": "NOT_SARCASM", "context": "@mirabel_lez The sensible ones do", "text": "@JamesKhelly @mirabel_lez No one is sensible"}
{"label": "NOT_SARCASM", "context": "how are you holding your phone right now ? https://t.co/gzAO1Hk5mk", "text": "2,6,7 https://t.co/4ZroFimDxb"}
{"label": "NOT_SARCASM", "context": "There is, on god, nothing funnier to me than the fact that people used to come to me with their relationship proble… https://t.co/P1VTCJ7d97", "text": "@Desusaur won't need relationship advice if you never plan on having a relationship"}
{"label": "NOT_SARCASM", "context": "What’s the best pizza place in Atlanta I’ve decided pizza is the move", "text": "@Mattstergamer Not pizza but I highly recommend the Silver Skillet Diner for Breakfast/Lunch."}
{"label": "NOT_SARCASM", "context": "Vodka is vegan right? Asking for a friend.", "text": "@McAmberdawn Marijuana is!"}
{"label": "NOT_SARCASM", "context": "A must read from @TerryGlavin  Every single word. #cdnpoli  Ottawa goes meek and gentle with Beijing -… https://t.co/OgxIyyShQ1", "text": "@BradWestPoCo @qlee50 @TerryGlavin Gentle? Toronto joined long ago https://t.co/MRBMfsG6M8"}
{"label": "NOT_SARCASM", "context": "@markhmasters A confident answer is hugging that post swatting that pick away, instead he's drifting to the right s… https://t.co/QuwMSZ5Rsr", "text": "@CoachBombayy @markhmasters The problem is they can’t put the body to anyone. Don’t know if it’s the memo sent out.… https://t.co/K2J3oADcCf"}
{"label": "NOT_SARCASM", "context": "@realDonaldTrump You are delusional. Like anyone would believe either of you. You were in on it together. How dumb… https://t.co/R76C73Tltr", "text": "@MystiConnolly @realDonaldTrump He knows his base is completely different from the regular real American base. He i… https://t.co/oeG0HiAbic"}
{"label": "NOT_SARCASM", "context": "Best #forthefans racer I've had the pleasure of meeting is @RyanEversley his influence helped me keep striving to o… https://t.co/dVBQOcw1bV", "text": "Thanks for the kind words Dave, awesome gif choice too! Probably the fastest lap Ive ever done at @VIRNow.. @Acura https://t.co/h2ZNNxrftp"}
{"label": "NOT_SARCASM", "context": "What an incredible ending! #CriticalRole #UnDeadwood", "text": "@CSpoonerPFN What the hell is UnDeadwood?"}
{"label": "NOT_SARCASM", "context": "Can't wait to see all the people that shit on Uncharted gas Star Wars Jedi: Fallen Order.", "text": "@JackmoveJohnny This a bad take, Jedi is much cooler you can be a Jedi for crying out loud and uncharted your just… https://t.co/OJnmVkUUmB"}
{"label": "NOT_SARCASM", "context": "Please quote tweet this with your most controversial food opinion, I love controversial food opinions", "text": "cold mushy peas mixed with hot mushed banana is incredible https://t.co/PxakDSTNkZ"}
{"label": "NOT_SARCASM", "context": "Disney reveals dates for 5 mysterious MCU titles:  • Oct. 7, 2022 • Feb. 17, 2023 • May 5, 2023 • July 28, 2023 • N… https://t.co/omkbDsx1xD", "text": "• SECRET WARS  • SECRET WARS II  • SECRET WARS II REISSUED WITHOUT THE SPIDER-MAN/BEYONDER BATHROOM SCENE THAT DISG… https://t.co/SvMF16dRMt"}
{"label": "NOT_SARCASM", "context": "11/16 Sending #healingpurrs to Luis and Ms Vicki. Luis has pain on his right side but doing well otherwise. Ms Vick… https://t.co/47FnFhaET7", "text": "@lynda3035 @vroberts9 @BloomNight2 @MissytheB @sharon_cantley @DonnaLeeThomps8 @Marina935home @Joeybird… https://t.co/aMPV7njlnh"}
{"label": "NOT_SARCASM", "context": "Hard day for gnar 🥺🥺🥺🥺💞😫 https://t.co/XQL9ITJc2z", "text": "@_claiire WHY IS MY FLOOFSTER IN THE CONE OF SHAME"}
{"label": "NOT_SARCASM", "context": "okay so i’ve seen bad reviews for Chixtape 5....", "text": "Shit some mid https://t.co/5wV1XYvbLT"}
{"label": "NOT_SARCASM", "context": "Me: \"playing Star Citizen\"  Tony Z: \"yeah, I beat that game like forever ago so I built a game based on it called Q… https://t.co/dRqNRH1aBs", "text": "@DrDronezChannel @realsgttickles I am really excited by the in depth economics."}
{"label": "NOT_SARCASM", "context": "ยังไม่ถึงไหนเรยค่ะ ผมยังไม่เสร็จ ผ้ายังไม่มา พื้นหลังยังไม่เกิด แระฉันง่วงแล้ว 😢 https://t.co/LYqE68IcY5", "text": "😍😍😍😍😍😍😍😍😍 https://t.co/JZCimTOSda"}
{"label": "NOT_SARCASM", "context": "@FootbaIlFact Ronaldo, Ballack, Zola, Del Piero, Okacha", "text": "@TombaNic @FootbaIlFact Ballack never played for Dortmund!"}
{"label": "NOT_SARCASM", "context": "@dave_spirit2001 @AIPChristina @TimothyWinfrey @ananavarro \"Everything\" doesn't dispute it. Qualify your \"everythin… https://t.co/GiQU4hnSiM", "text": "@rick2162 @dave_spirit2001 @AIPChristina @TimothyWinfrey @ananavarro First step act ? Do some research clown 🤡 too… https://t.co/radhd4PMEL"}
{"label": "NOT_SARCASM", "context": "#ILeftUmjoloBecause was tired of being cheated on and always in tears 😭😭💔💔 https://t.co/Zwe3JSA2H9", "text": "@Charlamaine2 Awa gel wh can cheat for such beauty mara"}
{"label": "NOT_SARCASM", "context": "I tweeted that I couldn't stand Indian cuisine and started an international food fight https://t.co/1iUs5Q6Xi8 via @usatoday", "text": "@RadioFreeTom @USATODAY Not many people can start an international incident with a simple food opinion."}
{"label": "NOT_SARCASM", "context": "@Airtel_Presence greatest service of airtel ever in one hour 50% of data pack finished and in another 20 minutes it… https://t.co/ZWJFpCrkqx", "text": "@EHafeji Hi! Thank you for reaching out! You can check your daily data usage by dailing *121*51# Here are few simpl… https://t.co/LYY0oA1G8d"}
{"label": "NOT_SARCASM", "context": "Does anyone know where to get custom thank you cards made? I have my own artwork if that helps or changes the sugge… https://t.co/p3XaOuJB9u", "text": "@eastenddennis Do you want it to be local?  If no, you can do it on websites like Vistaprint or Shutterfly.  Not su… https://t.co/5PMHhsI8pT"}
{"label": "NOT_SARCASM", "context": "Only a few mainstream rappers are better than Rapsody lyrically...", "text": "@Stunnah100 Only 2"}
{"label": "NOT_SARCASM", "context": "Fan duel owe me a free turkey or someshit", "text": "Lmaoooo word iz B -O-N-D https://t.co/B5WNyATvT3"}
{"label": "NOT_SARCASM", "context": "After a long day of maths, this girl unwinds with #sangria and #rummy.  How do you relax on a Friday night? .… https://t.co/fcfzRf0Boc", "text": "@BkkprGal Twitter,listen to some old LP’s,call some friends"}
{"label": "NOT_SARCASM", "context": "It’s dead upload day. Save your sims videos for tomorrow, my lovely people! https://t.co/pQVStjWq2W", "text": "I will be taking this time to write. What will you be doing today? https://t.co/hMvM6r618O"}
{"label": "NOT_SARCASM", "context": "📣Atiny!  I came up with this idea for Yeosang since he missed his graduation ceremony. Please drop English &amp; Korean… https://t.co/1y5keIqoeP", "text": "@Meazatiny @atinyteeny We can print it out and give it to him in a fan sign #ateez #MAMAVOTE"}
{"label": "NOT_SARCASM", "context": "@Braxton_Grimes  @BrinaB__ https://t.co/V6TYZCeupP", "text": "@breezyb_baby @BrinaB__ 😂😂😂😂😂😂😂😂😂😂😂😂"}
{"label": "NOT_SARCASM", "context": "Never let fear hold you captive.  Never let self-doubt hold you captive.  Never let frustration hold you captive.… https://t.co/vPGDq4gnW4", "text": "@JohnFanimokun Morning"}
{"label": "NOT_SARCASM", "context": "go bade https://t.co/4U4e5cLGXB", "text": "@ChanelMurder I don’t get it"}
{"label": "NOT_SARCASM", "context": "Na wa Oh. You just dey win jackpot for the Twitter Ni Sha, Which soap this alhaja dey use ? She don win like 500k f… https://t.co/iCSy7etYwi", "text": "@bimbo_cash She knows how to reach the ♥.  Among 101 request,  she be sabi person.  😂"}
{"label": "NOT_SARCASM", "context": "twice halloween bottle set: finished https://t.co/lMNXxN2K2f", "text": "The dedication omg https://t.co/yAgPhJQwn9"}
