{"label": "NOT_SARCASM", "text": "@davesnyder since this is fantasy can it be any individual in time, or just alive today?"}
{"label": "SARCASM", "text": "Good times, fun times here in Grand old Britannia. https://t.co/9mNAD0i9Rh"}
{"label": "NOT_SARCASM", "text": "I send light and love to all impacted by the #vegasshooting. Know that love is stronger than evil. We will get through this! #VegasStrong"}
{"label": "NOT_SARCASM", "text": "Another year closer to death"}
{"label": "SARCASM", "text": "Looks like the leagues heading to the reds then"}
{"label": "NOT_SARCASM", "text": "Vacay 3-Way. Only had to drive three and a half hours from home and over an inactive volcano to find two cans.… https://t.co/PwjnlDvdA2"}
{"label": "NOT_SARCASM", "text": "Enrolled in classes for the last time ever  College went by so fast wtf"}
{"label": "NOT_SARCASM", "text": "We doing whatever it takes to get to 6 foot in 2018 https://t.co/FbGx5zi5cr"}
{"label": "SARCASM", "text": "1st Tweet:  The Central Division is far from over, @gordonbeckham for a gold glove?  Rios 3-4 tonight @Twins."}
{"label": "NOT_SARCASM", "text": "@JoeyBoots hows high pitch boots?"}
{"label": "NOT_SARCASM", "text": "Today was terrible and we have so much work left to do. But watching @nbcthegoodplace with my dog sleeping on my fe… https://t.co/3tftLAM8rc"}
{"label": "NOT_SARCASM", "text": "Highly recommend @SearchingMovie - very thought-provoking film with a fantastic lead performance from @JohnTheCho.… https://t.co/Gbppdrid6j"}
{"label": "NOT_SARCASM", "text": "@CGrantWSJ Life in Buffalo.  A couple feet of snow, temperatures hovering around zero, and forty mile per hour wind… https://t.co/BovrvQh7Dr"}
{"label": "NOT_SARCASM", "text": "@jennmcallister liked my comment on instagram so i can die happy now https://t.co/SlPnmUTiqu"}
{"label": "NOT_SARCASM", "text": "LeBron living in the president's head rent free at midnight on a Friday. GOAT. https://t.co/ROCwVupBSP"}
{"label": "NOT_SARCASM", "text": "Came back from 8123 fest with a new job maybe 2019 truly is my year"}
{"label": "NOT_SARCASM", "text": "Make money by doing quick studies, UK based, Try Prolific! https://t.co/GAOBpKSZbG #research via @prolificac"}
{"label": "NOT_SARCASM", "text": "First run in four weeks tonight following a calf injury. Successfully completed 3 miles pain free! So happy to back… https://t.co/VTpwdLc64D"}
{"label": "NOT_SARCASM", "text": "@realDonaldTrump You can't misquote someone when video is played of them speaking their own words on the subject."}
{"label": "NOT_SARCASM", "text": "Late nights and early mornings are draining 😩"}
{"label": "NOT_SARCASM", "text": "Finessing the sync pull"}
{"label": "SARCASM", "text": "Always nice to be forgotten about"}
{"label": "SARCASM", "text": "Yet despite this your fearless hero will nevertheless press on and watch the second film when he next gets the chance."}
{"label": "NOT_SARCASM", "text": "I may have forgotten a couple, but in no particular order, I think: Once Upon a Time in Anatolia, A Separation, Neb… https://t.co/vjLZf7GPjF"}
{"label": "NOT_SARCASM", "text": "Oof, nice. 500 Retro Movie Posters Have Been Digitized &amp; Made Available For Free Download. https://t.co/F0tGCBa8tf"}
{"label": "SARCASM", "text": "Just told my son it’s time to get ready and he replied ‘give me a break mummy’ he’s definitely mine then"}
{"label": "NOT_SARCASM", "text": "I’ve literally just had a breakdown reading about Malins wee baby dying, absolutely heartbroken for her"}
{"label": "NOT_SARCASM", "text": "There’s nothing worse than a mutual attraction with someone but you’ve given up with men."}
{"label": "NOT_SARCASM", "text": "How does someone from your hometown with no mutual friends find you on Facebook. That’s what I’d like to know"}
{"label": "NOT_SARCASM", "text": "@TheProteinWorks 3-1 England"}
{"label": "NOT_SARCASM", "text": "I've just finished my MSc - what a year! 🎉 Thank you to all the kind people who took part in my experiment and help… https://t.co/m1Qki5oM7M"}
{"label": "NOT_SARCASM", "text": "As someone who uses American Sign Language daily, I got really excited, confused, and disappointed, in that order,… https://t.co/NlSnbQJr0y"}
{"label": "NOT_SARCASM", "text": "I've lost the baby gecko that ran inside when I opened the front door today. At least he will make sure there are no spiders in here #Japan"}
{"label": "NOT_SARCASM", "text": "@henrywlewis Can't believe those German magicians stole your echo. echo. echo. echo."}
{"label": "NOT_SARCASM", "text": "listening to a panopto is just the less interesting version of a podcast"}
{"label": "SARCASM", "text": "congrats on making it obvious that you clearly don’t view ur friends as they rly are"}
{"label": "NOT_SARCASM", "text": "Re the Katie Mitchell on a laptop story. If it is now accepted practice for a creative to disturb a paying audience… https://t.co/BmMeRYc2P2"}
{"label": "NOT_SARCASM", "text": "So proud to be Irish ☘️ a country that’s willing to progress and give women their right of autonomy #repealedThe8th #ProudIrish"}
{"label": "NOT_SARCASM", "text": "This man is crazily good at his edits lmao https://t.co/jsJpHG6DeV"}
{"label": "NOT_SARCASM", "text": "If you have a spare £3 and want to help homeless people... https://t.co/xevnH7zFLw"}
{"label": "NOT_SARCASM", "text": "Double standards everywhere👀"}
{"label": "NOT_SARCASM", "text": "@nadasurf @JasonIsbell @PodSaveAmerica I love love loved that interview."}
{"label": "NOT_SARCASM", "text": "I will forever miss Alan Rickman 💔 https://t.co/qqKTlMxuEU"}
{"label": "NOT_SARCASM", "text": "I'm so glad @AOC is giving us something to talk about in politics beyond our Trashfire-in-Chief."}
{"label": "NOT_SARCASM", "text": "In the US, there r stereotypes about race &amp; outdoor rec., something that programs like @OutdoorAfro and… https://t.co/4uRPU4Y6M6"}
{"label": "NOT_SARCASM", "text": "Watched #MortalEngines last night. Didn’t really care for it - poorly stitched together and not creative. But one t… https://t.co/iz4FOTgdlq"}
{"label": "NOT_SARCASM", "text": "An encouraging first day back on #radiography #placement, nothing but chests, doubt I'll be so lucky tomorrow, but… https://t.co/L5MuY7aZO2"}
{"label": "NOT_SARCASM", "text": "An insanely tiring but rewarding 2nd week of #placement over. Had some fantastic feedback this week, really startin… https://t.co/8IBjWMD71a"}
{"label": "NOT_SARCASM", "text": "Really enjoyed #JohnnyEnglish, very funny, plenty of #Bond references thrown in, and the whole Da Rude Sandstorm da… https://t.co/vEsLTs3jAY"}
{"label": "SARCASM", "text": "Reason 15062017 to get my capsules 🤗  Who needs a scarf when your hair is this thick and long?? 😅  #hairgoals… https://t.co/AaUTuHkH9u"}
{"label": "NOT_SARCASM", "text": "Done my 30 days of dedicate yoga with @yogawithadriene I'm so proud that I didn't give in to the excuses! 🙌 BUT JUS… https://t.co/GZGYlr250z"}
{"label": "NOT_SARCASM", "text": "The premium caps are such an incredible package 😭  Just this one simple change alone can have a massive positive im… https://t.co/mnvL3fzVNP"}
{"label": "NOT_SARCASM", "text": "You know winter’s here when the wind starts hitting your bones"}
{"label": "SARCASM", "text": "I ❤️ my dad"}
{"label": "NOT_SARCASM", "text": "@YouTube would a trending system based on users topic interests not be a better system. Or an actual trending system from trending videos"}
{"label": "NOT_SARCASM", "text": "I can't wait to slap heartless around with a BIG FUCKING FRYING PAN"}
{"label": "NOT_SARCASM", "text": "I've been away from my dog for two nights, and face timed her last night to go to sleep, and I finally get to see h… https://t.co/MRTcb1bIZ9"}
{"label": "NOT_SARCASM", "text": "@TonyFurnari2 @nytimes What happened to responsibility? I guess the tax payer will pick up the bill for those who chose not to get insured."}
{"label": "NOT_SARCASM", "text": "Thinking maybe a bunch of countries should get together and do a regime change on America"}
{"label": "NOT_SARCASM", "text": "how to know you've been gone too long: wake up at 7am and have no idea where you are when you're in your own bed"}
{"label": "NOT_SARCASM", "text": "really struggling w the prospect of going back to uni☹️"}
{"label": "NOT_SARCASM", "text": "pass me the champagne🥂 graduating with a first class honours degree😭👩🏽‍🎓❤️"}
{"label": "NOT_SARCASM", "text": "My sister just got followed and messaged by James Arthur and she just started running round the house screaming. I'm slightly worried."}
{"label": "NOT_SARCASM", "text": "With deadlines looming and aplenty, writing of my WIP has long fallen. But tonight, as witching hour approached and… https://t.co/Xll3ZctEgl"}
{"label": "NOT_SARCASM", "text": "Saying this in a way that everyone can understand.   https://t.co/4ggknsENpZ.WANT.SALESFLOOR.ASSISTANCE!!!!!! #retailproblems"}
{"label": "SARCASM", "text": "love getting a tour of the north west on rail replacement buses 😶"}
{"label": "NOT_SARCASM", "text": "Bought a ticket to see @themaine in London. 𝙉𝙤𝙬 I am Ok."}
{"label": "NOT_SARCASM", "text": "Skint n tired 😭"}
{"label": "NOT_SARCASM", "text": "In 1991 Princess Margaret came to open our college. She not only shut the car door; she opened it herself too. Megh… https://t.co/wRK36UxaVZ"}
{"label": "NOT_SARCASM", "text": "One budgie has spent the last 5 minutes repeatedly asking the other \"Where's Kim? What's Kim doing?\".THEY HAVE TURNED INTO MY PARENTS"}
{"label": "NOT_SARCASM", "text": "Really interesting article, check it out! :)  https://t.co/e80bpEPeea"}
{"label": "NOT_SARCASM", "text": "Little one has been watching #juniorbakeoff over the weekend and insisted we make something. So here we have a Summ… https://t.co/yOPDYasJzf"}
{"label": "NOT_SARCASM", "text": "https://t.co/FayMEmqKpg My video sketch is up on YouTube! I’m so proud of everyone involved, especially @MaybeDOTManny"}
{"label": "SARCASM", "text": "What’s it like being that stupid? No, I’m seriously asking. Do you have awards hanging for your ignorance? My niece… https://t.co/3Cbj6aQeDb"}
{"label": "NOT_SARCASM", "text": "Thank you to Judy Wells for another year of support!!!!  &lt;$100 to go to $50K!!!  Off to registration!… https://t.co/Xs4EquZZu4"}
{"label": "SARCASM", "text": "Apparently I lost weight over break? I guess that means I just need to eat more Christmas cookies year round 🤷🏼‍♀️"}
{"label": "NOT_SARCASM", "text": "Hi there @neilhimself and @hayleycampbell! Someone on reddit is looking for a higher res version of this photo of C… https://t.co/0Z5C4dKUud"}
{"label": "NOT_SARCASM", "text": "Excuses are the most over-manufactured, ideas ever created. It’s takes 0 effort to manifest and simultaneously make… https://t.co/6rafb5N822"}
{"label": "SARCASM", "text": "Just your standard 16 minute long cover 😂 #dropthepressure #flashcassette  #mylo https://t.co/608ULu9gTy"}
{"label": "NOT_SARCASM", "text": "Yesterday myself &amp; @david_kaer released the second @flashcassette album 'II' Seriously proud of this record! #80s… https://t.co/2UlG4KlBXR"}
{"label": "NOT_SARCASM", "text": "@ronnieo147 really is something else. No idea how he keeps raising the bar all the time! #Snooker #WorldGrandPrix"}
{"label": "NOT_SARCASM", "text": "Time for a few hours keyboard practice 🎹 Got a few live gigs coming up over the summer!"}
{"label": "SARCASM", "text": "people that start construction work before 9am on a sunday need to just fuck off and die thanks"}
{"label": "NOT_SARCASM", "text": "Lana’s new album is the only thing that’s gonna get me through tomorrows shift"}
{"label": "NOT_SARCASM", "text": "timetable for uni is out and i only have one 9am lecture a week sweeeeeet"}
{"label": "NOT_SARCASM", "text": "has anyone tried using a weighted blanket for their anxiety? Really tempted to try one"}
{"label": "SARCASM", "text": "I thought this was a library, not a nightclub. #pleasestopyelling"}
{"label": "NOT_SARCASM", "text": "Meeting @PanicAtTheDisco yesterday was so incredible. I still don't feel like it was real."}
{"label": "NOT_SARCASM", "text": "It's not worth the tears. Your happiness is more important. That's what you need to focus on first + foremost. #notetoself"}
{"label": "NOT_SARCASM", "text": "Two down, one to go. 📖😁 #finals #determined"}
{"label": "SARCASM", "text": "Happy Bwexit Day #fuckit https://t.co/zIItwVUXLg"}
{"label": "NOT_SARCASM", "text": "when you have all the healthy noms, but only have the energy to 'cook' the pot noodle at the back of the cupboard..… https://t.co/sDd7VkPSbq"}
{"label": "NOT_SARCASM", "text": "What do you do when you’ve lost your glasses, but need your glasses to find your glasses?! 🤯"}
{"label": "NOT_SARCASM", "text": "I'm treading this very fine line between passionate enthusiasm and total obsession for @melrobbins 😍"}
{"label": "SARCASM", "text": "@rachel_smithx haha I've been looking for a way to put on weight..."}
{"label": "NOT_SARCASM", "text": "Like it's an isolated incident that I'm expected to get over and everything continues as normal.  Frustrating to ha… https://t.co/zPAomyAihy"}
{"label": "NOT_SARCASM", "text": "Everythings gonna be ok 😊"}
{"label": "SARCASM", "text": "Wow what a first lap - plenty of action and no accidents! #bbcf1"}
{"label": "NOT_SARCASM", "text": "WOW! 4 consecutive stellar race days. The sport really needed that. I’m not going to cope with summer break! #bbcf1… https://t.co/4JeXWbgSny"}
{"label": "NOT_SARCASM", "text": "Disgusting behaviour by a @ChelseaFC steward. https://t.co/6BTKCtl7GZ"}
{"label": "NOT_SARCASM", "text": "No one is grabbing this World Cup by the scruff of the neck. Could it be the year of the underdog?  #bbcworldcup"}
{"label": "SARCASM", "text": "If someone disagrees with you, block them  Is that the Twitter mantra?  (Yes I’m still new here)"}
{"label": "NOT_SARCASM", "text": "“It’s hard to be vegan”  Compared to what the animals go through, it isn’t.  But we can’t deny for some people it’s… https://t.co/W6dqpLXOdM"}
{"label": "NOT_SARCASM", "text": "Being nice means being agreeable, making others feel good, kicking back  Be polite, be reasonable, but don’t be a n… https://t.co/w5GXOkr1L0"}
{"label": "NOT_SARCASM", "text": "Radium Schokolade, on the other hand, was actually made with radium laced water. This was a popular brand in German… https://t.co/6seDroAs8O"}
{"label": "NOT_SARCASM", "text": "New to me. Needs a bit of a clean but ❤️ it was a present given to my grandparents on their wedding day. https://t.co/KSAU9rEgbY"}
{"label": "SARCASM", "text": "\"Plugged in, charging\", but not moving from 0%.. Yeah, thanks laptop, not like I need to do any work or anything"}
{"label": "NOT_SARCASM", "text": "My external hard drive came today! Left it way too late to purchase one of these, but pleased with it. Simple plug… https://t.co/RVYoK66dzZ"}
{"label": "NOT_SARCASM", "text": "Had a lovely day celebrating the boyfriend's 30th birthday with him! We went to see #JurassicWorld, then went to se… https://t.co/gr1weJKFfY"}
{"label": "NOT_SARCASM", "text": "This whole new blackmail scam email supposedly from someone from Darknet is terrible. I can't people people are act… https://t.co/awznRJkDa8"}
{"label": "SARCASM", "text": "Great. Get to go to a million pull-a-parts for a fucking switch for our envoy."}
{"label": "NOT_SARCASM", "text": "One of my two favorite teams for this TI is gonna get eliminated tonight. :&lt;"}
{"label": "NOT_SARCASM", "text": "Greatest rapper alive: Sean Paul"}
{"label": "NOT_SARCASM", "text": "@REALIcePoseidon Believing this tweet https://t.co/CYx2gPCGFq"}
{"label": "SARCASM", "text": "Great one 👍🏼"}
{"label": "NOT_SARCASM", "text": "Being sad is the worst lol"}
{"label": "NOT_SARCASM", "text": "3 coffees, 7 hours of work and a 10 minute power nap later: https://t.co/4TCimRzB7o"}
{"label": "NOT_SARCASM", "text": "Cardio? Cardi-no thank you :)"}
{"label": "SARCASM", "text": "Sure I didn't want to sleep anyway like!"}
{"label": "NOT_SARCASM", "text": "I'm home, I'm in my pyjamas and I'm ready to enjoy Christmas with my wonderful family! ... And chocolate!! #tooexcited"}
{"label": "NOT_SARCASM", "text": "Tonight I'm suffering from the aftermath of a busy day in the coffee shop! Seriously painful legs!! #tw5 #pleaserelate"}
{"label": "SARCASM", "text": "@joecrocker378 @ArgusICraig Right because thats the biggest priority right now........................................clearly."}
{"label": "NOT_SARCASM", "text": "@catlikecoding Hi For water reflections on oceans, would reflection probes be used or planar reflections? I feel li… https://t.co/v9LN2Er3lr"}
{"label": "NOT_SARCASM", "text": "@winterrocked Not surprising given everything goes to London and everyone else gets scraps in comparison."}
{"label": "SARCASM", "text": "How is it June when Christmas was a week and a half ago? Government manipulating us again smh"}
{"label": "NOT_SARCASM", "text": "Happy birthday @MimPaints, have the best day of your entire life 🎈 https://t.co/9nAUVK1Zll"}
{"label": "SARCASM", "text": "@TheRAC_UK great service!! My wife is still waiting for you to turn up! 3hrs 45 minutes and counting!!!"}
{"label": "NOT_SARCASM", "text": "Six things we learnt from matchweek 9 https://t.co/28gFXEORxL via @wordpressdotcom"}
{"label": "NOT_SARCASM", "text": "@leanne_westlake welcome to the world of twitter :)"}
{"label": "NOT_SARCASM", "text": "So friggin cool 🐊 #baldyphotobomb #O2ForumKTown @DINOSAURPILEUP https://t.co/y2YfKvHzG1"}
{"label": "NOT_SARCASM", "text": "Buzzing for @DINOSAURPILEUP 🤘🤘🤘"}
{"label": "SARCASM", "text": "@ThunderS7ruck I LOVE me some WNBA"}
{"label": "NOT_SARCASM", "text": "@ThunderS7ruck Wait until launch night, you will hate it."}
{"label": "NOT_SARCASM", "text": "honestly tho I'm sick of doing what everyone else wants just cos I'm afraid of hurting their feelings, think I need… https://t.co/6dTKvFqHoU"}
{"label": "SARCASM", "text": "Tune in to see old refs throw flags on the ground. There is a football game mixed in between as well."}
{"label": "NOT_SARCASM", "text": "How about the family of the kid he murdered? Don't murder people and you can be apart of your family's life. Quit u… https://t.co/oRGJWuFRAu"}
{"label": "NOT_SARCASM", "text": "Playoff baseball is great no matter if your team is playing or not!"}
{"label": "NOT_SARCASM", "text": "Mayweather is tiring out Connor. He's throwing weak punches at this point."}
{"label": "SARCASM", "text": "y’all really laying next to a man that ain’t chocolate? 🤢 tragic"}
{"label": "NOT_SARCASM", "text": "really ain’t been to sleep yet and I’m finna pull this bartending shift tonight like I’m crazy 😩"}
{"label": "NOT_SARCASM", "text": "I love when I sneeze and chills shoot through my body. 😊☺️"}
{"label": "SARCASM", "text": "happy about the new terribly acted, terribly written, terribly shot new sci-fi netflix show about aliens with made up science"}
{"label": "NOT_SARCASM", "text": "i would like the country to cool down so I can cook pasta without heatstroke"}
{"label": "NOT_SARCASM", "text": "seeing a lot of hot takes about the weather today"}
{"label": "SARCASM", "text": "@Deus_Bolt Not to be rude but fuck you"}
{"label": "NOT_SARCASM", "text": "@muse I’m in love with you"}
{"label": "NOT_SARCASM", "text": "@goodnightmrtoe Maybe they just say it on accident"}
{"label": "NOT_SARCASM", "text": "Heads up! My tweets for the next few minutes will be part of a live Twitter chat for my #JMC4412 class."}
{"label": "NOT_SARCASM", "text": "this is fake https://t.co/p01GoeaiHE"}
{"label": "NOT_SARCASM", "text": "Our schools should not have a death rate"}
{"label": "NOT_SARCASM", "text": "Do ppl not realize how long IUDs and Nexplanon last?? Up to THREE YEARS. If u think that we’re going to get it remo… https://t.co/38cHgLaaJa"}
{"label": "SARCASM", "text": "I can't wait for the 2020 presidential election to be between two old white dudes."}
{"label": "NOT_SARCASM", "text": "It makes me happy that the economy is doing well so people are no longer forced to stay at shitty jobs. I will neve… https://t.co/1gNQvCzANJ"}
{"label": "NOT_SARCASM", "text": "Man I know I’m late to the party but I’m officially obsessed with @lizzo."}
{"label": "NOT_SARCASM", "text": "The CFP for a medieval studies conference at St Andrews from 7-9 June 2018 is still open until 24th March! A keynot… https://t.co/QkAtMh4R0W"}
{"label": "NOT_SARCASM", "text": "I never watched The Nanny during it's original CBS run, but have become addicted to the late night @COZITV reruns as of late."}
{"label": "NOT_SARCASM", "text": "#itrieditsoyoudonthaveto - the infamous @coolhaus limited edition French's Mustard ice cream. The verdict - the mus… https://t.co/hdeBMfvFJd"}
{"label": "NOT_SARCASM", "text": "Wonder why DD won’t telecast test matches featuring Indian team, are they not covered by 2007 law? Or it just becau… https://t.co/T3cTVRtlih"}
{"label": "NOT_SARCASM", "text": "@falamb3 @DrNaumanNiaz @iRashidLatif @shashidigital kudos to entire team of “Game on hai show”, Great pre/post matc… https://t.co/q0ERQEfwQL"}
{"label": "NOT_SARCASM", "text": "Bronchitis almost gone. Figure out my leg pain I should be back to running regularly.#RunnerProbs"}
{"label": "NOT_SARCASM", "text": "Congrats @Megadeth @DaveMustaine on Grammy. Long time coming🤘🏻"}
{"label": "SARCASM", "text": "Someone dies and suddenly everyone wants to suck them off."}
{"label": "NOT_SARCASM", "text": "@discordapp Can you make it so that the \",@role\" feature is overwritten by users with the admin tag, that way admins… https://t.co/NhCCE5pOKR"}
{"label": "NOT_SARCASM", "text": "@humble Any chance of another D&amp;D 5e book bundle soon? Missed the last few."}
{"label": "NOT_SARCASM", "text": "A healthy reminder for us to never give a hoot about wack shit, son. We must rid the world of hoots, son. Straight up."}
{"label": "SARCASM", "text": "ending part 1 of your video accusing someone of assaulting you with \"500 LIKES FOR PART 2!!!\" seems really legit and not at all fucked up..."}
{"label": "NOT_SARCASM", "text": "I just need to say that if you really think the only issue people have with the writing on GoT is the Daenerys stor… https://t.co/po6k399BFY"}
{"label": "NOT_SARCASM", "text": "Just voted! If you haven't voted yet PLEASE go out and do it. I know the weather is crappy, but this election is SO… https://t.co/RT2jhOiTuc"}
{"label": "SARCASM", "text": "YouTube's processing system is an absolute mystery to me. It zooms through the processing on an unedited vod but ge… https://t.co/DlMZA7sO7y"}
{"label": "NOT_SARCASM", "text": "Is garlic bread technically Italian toast? Like French toast but with garlic and savory stuff instead of sweet pastry ingredients 🤔"}
{"label": "NOT_SARCASM", "text": "Wow I don't know if it's mobile twitter or this new layout but this looks awful lmao"}
{"label": "NOT_SARCASM", "text": "Finally getting the Oculus Rift S set up, super hype to stream some VR stuff tonight."}
{"label": "NOT_SARCASM", "text": "@TehDullahan @wuzzbae She seems sassy and mean and I already love her"}
{"label": "NOT_SARCASM", "text": "@TDM_Jesus YIKES @PhantomL0rd really expects to get any money? OmegaLUL"}
{"label": "SARCASM", "text": "my guess is the twitter algorithms just hate me"}
{"label": "NOT_SARCASM", "text": "inspired by the blackhole image that's been in the news. 160x200, 10 colors, made in aseprite. https://t.co/yPM7wZ501Y"}
{"label": "NOT_SARCASM", "text": "i just watched this huge video on the ultima series: https://t.co/tOV9SZdAXZ -- @manwhohatesfun have you seen this vid?"}
{"label": "NOT_SARCASM", "text": "learned my first 360 drop today!!! https://t.co/Wk75PFHxtN"}
{"label": "NOT_SARCASM", "text": "I’m not going to lie, but I HATE when people try to argue that the cost of college is justified and make comments t… https://t.co/fVDeXlml3x"}
{"label": "NOT_SARCASM", "text": "Amazing how much more organised the players look going back to familiar tactics. Hope we can nick another in the second on the counter #NUFC"}
{"label": "NOT_SARCASM", "text": "Should Nadal win in three it would be the first time in 15 years (2002-2004) that three consecutive US Open men's f… https://t.co/CVl8eVFOYa"}
{"label": "NOT_SARCASM", "text": "Nadal in the first game - hits a great winner  -gets a time violation -saves a break point -says to umpire his time… https://t.co/3yuEaPNw7x"}
{"label": "SARCASM", "text": "\"Your 15-minute timer has 364 weeks, 6 days, 22 hours, 14 minutes and 2 seconds remaining.\" Thanks, #GoogleHome 🙄"}
{"label": "NOT_SARCASM", "text": "Whoops! I can't reset my password because I left my first name blank (an empty string). Now whatever I attempt to s… https://t.co/VEZCa7jVmL"}
{"label": "NOT_SARCASM", "text": "I need to find some way of tagging / organising cables... I've wasted the last 40 minutes trying to find one 😕"}
{"label": "NOT_SARCASM", "text": "Is it my imagination or is AVG anti-virus steadily becoming more intrusive?"}
{"label": "SARCASM", "text": "Science may yet produce an answer to Anne Widdecombe #lgbt #annewiddecombe"}
{"label": "NOT_SARCASM", "text": "The amount of people who don't know what #FreeSpeech actually means is quite frightening."}
{"label": "NOT_SARCASM", "text": "Anyone know a free version of a vinyl cutting software like SignCut?#GraphicDesign #technology #software"}
{"label": "NOT_SARCASM", "text": "By walking, I found out where I was going. ~ Irving Layton   #quotes #quoteoftheday"}
{"label": "NOT_SARCASM", "text": "http://t.co/iXoGSfibGV   This is my referral link.  I'm doing really well.  If you are interested, please use this link cos it'll help me"}
{"label": "NOT_SARCASM", "text": "I've just entered to #win a holiday to Barbados enter here: http://t.co/q7A0PWkDnF #GemporiaValentinesGetaway via @Gemporia @SandalsResorts"}
{"label": "NOT_SARCASM", "text": "Check out this 3 bedroom bungalow for sale on Rightmove  https://t.co/PCIRkfXsTK"}
{"label": "NOT_SARCASM", "text": "Absolutely loving the Liverpool flags all over the city. Pure joy everywhere, what a buzz. 4 more sleeps!!! 🙌😬🎉"}
{"label": "NOT_SARCASM", "text": "Brenè Brown might have just dented my defence. What a show! #CallToCourage 👌👏👏"}
{"label": "SARCASM", "text": "Beautiful day"}
{"label": "NOT_SARCASM", "text": "#LetsUnlitterUK be a good role model to your children UseThe Bin!!!"}
{"label": "NOT_SARCASM", "text": "Still not smoking.#Gotacoupon#NICORETTE #StopSmokingStartLivingHealthy"}
{"label": "NOT_SARCASM", "text": "I do all the washing up x https://t.co/JxUMHuT9SD"}
{"label": "NOT_SARCASM", "text": "BBC News - 10 charts on what happens after GCSEs https://t.co/HScwvsyEMY"}
{"label": "NOT_SARCASM", "text": "View from ⁦@pborocathedral⁩ across the #Nene to #Flettonquay #development https://t.co/TGpp9hrnKL"}
{"label": "NOT_SARCASM", "text": "A great book which is also a seat ⁦@PeterboroughCC⁩ reception #BrickLane #Peterborough https://t.co/XlzdqVuLJh"}
{"label": "NOT_SARCASM", "text": "So ready to day drink today 💃🏼 👽"}
{"label": "NOT_SARCASM", "text": "I’ve got such a guilty pleasure for the jonas brothers lol take me back to 2009"}
{"label": "NOT_SARCASM", "text": "27 million people are enslaved in the world. 80% are sold into sexual slavery. 14,500-17,500 are trafficked http://t.co/xK9mJRG6"}
{"label": "NOT_SARCASM", "text": "awesome actress n activist for human trafficking! someone I admire for the work she's done and is doing with Somaly Mam http://t.co/25BW9vGY"}
{"label": "NOT_SARCASM", "text": "Couple Accused of Keeping 12-Year-Old Undocumented Mexican Girl As Their Sex Slave http://t.co/uQxdxeX9 via @laist"}
{"label": "NOT_SARCASM", "text": "Big game companies have not and will not ever care for the mobile market stay woke"}
{"label": "NOT_SARCASM", "text": "@_andreita64 Round 1 is like a club but for nerds-"}
{"label": "NOT_SARCASM", "text": "How To Custom Diecast Cars https://t.co/togXysTgER via @YouTube"}
{"label": "SARCASM", "text": "My coworkers didn’t tell me that today was skip day and now I’m alone at work https://t.co/LibxogBs0H"}
{"label": "NOT_SARCASM", "text": "how it feels to be @USFFootball https://t.co/ksXAzo6B3L"}
{"label": "NOT_SARCASM", "text": "This kid tho 😍 https://t.co/HIL9S2irRh"}
{"label": "NOT_SARCASM", "text": "So cute! Ordering now @alyssahxox @ablessedbean https://t.co/r3DAi3L6CE"}
{"label": "NOT_SARCASM", "text": "Nothing and I love it! https://t.co/EPAz5pUXm7"}
{"label": "NOT_SARCASM", "text": "Hahaha! https://t.co/2z6QawsJyb"}
{"label": "NOT_SARCASM", "text": "Wow! https://t.co/AN0mSvJVET"}
{"label": "SARCASM", "text": "another easy point for west ham v liverpool"}
{"label": "NOT_SARCASM", "text": "I am watching Arrow #TelfieApp GOOD #Arrow https://t.co/2LTGKB1MhD"}
{"label": "NOT_SARCASM", "text": "https://t.co/MihyZXkKSU"}
{"label": "NOT_SARCASM", "text": "https://t.co/4LoEvAmP38"}
{"label": "NOT_SARCASM", "text": "Happy birthday scarlett 8 today x x x"}
{"label": "NOT_SARCASM", "text": "Lily-mae's  barbie  &amp; ken  party x x http://t.co/GmKrlaH890"}
{"label": "NOT_SARCASM", "text": "Princess lily-mae's party x x http://t.co/9XzgYpkMeX"}
{"label": "NOT_SARCASM", "text": "Having a relaxing Sunday on the best bingo site #bluejackpotballs .. V2retro"}
{"label": "NOT_SARCASM", "text": "#WIGIGWIN @Morrisons I have my neices christening this summer and im her god parent #proudauntie"}
{"label": "NOT_SARCASM", "text": "I’d like to make Spicy Grilled Corn with @minnysazza https://t.co/TBlI6MLNug #SummerofLocal"}
{"label": "NOT_SARCASM", "text": "It has been one interesting evening, to say the least."}
{"label": "NOT_SARCASM", "text": "The turtle crossing the road video on the weather channel is INTENSE!!! They keep replaying it. Go turtle go!"}
{"label": "NOT_SARCASM", "text": "\"You don't ever catch the dragon!\""}
{"label": "NOT_SARCASM", "text": "@CGTNOfficial What technology is taking over. Lets see if this is used for the better of #humanity GodBless The World"}
{"label": "NOT_SARCASM", "text": "@official_ckm much success to you guys in 2019 and beyond!!!"}
{"label": "SARCASM", "text": "@Morning_Joe LOL. I see U have your resident race baiter @esglaude on today. Where is your unbiased Historian… https://t.co/F3FSCt4wN2"}
{"label": "NOT_SARCASM", "text": "Not even 10 minutes into the @Morning_Joe show and @JoeNBC already starting with Hitler references! LOL. #MAGA… https://t.co/cCBEuVDTFa"}
{"label": "NOT_SARCASM", "text": "I saw the video - the London cops dragging Julian Assange out of the embassy. Anger and sadness at this metaphor of… https://t.co/KKMnTp7GeR"}
{"label": "NOT_SARCASM", "text": "A little fact. Balochi or Shirvan and Karabakh persian area carpets with hemp fibers and Rugman area wool. Selectin… https://t.co/WaZ4VoP0Ns"}
{"label": "NOT_SARCASM", "text": "canoeing and football are super for your heart These sports are all fine and good. But synchronized swimming helps… https://t.co/kjwLE8cBaq"}
{"label": "NOT_SARCASM", "text": "Grats to #TeamLiquid in winning #ESLOneCologne2019 !!!! Let's GO NA"}
{"label": "NOT_SARCASM", "text": "#PokemonMasters is out lesssssgooo"}
{"label": "NOT_SARCASM", "text": "#vainglorywinter @vainglorygame Love Koshka. Though basic and easy to play, she is very fun :). Her ultimate too OP!"}
{"label": "SARCASM", "text": "@DianaTourjee sadly all of my binders are in the wash, so the subversive shirtless photo is out. if you're not too… https://t.co/QpRdL2Xat6"}
{"label": "NOT_SARCASM", "text": "To my neighbors who are about to witness me duct-taping clear plastic garbage bags where my car window used to be:… https://t.co/wnfbQYWord"}
{"label": "NOT_SARCASM", "text": "We can demand fair labor practices from online retailers without harming disabled folks who rely on these services… https://t.co/k5btSRuYew"}
{"label": "NOT_SARCASM", "text": "I have exactly one assignment left until I am officially finished with school. Like, forever."}
{"label": "SARCASM", "text": "#EveryRealHousewifeNeeds A Househusband to 'help out' https://t.co/0jtIyBdHjx"}
{"label": "NOT_SARCASM", "text": "It was mayhem!🤣🤣...Oh and by the way I can vouch for Ali's sausage!!. get there before it all goes...there isn't mu… https://t.co/Y5fDxT8kc7"}
{"label": "NOT_SARCASM", "text": "It's so true its not really even funny! https://t.co/QCGkWPVyQ3"}
{"label": "NOT_SARCASM", "text": "@YamaEmilie Maybe it needs a little work 😂 But yeah it's cool :)"}
{"label": "NOT_SARCASM", "text": "@ShannonTwoTimes Never doubted you 😂 Thanks, better change the bio now"}
{"label": "SARCASM", "text": "me, in the very begining stages of creating one (1) piece of merch: yeah what cons are coming up near nyc i should def table"}
{"label": "NOT_SARCASM", "text": "i still wanna draw... lanfan misaki &amp; ling kokoro..."}
{"label": "NOT_SARCASM", "text": "happy (late) birthday moca!!! #青葉モカ生誕祭2019 #青葉モカ #bandori https://t.co/HUb79rD4DK"}
{"label": "NOT_SARCASM", "text": "polteageist looks like a little troublemaker but also a friend"}
{"label": "NOT_SARCASM", "text": "It has been a rough decade for Detroit sports teams #lions #tigers #pistons #redwings"}
{"label": "NOT_SARCASM", "text": "It’s nice seeing the Warriors lose #NBAFinals2019"}
{"label": "NOT_SARCASM", "text": "So thankful Oberon is back! #blessed"}
{"label": "SARCASM", "text": "about to hit the studio with my man @richchigga 🔥👀😈"}
{"label": "NOT_SARCASM", "text": "17 is a masterpiece. thank you @xxxtentacion"}
{"label": "SARCASM", "text": "@EricWorden_ @IGN @Sony Yup, that 856M box office for Venom is rough."}
{"label": "NOT_SARCASM", "text": "@NameIsAlfonzo @bpinalone @ImJustMtn @KEEMSTAR Yeah dude he chokes the dog and then the dog is chilling but goes ba… https://t.co/fGnQuETLPc"}
{"label": "NOT_SARCASM", "text": "@Silentkiller525 @SteelersKC90 @IGN Lmao how is sony being greedy? Some blind hatred going on here."}
{"label": "NOT_SARCASM", "text": "@innocents__ @Ninja @stevenfit20 @FaZeSway @FortniteGame The point is that you won't push because you know it's him… https://t.co/ZiP9JcLcj1"}
{"label": "NOT_SARCASM", "text": "Please help!!!!! I really would love to start learning sign language, if anyone has any tips/websites/blogs/YouTube… https://t.co/rd50O4afHz"}
{"label": "NOT_SARCASM", "text": "My dog met an identical pup version of himself at the beach earlier, they even had the same haircut, and they both… https://t.co/dsKkLxWHnV"}
{"label": "NOT_SARCASM", "text": "I live in fear for the day early 2000s fashion makes a comeback"}
{"label": "SARCASM", "text": "Ahhh the anti-trans lot are showing themselves to be very caring and thoughtful again, I see. https://t.co/0LI0lWnDas"}
{"label": "NOT_SARCASM", "text": "Sex education in particular should be inclusive and recognise that not all relationships look the same and not all… https://t.co/t6ifqPfxbG"}
{"label": "NOT_SARCASM", "text": "Accessibility is a need not a preference."}
{"label": "NOT_SARCASM", "text": "@finntipp I'm really upset and anxious."}
{"label": "NOT_SARCASM", "text": "Watched all available episodes of #Fleabag can’t wait for the next episode!"}
{"label": "NOT_SARCASM", "text": "Possibly the most inspiring Conference I’ve attended #asclcare"}
{"label": "SARCASM", "text": "@EllaBroBella This is the sort of high-quality content that I followed you for. Keep up the good work!"}
{"label": "NOT_SARCASM", "text": "Had a slight computer issue. Found a forum post of the same issue where the user eventually fixed it themselves. They posted their solution."}
{"label": "NOT_SARCASM", "text": "Thanks to everyone for coming by to the stream! Hopefully @HammerToTheFace can get his game sorted so he can join us for longer next week!"}
{"label": "NOT_SARCASM", "text": "My phone battery managed to die exactly at midnight. I hope that's not an omen for what 2017 has in store for us..."}
{"label": "NOT_SARCASM", "text": "Not bad imo #ACT https://t.co/hUxSjvUBVo"}
{"label": "NOT_SARCASM", "text": "\"Thou vanishest!\" Probably the best line so far #JuliusCaeser https://t.co/OGOoNODJKh"}
{"label": "NOT_SARCASM", "text": "Can't believe there was a time snooker wasn't part of my life, thanks @_DickyTicker_"}
{"label": "NOT_SARCASM", "text": "Saturday the 6th of October. I am fired up. Let's go."}
{"label": "NOT_SARCASM", "text": "Unrelated to anything I normally post about - I am trying to paint small enclosed rooms with little ventilation pos… https://t.co/EjjDcRZjkm"}
{"label": "NOT_SARCASM", "text": "the #WWESuperCard spreadsheet exists. wanna see pics? we got it. wanna see stats? we got it. wanna see stamina? we… https://t.co/20SlkTqcSp"}
{"label": "NOT_SARCASM", "text": "what should be happening: sleep  what did happen: spreadsheet update/prep for new tier  why so late? because I was… https://t.co/2Ur1oAtVF4"}
{"label": "NOT_SARCASM", "text": "remember the #WWESuperCard spreadsheet?  it updated once again  https://t.co/Sq593Pn4vn  go help out, check out stats, whatever. retweet!"}
{"label": "NOT_SARCASM", "text": "Beautiful day"}
{"label": "NOT_SARCASM", "text": "@ballerinalovely delete! Delete! Delete!"}
{"label": "NOT_SARCASM", "text": "@Kiki_Cesyy This is how I know http://t.co/MsfTSlNg"}
{"label": "NOT_SARCASM", "text": "@MikeM27076225 @cvpayne @realDonaldTrump Finally someone with some common sense! #MAGA2020 #hillaryforprison"}
{"label": "NOT_SARCASM", "text": "After these recent shootings we need to give civilians more guns to kill these mentally ill people! #MAGA2020"}
{"label": "NOT_SARCASM", "text": "@WhoseBacon @AngelaBelcamino DONALD IS OUR PRESIDENT YOU DUMB CANADIAN! KEEP talking and we are gonna build a wall… https://t.co/hjRBRmyeXI"}
{"label": "SARCASM", "text": "I love shopping at walmart late at night! There's nothing more entertaining than the people of walmart ;)… https://t.co/cqPdJ4D7oY"}
{"label": "NOT_SARCASM", "text": "Check out what I just added to my closet on Poshmark: Coach purse shoulder bag small red Crossbody.… https://t.co/BktXQsXmI4"}
{"label": "NOT_SARCASM", "text": "Say no to ATM fees and funding fossil fuel projects. Get Aspiration and be part of the revolution. Join with my lin… https://t.co/g9H8r4P11E"}
{"label": "NOT_SARCASM", "text": "Reposting @hannahreznich via @NanasShabbyAtTc #nanasshabyattic  I've seen a butterfly every day this week, felt lik… https://t.co/wZtIhwei2J"}
{"label": "SARCASM", "text": "Still, #Mayweather or #Mcgregor ? PLACE YOUR BETS 🎲💥… https://t.co/tp9Kqzwh37"}
{"label": "NOT_SARCASM", "text": "we hope everyone safely got a glimpse of todays #eclipse! it was #beautiful, like #poetry: #williamshakespeare… https://t.co/2MnBuZpUZG"}
{"label": "NOT_SARCASM", "text": "HAPPY INTERNATIONAL YOGA DAY! From Autobiography Of A Yogi, by Paramahansa Yogananda.… https://t.co/VHsLfu4IBe"}
{"label": "NOT_SARCASM", "text": "Which #author have you read the most #books by? I absolutely love books by @ahoffmanwriter @paulocoelho and… https://t.co/GIU2fvsGia"}
{"label": "NOT_SARCASM", "text": "You are responsible for your own happiness."}
{"label": "SARCASM", "text": "I'm so proud that I found my butterbeer mug from Harry Potter world in 2014 for this whiskey. Feel like a legit the… https://t.co/g3woQuO1Q0"}
{"label": "NOT_SARCASM", "text": "Joe Burrow looked great, he really benefited from that new coach they picked up from the Saints. But I’m not going… https://t.co/ro4p1MRrQY"}
{"label": "NOT_SARCASM", "text": "NO HITTER GO ASTROS"}
{"label": "NOT_SARCASM", "text": "Hey guys its Jered from work are we in fairhaven or BT?"}
{"label": "NOT_SARCASM", "text": "@Calleywalkr badminton is important"}
{"label": "NOT_SARCASM", "text": "Ok"}
{"label": "NOT_SARCASM", "text": "Stop placing so much importance on a clean house. Take care of yourself and enjoy your family. A clean house isn't… https://t.co/pF7nWHyBah"}
{"label": "NOT_SARCASM", "text": "Being a mom means having either a @thewiggles or @badanamu song stuck in your head. At. All. Times. Good thing I lo… https://t.co/2DcUp5Ylgi"}
{"label": "NOT_SARCASM", "text": "Throwback to when they all got along and didn't get such pleasure out of terrorizing each other. I love these crazy… https://t.co/08iD2VUnTb"}
{"label": "SARCASM", "text": "@MrBeastYT Proud to be part of the 0.1% 🙃"}
{"label": "NOT_SARCASM", "text": "Pure https://t.co/sYPM7XQeMT"}
{"label": "NOT_SARCASM", "text": "i spilled all my tea and now i burnt my leg and it really really hurts"}
{"label": "NOT_SARCASM", "text": "you grow up, work half a century, you get a golden handshake, you rest a couple of years then you're dead... the on… https://t.co/BgdOauq47I"}
{"label": "NOT_SARCASM", "text": "LIFE ADVICE:  it is better to be at the bottom of a ladder you wanna climb than halfway up one you don't"}
{"label": "SARCASM", "text": "so ice cream's supposed to be a drink, right?"}
{"label": "NOT_SARCASM", "text": "just in case anyone wasn't aware yet, over the next month there's gonna be legal adults that aren't even as old as the gamecube"}
{"label": "NOT_SARCASM", "text": "tree tops never gets any easier no matter how many times I play this game"}
{"label": "NOT_SARCASM", "text": "a moth invaded my room just to lay down and die on my desk"}
{"label": "SARCASM", "text": "Nowt worse than people on #prolific who set their surveys to “desktop only” gr8888 now I have to find my laptop and… https://t.co/OPaCr2WPYq"}
{"label": "NOT_SARCASM", "text": "I cried this morning because Ant had to go to work. Wtf are you doing Lucy get a grip"}
{"label": "NOT_SARCASM", "text": "I honestly feel like I support literally everyone in what they do for very little back. Most would call me a mug an… https://t.co/JeN3zXBaN4"}
{"label": "NOT_SARCASM", "text": "Bit the bullet and took the chat for the bizarre job. Sounds like an amazing opportunity and I really hope they cal… https://t.co/YVN1JzeZvm"}
{"label": "NOT_SARCASM", "text": "disney has ran out of ideas to steal so now they're stealing their own ideas and turning them into live action films  it's mental"}
{"label": "NOT_SARCASM", "text": "slowthai makes me wish I was a Brit"}
{"label": "NOT_SARCASM", "text": "Got sidetracked on YouTube  Stumbled onto compilations of dudes crying on The Bachelorette  Why do ya'll watch this, this is depressing lmao"}
{"label": "SARCASM", "text": "some old man told me at work that he knows im montanan cause i say “yup”.  you heard it here first, you can only sa… https://t.co/9tO8jMkQ2Z"}
{"label": "NOT_SARCASM", "text": "i think that ‘bunnyhug’ is a waaay better word than ‘hoodie’ and i wish it was used everywhere in the world and not just canada"}
{"label": "SARCASM", "text": "#SingleBecause I’ll never find a man I love as much as Brian McCann"}
{"label": "NOT_SARCASM", "text": "#ThatAwkwardMoment when you’re finishing your bottle of mini m &amp; ms and you notice the  expiration date says 1/2018 🙃"}
{"label": "NOT_SARCASM", "text": "Please don’t let it be true that @tacobell is getting rid of cool ranch Doritos locos tacos 😩"}
{"label": "NOT_SARCASM", "text": "“I was glad when they said unto me, Let us go into the house of the Lord.” Psalms 122:1 #HappySunday 🙏🏻"}
{"label": "NOT_SARCASM", "text": "Heroes come in all kinds of places.  My dad, age 70, biking the Danube with friends. I hope I can do the same, life… https://t.co/RJIcVLtZBx"}
{"label": "NOT_SARCASM", "text": "Listening to the unprofessional Richmond station tonight was absolutely painful.  @Bradfield323 needs to offer the state some assistance."}
{"label": "NOT_SARCASM", "text": "Noblesville Sectional championship game has sold out for HSE v. Camel.  #IHSAA"}
{"label": "NOT_SARCASM", "text": "Happy 151st birthday to Dr. James Naismith."}
{"label": "SARCASM", "text": "Walk from Iowa to Nebraska only took 18 minutes! #jacks"}
{"label": "NOT_SARCASM", "text": "Time to upgrade RAM in MacBook! #crucial #2to8gb http://t.co/pM9rxKR8Rf"}
{"label": "NOT_SARCASM", "text": "Finally! After installing two operating systems on my Mac, I'm finally up to date and can sync my phone with iTunes! #nerd #nomoreleopard"}
{"label": "NOT_SARCASM", "text": "Just Rick Roll'd by Pandora. #RickAstley"}
{"label": "NOT_SARCASM", "text": "Klay. Only reason W's still in this."}
{"label": "NOT_SARCASM", "text": "KAT needs to be 1st team all NBA. Best C in the league"}
{"label": "SARCASM", "text": "BOY O LOVE BEING FOREVER IN DEBT. THANKS PREDATORY LENDING."}
{"label": "NOT_SARCASM", "text": "The fact that Metal Wold Chaos isn't releasing tomorrow is a travesty."}
{"label": "NOT_SARCASM", "text": "I think the hardest part of Mario Maker levels is not letting the music drive you insane."}
{"label": "SARCASM", "text": "WE INVITE YOU TO BECOME A PART OF SPAIN https://t.co/PvbUadoVg8"}
{"label": "NOT_SARCASM", "text": "Check out Saffron Road on Makeena and earn rewards! Use my referral code for bonus points. #SaffronRoad https://t.co/utVbvfyX0X"}
{"label": "NOT_SARCASM", "text": "Love the way these Downy unstoppables smell in my washing machine. It’s all you need for #FeisyFreshness. Doing lau… https://t.co/0RXx1s7Q41"}
{"label": "NOT_SARCASM", "text": "Earn a $200 Disney Gift Card with the Disney® Visa® Card.  No annual fee. I can be rewarded, learn more.… https://t.co/cMpD0NhgpD"}
{"label": "NOT_SARCASM", "text": "TFW when you reload your laptop and are so proud of yourself for having everything saved from the old OS ..... except for /etc/hosts. 😡😡"}
{"label": "SARCASM", "text": "Fun Fact!: Tails loves cock and ball torture! #themoreyouknow #funfact #sonic"}
{"label": "NOT_SARCASM", "text": "I voted for #TeamSonic on @TyltGeek—'Sonic the Hedgehog’ is the video game film I want to see https://t.co/Hfe9diTgIY"}
{"label": "SARCASM", "text": "i can’t find my earbuds anywhere. please kill me"}
{"label": "NOT_SARCASM", "text": "Nothing brings two people together like finding out you and someone else are really annoyed by the same person."}
{"label": "NOT_SARCASM", "text": "Drawing these sketches has made me realize how many theatre kids wear glasses..."}
{"label": "NOT_SARCASM", "text": "it’s just one of those nights where i’m laying in bed and thinking about all the embarrassing, dumb shit i’ve done"}
{"label": "NOT_SARCASM", "text": "@8pts9secs hell yes."}
{"label": "SARCASM", "text": "trying to get excited for biden to win the nomination by watching handmaids tale"}
{"label": "NOT_SARCASM", "text": "i fell asleep until 10:00 spanish time and all the good restaurants are just now opening. this is the greatest country in the world"}
{"label": "NOT_SARCASM", "text": "this seems like a good time to admit that i’ve never listened to sufjan stevens... no idea what that dude sounds li… https://t.co/azpJPLgdyK"}
{"label": "SARCASM", "text": "love that I finally left my house early to get to uni well before I need to until I realise I forgot my bus pass and locker key :)))"}
{"label": "NOT_SARCASM", "text": "probs a good thing that i don't have a car anymore considering i haven't been out to spend all of the money i don't… https://t.co/AEuq0AeuC4"}
{"label": "NOT_SARCASM", "text": "watching trams drive past in Nottingham are like when cattle are being moved across the road and you sit there in y… https://t.co/agC90bqu29"}
{"label": "NOT_SARCASM", "text": "at least from poverty I've learned to get drunk for less than a fiver 🤪"}
{"label": "SARCASM", "text": "Just earned 5 bounts for being fit and healthy. Start earning now #bounts #JoinThePros"}
{"label": "NOT_SARCASM", "text": "Petition: Stop the privatisation of NHS services https://t.co/QLxSY3GeKr"}
{"label": "NOT_SARCASM", "text": "Thx @Argos_Online had bed &lt;3yrs, fixings always dodgy, collapsed once before now completely broken. Expensive waste… https://t.co/bxfcVPvWPm"}
{"label": "NOT_SARCASM", "text": "Awesome service on the @GWRUK #Pullman as usual. 😊 #tasty Fab service from Simon in particular! 👍🏼 https://t.co/n2rDVwOSik"}
{"label": "NOT_SARCASM", "text": "All this talk of weddings....😍💓❤️ @liam_mcaulay https://t.co/lIUga49L8j"}
{"label": "SARCASM", "text": "Great, now I have a fractured rib. ¯\\_(ツ)_/¯  My life is falling apart."}
{"label": "NOT_SARCASM", "text": "If my doctors could please hurry the FUCK up and tell me why I'm continually having severe allergic reactions every… https://t.co/6Eq9DMBlHM"}
{"label": "NOT_SARCASM", "text": "My eyes are so red from a lack of sleep that my boss insinuated that I was high"}
{"label": "SARCASM", "text": "talents: making a joke of myself by crying in front of class"}
{"label": "NOT_SARCASM", "text": "I wonder if next semester if I could convince my film teacher to let me do an animation short by myself, , hmmm"}
{"label": "NOT_SARCASM", "text": "Why is it that whenever I forget my camera something really cool happens?"}
{"label": "NOT_SARCASM", "text": "In memory of beautiful Mercedes who passed away July 27, 2019. I miss her more than anything. Artist credit (@)desi… https://t.co/Rlj1SUMIoD"}
{"label": "NOT_SARCASM", "text": "Gave my kitty breakfast with a view - lactose free milk of course #CatsOnTwitter https://t.co/xj3ZNzl090"}
{"label": "NOT_SARCASM", "text": "sweetest face I’ve ever seen. #mercedes ♥️🐈🌸🌻🍀🌎🔮 https://t.co/HjB7ey8N8V"}
{"label": "SARCASM", "text": "thrilled to announce that no one wants to touch the new phones we got at work! Or go to the training session!  igno… https://t.co/ji3700PPqW"}
{"label": "NOT_SARCASM", "text": "sometimes your only vegetable is going to be a bloody mary and that’s okay."}
{"label": "NOT_SARCASM", "text": "thank you sixers AND game of thrones for absolutely ruining my sunday night.  what a waste."}
{"label": "SARCASM", "text": "True rebellion in college is taking more than the recommended dosage of gummy vitamins"}
{"label": "NOT_SARCASM", "text": "I got a bagel sandwich at KSA instead of Crane Cafe and I should have known that I would be disappointed"}
{"label": "NOT_SARCASM", "text": "Finally regaining touch with reality post-finals and I formally apologize to anyone who interacted with me during that dark time"}
{"label": "NOT_SARCASM", "text": "WOW, what an amazing gaming accomplishment for the history books, just wow wow wow! Congrats to @The_Happy_Hob for… https://t.co/rA56wpYhFi"}
{"label": "NOT_SARCASM", "text": "20 MINUTESSSSSSSSSSSSSSSSSSSS!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! KH3333333333333"}
{"label": "NOT_SARCASM", "text": "Ghetto jump alternative: https://t.co/cwLBNnFcKk via @YouTube"}
{"label": "SARCASM", "text": "Adulthood is basically just flirting your way to a cheaper oil change."}
{"label": "NOT_SARCASM", "text": "The Shrek soundtrack is honestly the hottest playlist I’ve ever listened to. “My Beloved Monster and me” is such a gd bop."}
{"label": "NOT_SARCASM", "text": "I would like another season of Narcos now.   Thanks"}
{"label": "NOT_SARCASM", "text": "Heavens to Betsy, the only getting me through today is the fact that I'll get to see my pooch tonight."}
{"label": "SARCASM", "text": "I hate cars"}
{"label": "NOT_SARCASM", "text": "doing work, son."}
{"label": "NOT_SARCASM", "text": "back to orlando!"}
{"label": "NOT_SARCASM", "text": "my belt is holding my pants but my belt loops are holding my belt.. who is the real hero?"}
{"label": "NOT_SARCASM", "text": "Raise your hand if your biggest regret is growing up"}
{"label": "NOT_SARCASM", "text": "Have you ever been so tired that you got irritated by the sound of a bird happily chirping?"}
{"label": "NOT_SARCASM", "text": "My favorite thing about work is when I get to leave"}
{"label": "SARCASM", "text": "Do I get a girl scout badge for getting punched in the tit by some raging dude wearing sunglasses in the pit of a basement hip hop show?"}
{"label": "NOT_SARCASM", "text": "Anyways so when do I get to be an artist instead of a full time mentally ill person"}
{"label": "SARCASM", "text": "new diet idea:  eat nothing but vegetable lo mein.  if it isn't lo mein, don't bother"}
{"label": "NOT_SARCASM", "text": "the guy i always buy my smoothies from in the mall was super rude to me today and i don't know why? like i'm a loyal customer?"}
{"label": "NOT_SARCASM", "text": "😩  #narcolepsy is killing me lately.  💤💤💤"}
{"label": "NOT_SARCASM", "text": "I meet the most interesting people on my cigarette breaks.  :)"}
{"label": "NOT_SARCASM", "text": "I pack food that isn't a sandwich for once for my 1.5 hour break between classes and of course the class i have before the break is canceled"}
{"label": "NOT_SARCASM", "text": "sad because bad"}
{"label": "NOT_SARCASM", "text": "it's going to be another 7-1"}
{"label": "SARCASM", "text": "So I'm currently stuck in an automatic revolving door."}
{"label": "NOT_SARCASM", "text": "This is Gale. A stray cat I met in Detroit. https://t.co/hzZJzbg3fJ"}
{"label": "NOT_SARCASM", "text": "Don't tweet often but Lexa deserved better."}
{"label": "NOT_SARCASM", "text": "HUGE PS4 and Xbox One giveaway! Enter here:  https://t.co/GRUqjEVq3x"}
{"label": "SARCASM", "text": "I love when @VZWSupport charges a fee you were told would be waived TWICE 🤔"}
{"label": "NOT_SARCASM", "text": "Maddie thought it was “rice peel off” 😅"}
{"label": "NOT_SARCASM", "text": "Does anyone have any ideas for free or super cheap birthday gathering ideas for like 6 people? We’re gay so nothing outside 😂"}
{"label": "NOT_SARCASM", "text": "I feel like I JUST turned 30 a few months ago, but I’ll be 31 tomorrow... 🤯 The aging can feel free to slow down at any time, thanks"}
{"label": "NOT_SARCASM", "text": "my stepdad is awake and getting ready for work at the moment.... I've stayed up all night"}
{"label": "NOT_SARCASM", "text": "Its weird how people float in and out of your life when you least expect it"}
{"label": "NOT_SARCASM", "text": "Steven if you're still out there, I've still got the snorlax you gave me, thanks again"}
{"label": "SARCASM", "text": "Mm, breathing in dust as I clean out stuff. My favorite."}
{"label": "NOT_SARCASM", "text": "Finished the good ol' RE2 demo on the first go.  It was alright, this was my first  RE Engine game I've played, it… https://t.co/kLAap9jOFI"}
{"label": "NOT_SARCASM", "text": "Oh what's this.. Goldfish crackers? Don't mind if I..  c r o m c h"}
{"label": "NOT_SARCASM", "text": "The love i have for my family and my responsibilities day to day #Revlon #LiveBoldy #ColorStay #MatteNoMatterWhat #sponsored"}
{"label": "NOT_SARCASM", "text": "Which hairstyle will you wear in 2019? #Sweeps #GlimmerCommunity https://t.co/fstPE3hQvC"}
{"label": "NOT_SARCASM", "text": "Check this out!! #ad I just joined the #SimpleSolutions Community by ARM &amp; HAMMER™ Baking Soda! Sign up and join th… https://t.co/5hj38HSZM1"}
{"label": "NOT_SARCASM", "text": "Early access for Patrons on tomorrow's review is up! https://t.co/LJBqZg3Fny"}
{"label": "NOT_SARCASM", "text": "Premiering now! Scooby-Doo On Zombie Island (1998) - Movie Review https://t.co/rhwEzj7nSl via @YouTube"}
{"label": "NOT_SARCASM", "text": "LEAVES ARE FALLING HERE THIS IS JOT A DRILL https://t.co/TinoATDDpl"}
{"label": "SARCASM", "text": "i didn't know eds were contagious 🤪 https://t.co/iKosr1ruoY"}
{"label": "NOT_SARCASM", "text": "I was semi productive today 🤠🤙"}
{"label": "NOT_SARCASM", "text": "just finished shooting my lil dudes 2 month photos :o) http://t.co/su0VVP1L"}
{"label": "NOT_SARCASM", "text": "The sky's the limit!!!   living the life I love one adventure at a time!  http://t.co/U6Vq0t62"}
{"label": "NOT_SARCASM", "text": "just in case u mossed it here's a picture of the shuttle flying by.... http://t.co/CFqJ0HyI"}
{"label": "NOT_SARCASM", "text": "I uploaded a @YouTube video http://t.co/dq3O1Vnm VID 20120520 124911"}
{"label": "NOT_SARCASM", "text": "Why Repetition is Necessary When Changing Paradigms - Bob Proctor https://t.co/JpxIolTXVm via @YouTube"}
{"label": "SARCASM", "text": "#Siria  At least we didn't attack Syria. Crisis averted..."}
{"label": "NOT_SARCASM", "text": "#GunControlNow  Why do civilians need semi-auto firearms and extended magazines? What use (other than mass shooting… https://t.co/J68qvTJpZI"}
{"label": "NOT_SARCASM", "text": "It's impossible to appreciate how vast the universe is. But this video will help. http://t.co/fnUZtzrKHI via @josephstromberg"}
{"label": "NOT_SARCASM", "text": "Drinking coffee is not a personality trait."}
{"label": "NOT_SARCASM", "text": "Me apologizing to the government after they caught me trying to free my alien homies at Area 51  https://t.co/oefsrEaJzo"}
{"label": "NOT_SARCASM", "text": "A ver aver, cómo que era un terremoto y no parte de la función 4dx 💀"}
{"label": "NOT_SARCASM", "text": "L train's fucking haunted"}
{"label": "NOT_SARCASM", "text": "#justkenjithings @DoubleWitchedUp"}
{"label": "NOT_SARCASM", "text": "BRUH FUCKING MOMENT https://t.co/elIMwZgrc5"}
{"label": "NOT_SARCASM", "text": "@NeilMellor33 who's the most skilful footballer you played with and  against"}
{"label": "NOT_SARCASM", "text": "@alanshearer will Harry Kane get your goals record and Rooneys England record"}
{"label": "NOT_SARCASM", "text": "@carbs646 good luck hope u get a ton of runs next year and u stay fit for good now and even get back in England team"}
{"label": "SARCASM", "text": "Hello Twitter! #myfirstTweet"}
{"label": "NOT_SARCASM", "text": "I hate new twitter layout take it back &gt;:^("}
{"label": "NOT_SARCASM", "text": "Season 9 is a real struggle wow"}
{"label": "NOT_SARCASM", "text": "not really but okay"}
{"label": "SARCASM", "text": "I love nfl ties!"}
{"label": "NOT_SARCASM", "text": "Never been a Nadal fan."}
{"label": "NOT_SARCASM", "text": "We really need to throw everything we can spare at the Bahamas. Great place, great people."}
{"label": "NOT_SARCASM", "text": "That was horse shit! Way to ruin a game refs!!!!"}
{"label": "NOT_SARCASM", "text": "@desandro THIS IS SO HECKIN' COOL https://t.co/iEQ7kLX4kl"}
{"label": "NOT_SARCASM", "text": "@MichaelATX @RepMattSchaefer It hurts how much played himself. https://t.co/L4liOfbrQU"}
{"label": "SARCASM", "text": "i curse the fact that that shit meme makes me laugh everytime"}
{"label": "NOT_SARCASM", "text": "ps4 bdo is straight up about to take all of my money"}
{"label": "NOT_SARCASM", "text": "You ever get those people who outright refuse to do mechanics even after you explain them"}
{"label": "NOT_SARCASM", "text": "@daveatthe996 Wasn't that bad here up in Sebec/Milo. Pretty fast moving storm, I think. Not much wind, either."}
{"label": "NOT_SARCASM", "text": "@GeraldoRivera Why is it ok to body shame men like this?"}
{"label": "SARCASM", "text": "well Americans , prepare to downgrade your house again, soon you will be living in a box ."}
{"label": "NOT_SARCASM", "text": "good job georgia bulldogs !"}
{"label": "NOT_SARCASM", "text": "Discipline is the bridge between goals and accomplishment."}
{"label": "SARCASM", "text": "@dyrSSB 64: Pikachu  Melee: Pikachu Brawl: Pikachu PM: Pikachu  S4: Pikachu Ult: Pikachu   Oh and did I mention tha… https://t.co/wG5aFMeQy2"}
{"label": "NOT_SARCASM", "text": "@NumbNexus Yee we out here ⚡️✨ https://t.co/5tyKvSaSZG"}
{"label": "SARCASM", "text": "@peterfacinelli Kids and horse poo..nothing better!"}
{"label": "NOT_SARCASM", "text": "@ninadobrev it feels good to know other people do this too!"}
{"label": "NOT_SARCASM", "text": "@JaredLeto I am so excited to hear the new stuff!! I can't wait!"}
{"label": "NOT_SARCASM", "text": "W/e else happened today @British_Airways, CliffPrice&amp;Team took care of us phenomenally(BA196 IAH). #MasterofResourcesProbSolvingCommsCustSvc"}
{"label": "NOT_SARCASM", "text": "\"The end of the road is a tough pill to swallow.\" ~ #ryanseacrest on tonight's #idol show. At least he didn't add, \"literally.\""}
{"label": "NOT_SARCASM", "text": "Passed a gal talking on a phone and drinking a soda as she drove...   her moped.  No kidding. I almost turned around to get a pic of her."}
{"label": "SARCASM", "text": "@seanjonesqc We should all be more tolerant, ban all free speech that we don't like and burn books containing 'hate… https://t.co/Dqhz0Z5Y3b"}
{"label": "NOT_SARCASM", "text": "@TIME Liberals have become nothing but humourless NPCs"}
{"label": "NOT_SARCASM", "text": "@washingtonpost What's the daily fake news trump smear today, at least there are a few gullible NPCs who still beli… https://t.co/GMjdjYm8wr"}
{"label": "NOT_SARCASM", "text": "@washingtonpost Leftist authoritarians and the antifa fascists will believe anything that the Deep State tells them… https://t.co/j1hxEL01il"}
{"label": "NOT_SARCASM", "text": "middle aged women are bitchier than most people I know"}
{"label": "NOT_SARCASM", "text": "don't get people who 'accidentally delete' an insta post? it's a 3 step process?? just admit that you want to post another selfie and go"}
{"label": "NOT_SARCASM", "text": "#cgsmemories when Sasha wrote ‘toxic shock syndrome is not a joke’ on the bottom of her yr 8 german reading + liste… https://t.co/hjiL2P19yp"}
{"label": "NOT_SARCASM", "text": "I really don’t get the appreciation I deserve... but i guess that’s okay though."}
{"label": "NOT_SARCASM", "text": "I gained 10 lbs. 😩"}
{"label": "NOT_SARCASM", "text": "I will step up this semester. I will get myself together🤞🏾"}
{"label": "SARCASM", "text": "Proves that @FootballManager really is a real-life football simulator #NUFC https://t.co/x9t4ndsBYb"}
{"label": "NOT_SARCASM", "text": "Bored of all these manager rumors..Viera, Arteta and Gerrard? Are these the guys to replace Rafa or Mo Diame? #NUFC"}
{"label": "NOT_SARCASM", "text": "I don't think the new kit is as bad as everyone is making out. If they changed the color of the sponsor it would lo… https://t.co/qQpOoxHtl5"}
{"label": "NOT_SARCASM", "text": "😍🐶⚽️how can you not love animals and football? https://t.co/PnNGiH2xjn"}
{"label": "NOT_SARCASM", "text": "Libraries are magical."}
{"label": "NOT_SARCASM", "text": "I hate the humidity"}
{"label": "NOT_SARCASM", "text": "Fans in Taiwan stayed up late till 4am (GMT+8) to watch this game! 🏆 Hope @Wimbledon could tag Hsieh Su-Wei’s fan p… https://t.co/2tQTGhmt2y"}
{"label": "NOT_SARCASM", "text": "According to source on site about an hr ago conflicts occurred between the protestors and the police. Police fired… https://t.co/SXxJIeGHPW"}
{"label": "SARCASM", "text": "@rantmaddie1 but that's just like real life!"}
{"label": "NOT_SARCASM", "text": "remember when yahoo took over tumblr in 2013 and said they wouldn't restrict nsfw content on tumblr?  it took 5 years but here we are."}
{"label": "NOT_SARCASM", "text": "first day at new job tomorrow, super excited, a big career step"}
{"label": "NOT_SARCASM", "text": "yakuza 0 is now officially out on steam, so if you haven't played and you're looking to get into the franchise, ver… https://t.co/HSGqxVwjPe"}
{"label": "NOT_SARCASM", "text": "If the Ace of Spades and Chaperone quests required wins instead of kills in gambit, the world would be a much better place."}
{"label": "NOT_SARCASM", "text": "Make Golden Gun Great Again https://t.co/WLxJIzRHYo"}
{"label": "NOT_SARCASM", "text": "Bungie be trolling"}
{"label": "NOT_SARCASM", "text": "Bought to workout  #GX24"}
{"label": "NOT_SARCASM", "text": "#24hourfitness"}
{"label": "NOT_SARCASM", "text": "Working out  #24hourfitness"}
{"label": "NOT_SARCASM", "text": "Let us not seek the Republican answer or the Democratic answer, but the right answer. Let us not seek to fix the bl… https://t.co/OpfRYZNMtD"}
{"label": "NOT_SARCASM", "text": "WE HAVE A GAINT BABY AS PRESIDENT"}
{"label": "NOT_SARCASM", "text": "I respect the office not the man, @realDonaldTrump   I hope to respect both the office and the person holding it in… https://t.co/2e1Nfmgoxv"}
{"label": "SARCASM", "text": "love it when you’re at a meal and your boyfriend brings up an embarrassing time in front of your parents so you go… https://t.co/UxGyV0f0st"}
{"label": "NOT_SARCASM", "text": "think all the clubs hate me can never seem to have a good night! better stick to the raves"}
{"label": "NOT_SARCASM", "text": "how can girls put on a full face of make up on holiday ?!!? I can’t even be bothered to do my eyebrows let alone a full face😂"}
{"label": "NOT_SARCASM", "text": "@AmandaHolden @ITV Beautiful beautiful dress!! &amp;.... Amanda looks stunning in it!"}
{"label": "NOT_SARCASM", "text": "@ScottStapp Oh heck! This is fantastic news!!"}
{"label": "NOT_SARCASM", "text": "@hmvUKHelp Hello! :) I'm looking to pre-order this vinyl (barcode 840588127801) It just says coloured, can you tell… https://t.co/uq9LlQebNs"}
{"label": "SARCASM", "text": "@Max25talbot Dear Max Talbot......you are wearing the WRONG uniform tonight, but i still love you anyway. Sincerely, Not a Flyers Fan"}
{"label": "NOT_SARCASM", "text": "An open letter to Robin Williams...... https://t.co/wwtczE9QMU http://t.co/MYDhowXb92"}
{"label": "NOT_SARCASM", "text": "Happy doodling! #ad From doodles to documents, my #BICGelocity gel pen can do it all! I ❤ the fast-drying ink and s… https://t.co/xBS9Kaunry"}
{"label": "NOT_SARCASM", "text": "Hanging out with patches &lt;3 http://t.co/pYvLQKIlap"}
{"label": "SARCASM", "text": "I love being an anxious mess!!!!!!!"}
{"label": "NOT_SARCASM", "text": "i love my dog"}
{"label": "SARCASM", "text": "it's been fascinating watching an entire generation of nerds try to characterize their depression as a cultural mov… https://t.co/Su1VKWdcm7"}
{"label": "NOT_SARCASM", "text": "Any warren supporters that can explain why they prefer her to bernie? I've been told they're similar and I see her… https://t.co/bHIs2V8xq3"}
{"label": "NOT_SARCASM", "text": "99 times out of 100 when somebody says \"I don't care about politics\" or \"people who take politics seriously are dum… https://t.co/T9nJ380PDc"}
{"label": "NOT_SARCASM", "text": "wow classic is among the comfiest games i've ever played no question"}
{"label": "NOT_SARCASM", "text": "Go home @SkySports you're drunk 🍻🍻 https://t.co/UHejP4NdDC"}
{"label": "NOT_SARCASM", "text": "It's my birthday and my handsome @MarcDonald16 knows me way too well 😍😍 cannot wait to have a look through this bea… https://t.co/NFpjQQsUtG"}
{"label": "NOT_SARCASM", "text": "Good Luck to all Year 7 starting today @Cowleian  My biggest two back together in school again! @QueensCoEURC… https://t.co/E5KJgVRQ2x"}
{"label": "NOT_SARCASM", "text": "Have a great day in Year 2 everyone @QueensCoEURC @MissMuskett @MissHopeQP https://t.co/rhhusxx2M4"}
{"label": "NOT_SARCASM", "text": "Watching Angry Birds 2 @CineStHelens https://t.co/0FVmqCmkrT"}
{"label": "SARCASM", "text": "Are we not even eligible to know what happened to this proposed bill? Is this kept aside due to external pressures… https://t.co/QqNvUQ63ZD"}
{"label": "NOT_SARCASM", "text": "@Sanjay_onair Its disappointing to know neighbor countries can give all WC match’s Live,DD end up showing studio di… https://t.co/QJo5MaShU2"}
{"label": "NOT_SARCASM", "text": "@Sanjay_onair Please don’t say it’s because of Supreme Court order,if there is a will,there is an way. If  neighbou… https://t.co/2P3hCRDR4Q"}
{"label": "NOT_SARCASM", "text": "@narendramodi Millions of common man like me around the nation is really disappointed and let down by the fact that… https://t.co/4X0lrdVlFT"}
{"label": "NOT_SARCASM", "text": "I've gotten so desperate in my money making schemes that I listened to country radio for 2+ hrs to try and win a pickup truck"}
{"label": "NOT_SARCASM", "text": "I'm sorry but if you \"subtly\" brag about being such a good person to anyone who'll listen chances are you're a garbage human"}
{"label": "NOT_SARCASM", "text": "I frequently think about the animated movie where Russian mice are trying to immigrate to America"}
{"label": "SARCASM", "text": "Gotta love insomnia, knackered all day gets to a reasonable time to sleep and wide awake. Fuck off soon please 👍"}
{"label": "NOT_SARCASM", "text": "Nice long weekend in Manchester &lt;3 now back home to a happy hyper pooch :)"}
{"label": "NOT_SARCASM", "text": "Why does cat food come in flavours like beef and lamb, instead of mouse and sparrow?"}
{"label": "NOT_SARCASM", "text": "Why do Amazon need a £1 test authorisation when I add a new payment card, as well as the authorisation they get when I actually use it?"}
{"label": "NOT_SARCASM", "text": "beautiful day"}
{"label": "NOT_SARCASM", "text": "#LetsUnlitterUK lets keep this country litter free,  either bin it or take it home"}
{"label": "NOT_SARCASM", "text": "For lunch yesterday baked potato with a greek salad, made with  Tesco finest barrel aged feta yummy for a little luxury #TriedForLess"}
{"label": "SARCASM", "text": "I don't care how irritating someone is being, you should NEVER throw your drink on them. Alcohol wastage is just unacceptable #RHOCheshire"}
{"label": "NOT_SARCASM", "text": "Kevin should have gone through instead of Grace in my opinion #XFactorFinal #XFactor #XFactor2017"}
{"label": "NOT_SARCASM", "text": "Oh. I quite like Jonny after tonight's episode, I'm surprised to say #cbb #CelebrityBigBrother #cbbuk"}
{"label": "SARCASM", "text": "Accidentally went to a funeral today...."}
{"label": "NOT_SARCASM", "text": "Laura Marling in Hebden was a pretty decent way to spend a Wednesday evening! New album sounds healthy http://t.co/tP05T1eOhM"}
{"label": "NOT_SARCASM", "text": "Not hacking this new training 💀"}
{"label": "SARCASM", "text": "WE HIT 6 LIKES! YOU GUYS ARE AMAZING!  https://t.co/DftTdLubIM  @ShawnAbner  @DayRts_  @GridcoreRTs @AlienRTS… https://t.co/Zso043T2oT"}
{"label": "NOT_SARCASM", "text": "Rising 👆https://t.co/q76sU7VvdT"}
{"label": "NOT_SARCASM", "text": "How? I do not know https://t.co/6Mc7CuYMYw #fortnite #clip #FortniteClips"}
{"label": "NOT_SARCASM", "text": "Don't understand @nikestore decision to make Atmos' so limited. What do they have to lose when re-retroing a colorway that's so beloved?"}
{"label": "NOT_SARCASM", "text": "Hey @truTVJokers, can I please get my free pizza now? #JokersGiveaway 🍍 via @gofooji"}
{"label": "NOT_SARCASM", "text": "S/O to @KGSupply_  for the early link! https://t.co/UDK2Mj5zMF"}
{"label": "NOT_SARCASM", "text": "With how much online shopping I have been doing lately, every day is about to feel like Christmas. 🎄"}
{"label": "NOT_SARCASM", "text": "Country music hits me right in the feels. 🎶"}
{"label": "NOT_SARCASM", "text": "Getting closer to breaking the 50-point mark 🙏 https://t.co/JnnH5Q8e5M"}
{"label": "NOT_SARCASM", "text": "I have officially joined the Competitive Fortnite team for @teamoxygengg #OxyFam"}
{"label": "SARCASM", "text": "nEw YeAr NeW mE"}
{"label": "NOT_SARCASM", "text": "This is probably one of the earliest times I've been awake since summer and frankly, I'm proud of myself"}
{"label": "NOT_SARCASM", "text": "Pretty sure I've slept 24 out of the last 48 hours and I could deffo go for another 12"}
{"label": "NOT_SARCASM", "text": "Sainsbury's charged me 40p for 10 custard creams while Asda would give me 20 for the same price, Brexit is already in full effect"}
{"label": "NOT_SARCASM", "text": "@protein_boost My husband x"}
{"label": "NOT_SARCASM", "text": "@DrinkTg C"}
{"label": "NOT_SARCASM", "text": "@blackscheese @DestinationShow Caramelised Onion and Rioja Mature Cheddar, Cheeky Chilli Mature Cheddar Cheese, Bla… https://t.co/4gN4mcHYJa"}
{"label": "SARCASM", "text": "Would just like to thank @UPS for leaving my irreplaceable pre-release book from a publisher out in the pouring rai… https://t.co/mF8BIIkWc8"}
{"label": "NOT_SARCASM", "text": "Making my dog sit in the car with me because I dont want to go in the house and pack for the weekend. She's over it. https://t.co/KWKvcP8PDd"}
{"label": "NOT_SARCASM", "text": "Tbh the capture of the Golden State Killer was the best thing that happened in 2018."}
{"label": "NOT_SARCASM", "text": "Far Cry 5 - a very good game which is close to being great. But not quite..."}
{"label": "NOT_SARCASM", "text": "#bbcrugby - get a grip people, we've had a bad couple of games but Jones' record is still excellent. Patience and p… https://t.co/m2jpRFMR0J"}
{"label": "NOT_SARCASM", "text": "#bbcfacup - youre aware the Moy's end was knocked down some time ago? Lazy journalism...Come on The Posh."}
{"label": "NOT_SARCASM", "text": "Can @instagram change whatever the hell they did back to normal??? Who wants to see regular post like stories???"}
{"label": "NOT_SARCASM", "text": "HostingTip: invite your mum for Xmas dinner so she can cook. I provided dessert #TriedForLess https://t.co/au3PU0k8ok"}
{"label": "NOT_SARCASM", "text": "Lovely danone light and free yoghurt with strawberries for my pudding #lightandfree #gotitfree @lightandfreeuk #spon"}
{"label": "NOT_SARCASM", "text": "Pretty flowers to brighten my day from @tesco #TriedForLess"}
{"label": "NOT_SARCASM", "text": "Some genuinely good tips to use testimonials - rather than having them gathering dust.  I also have mine printed ou… https://t.co/yfHPFfVWmI"}
{"label": "NOT_SARCASM", "text": "Do you like hand crafted gifts, accessories and home decor? Do you like drinks and snacks? Would you like to meet 1… https://t.co/xBGPFEFWy8"}
{"label": "SARCASM", "text": "Spooky season is sure off to a spooky start 🚨"}
{"label": "NOT_SARCASM", "text": "My Netflix app keeps glitching and thanks to their spotlight feature a picture of Ted Bundy’s face flashes up on th… https://t.co/Bv2wlTLg5j"}
{"label": "SARCASM", "text": "The Importance of Being Idle, Oasis. Explains a lot 😂 https://t.co/np0MNKdmYl"}
{"label": "NOT_SARCASM", "text": "Hey @B2NDerbyNotts, what dates are the evening sessions at the Portland Centre? Thanks."}
{"label": "NOT_SARCASM", "text": "#WhenFandomsCollide https://t.co/RbI0yf2Zni"}
{"label": "SARCASM", "text": "Is it okay to be a little selfish this year?"}
{"label": "NOT_SARCASM", "text": "Went to gym with my brother today.  I'm not okay 😭."}
{"label": "NOT_SARCASM", "text": "Thank you to the #Mtukudzi family for sharing Ollie with the rest of us. All is love. Ollie is love. ❤️"}
{"label": "NOT_SARCASM", "text": "I'm going to watch #aquaman simply to see my Khal😭💕"}
{"label": "SARCASM", "text": "Tim Lovejoy looks absolutely ancient. His beard must be trying to compensate for the lack of hair on his head."}
{"label": "NOT_SARCASM", "text": "Was -7 on the way home last night."}
{"label": "NOT_SARCASM", "text": "I am chuffed to announce that my wife is expecting, due in May 2019. 👶🏼🎃 #LawBaby #BabyLaw #newaddition #halloween… https://t.co/YuVDJc5aYE"}
{"label": "NOT_SARCASM", "text": "Gin is a vastly overrated drink. I’d rather have my usual of a vodka &amp; water. #UnpopularOpinion #UnpopularOpinions #OldMansDrink"}
{"label": "SARCASM", "text": "Peak London yummy mummy has been achieved in crystal palace - why WOULDN'T you hang S is for Sour Dough on your bab… https://t.co/5AzQmhb9d0"}
{"label": "NOT_SARCASM", "text": "Couldn't love @serenawilliams more - better than ever and doing it for us chicas everywhere! #Wimbledon  https://t.co/bxdACqx3c0"}
{"label": "NOT_SARCASM", "text": "New Return of the Living Dead bluray release https://t.co/JxNbr0X51W"}
{"label": "NOT_SARCASM", "text": "Just got my @BoxofDread, pretty excited."}
{"label": "NOT_SARCASM", "text": "Joe Bob Briggs is doing a 24 hour marathon on Shudder, going to be a great day.  https://t.co/8tJm91mMP4."}
{"label": "NOT_SARCASM", "text": "It’s definitely worth checking out the parkrun cancellations page this morning https://t.co/hcxWLl9Oga #parkrun"}
{"label": "NOT_SARCASM", "text": "I just grabbed myself three pairs of 2XU compression shorts for £2.50 in the final day of the TK Maxx yellow sticke… https://t.co/9cPnL8ChEJ"}
{"label": "NOT_SARCASM", "text": "#StephandDomCannabis made me cry. I understand how tiring fighting is, and its solely the government's fault."}
{"label": "NOT_SARCASM", "text": "Saw Mary Poppins Returns today, what a great film! I was just confused when it was set?"}
{"label": "NOT_SARCASM", "text": "@PoliceCoverUps7 @karenmears2 They are the trolls thats why their accounts keep getting shut down, they are trying… https://t.co/cUxqOTzpdE"}
{"label": "NOT_SARCASM", "text": "@PoliceCoverUps7 @karenmears2 Will keep an eye out for your updates, it's time for the truth"}
{"label": "NOT_SARCASM", "text": "The commentators are just embarrassing during this game #LIVPSG"}
{"label": "NOT_SARCASM", "text": "Your never going to understand everyone...oh well😬🤷🏻‍♂️"}
{"label": "NOT_SARCASM", "text": "@cathymcmorris @Google You and your colleagues in The People’s House have left the White House unchecked for almost… https://t.co/7azTeSENAF"}
{"label": "NOT_SARCASM", "text": "@LindseyGrahamSC @realDonaldTrump Are you still saying this crap? McConnell obstructed Obama’s noms *and* vowed to… https://t.co/SiEKuo467V"}
{"label": "NOT_SARCASM", "text": "Looking forward to this one @JensonButton https://t.co/a4pbm1OVko"}
{"label": "NOT_SARCASM", "text": "Does anyone know how long it takes for a .co.uk domain to expire if payment has not been given? Currently at 17 days!"}
{"label": "NOT_SARCASM", "text": "@williamtm :) my work mate said nice quality but he's going into a coma. I'm amazed at how good it actually looks"}
{"label": "SARCASM", "text": "Arsenal players injured in a match? That's unheard of! #bbcfootball"}
{"label": "NOT_SARCASM", "text": "Can somebody please explain to the lads on #MOTD the meaning of the word 'deliberate' in the handball rule, goal or not? Tah. @GaryLineker"}
{"label": "NOT_SARCASM", "text": "Looked like a dive from the keeper for the free kick though, to be fair. #bbceurofooty"}
{"label": "NOT_SARCASM", "text": "I don't know how you can complain about that penalty. His hand clearly moves towards the ball, it looked 100% delib… https://t.co/COBrmbhjwv"}
{"label": "NOT_SARCASM", "text": "Good luck @paigeatatime_ Doing Tough Mudder for me her mudder! - PBC Foundation https://t.co/RlPBSAbOz0"}
{"label": "NOT_SARCASM", "text": "I loved my Dasky Dashund, walking him up and down the street like I had a real dog. #MyToyStory https://t.co/BKWcgKIZPn"}
{"label": "SARCASM", "text": "Wrapping presents and watching Showgirls. So festive"}
{"label": "NOT_SARCASM", "text": "Budapest - you are cute and I like you"}
{"label": "NOT_SARCASM", "text": "I got @jamesblake tickets AND I’ve had two lunches. A good day."}
{"label": "NOT_SARCASM", "text": "How's everyone Saturday so far?  We're having a chilled out morning with some crafts and playing but we're not plan… https://t.co/HgPlo9owFO"}
{"label": "NOT_SARCASM", "text": "An awesome wall scroll from Tokyo Otaku mode!  user name: JackeeC  http://t.co/lcqMoqcYLu #tokyootakumode #win100USD http://t.co/bl8vPsVcc9"}
{"label": "NOT_SARCASM", "text": "Can you beat my #rageofbahamut @rageofbahamut"}
{"label": "NOT_SARCASM", "text": "Enter This Mega Holiday #Giveaway! Win A VERTAGEAR Gaming Chair, ASUS Monitor, &amp; More! https://t.co/z1UW0Vz8GY"}
{"label": "NOT_SARCASM", "text": "@LisaJCarrick @_MCFoundation Good luck Lisa 😊"}
{"label": "NOT_SARCASM", "text": "@Mel2809Mel He's a legend! I want Ole and all his backroom staff to stay ❤"}
{"label": "NOT_SARCASM", "text": "@ms_manutd Ole HAS to stay!! 😊"}
{"label": "SARCASM", "text": "Officially been blocked from ever giving blood again after I fainted once, even though I’m a regular donor with no… https://t.co/h3MPZ8fNwB"}
{"label": "NOT_SARCASM", "text": "Had an idea for an amazing travel blog/ Insta but it requires me to win the lottery 🙄"}
{"label": "NOT_SARCASM", "text": "Evolved another Pokemon with a Sinnoh Stone in Pokemon GO which is an Elekid to an Electabuzz and finally to an Ele… https://t.co/9n05b9SpUZ"}
{"label": "NOT_SARCASM", "text": "Evolved another Pokemon with a Sinnoh Stone which is a Magby to a Magmar and finally to a Magmortar   #pokemongo… https://t.co/RRIYp2dTFP"}
{"label": "NOT_SARCASM", "text": "All of the Vault Dweller Funkos from the Fallout Series, I like how each one is Customised as if they would be for… https://t.co/dJ0dznHnVr"}
{"label": "SARCASM", "text": "@Legitluke100 @Timweiser @davidhogg111 That's cute. His dad makes him rich and he files bankruptcy a few times and… https://t.co/62ksJ3D8uk"}
{"label": "NOT_SARCASM", "text": "@officialmcafee You're so washed up and old you're nothing more than a joke. A horribly unfunny one made of garbage… https://t.co/N57DHJq335"}
{"label": "NOT_SARCASM", "text": "@realDonaldTrump You're right. It was wrong to lose to Hillary by over 3 MILLION votes and still be given the White… https://t.co/MMEwYCH4cD"}
{"label": "NOT_SARCASM", "text": "Just woke because I could feel a spider walking across my face 😭"}
{"label": "NOT_SARCASM", "text": "Think @urbandictionary may be my favourite web page"}
{"label": "NOT_SARCASM", "text": "Now there's the way to advertise monetary policy #Economics https://t.co/7Mq1WNm7Gl"}
{"label": "NOT_SARCASM", "text": "Surprisingly calm time to come here (at @IKEAUk in Wembley, Greater London) https://t.co/3C6ErZ19Zs https://t.co/FtKZwwNAlg"}
{"label": "NOT_SARCASM", "text": "I've worked at this company for 7 weeks now and I have only just realised someone I know works on the floor above me, woops."}
{"label": "NOT_SARCASM", "text": "In the End Game now https://t.co/bSxSy3m3YR"}
{"label": "NOT_SARCASM", "text": "Looking forward to this already! #LegoBatman https://t.co/R0m6XT6Ihi"}
{"label": "SARCASM", "text": "Lil Wayne got dressed in the dark? #CFPNationalChampionship"}
{"label": "NOT_SARCASM", "text": "Thank you, to whoever dropped Wynter on #fantasygym 🙃 #NCAAGym"}
{"label": "SARCASM", "text": "Who’s a better actor, Tom Hanks or Buzz Aldrin? #NASA"}
{"label": "NOT_SARCASM", "text": "Sun, please bring us some warmth."}
{"label": "NOT_SARCASM", "text": "I wish I had more friends that actually acted like \"friends\", instead of acting like they're better than me and or… https://t.co/Fcdhv6uVoP"}
{"label": "NOT_SARCASM", "text": "For as \"overrated\" as they are, Aerosmith, is underrated.  Also... bring me the horizon is boring, overrated and ov… https://t.co/N74XmPkKP6"}
{"label": "SARCASM", "text": "@joetiburzi @MatthewColler So they should just run it every play then right?"}
{"label": "NOT_SARCASM", "text": "@theMMQB Literally ruined that Chargers team playoff window singlehandedly."}
{"label": "NOT_SARCASM", "text": "@BenHubbb @friscojosh @Martyn_v7 The point is you can have a great run game with players like Damien Williams, CJ A… https://t.co/Oa7DfHWVPl"}
{"label": "NOT_SARCASM", "text": "@DowntownRams Smart teams always defer, period.  There is no “brilliant move”, just a correct decision regardless of outcome."}
{"label": "SARCASM", "text": "Gotta love people who follow you and unfollow because you don't follow them within in an hour or 2. Sorry I don't stay on Twitter 24/7."}
{"label": "NOT_SARCASM", "text": "If you love someone you would not put them in a situation they do not want to be in."}
{"label": "NOT_SARCASM", "text": "Sad finding out an ex I went to prom w/ passed away. Would've been 26 on Aug 31st. Left behind a son. Great guy, only broke up due to moving"}
{"label": "NOT_SARCASM", "text": "It don't even feel like Christmas. I miss holidays with my family, they actually decorated things up. Love my bf but his family weird."}
{"label": "SARCASM", "text": "#Glastonbury @EDSHEERAN not sure about ES-talented,  but could be listening to one of his albums, plenty of backing track action going on."}
{"label": "NOT_SARCASM", "text": "#CalonLan goes far and wide @TheCalonLanSociety . https://t.co/pNw66dVzwy"}
{"label": "NOT_SARCASM", "text": "#backintimeforthefactory why does Alex Jones not join in and dress in the 1973 style herself?"}
{"label": "NOT_SARCASM", "text": "#SaturdayKitchen What are your ideas for the perfect, proper apache Egg? Must be natural!"}
{"label": "SARCASM", "text": "I can hear my mum bitching about me from the kitchen I love my liiife"}
{"label": "NOT_SARCASM", "text": "planning everything to move in with my boyfriend in London next year is so exciting!!"}
{"label": "NOT_SARCASM", "text": "cliche but falling asleep and waking up next to my boyfriend is the best"}
{"label": "SARCASM", "text": "I am *shocked* that police would gun an innocent black man down in broad daylight by firing at him while he runs aw… https://t.co/PoYwBtBSC7"}
{"label": "NOT_SARCASM", "text": "Every muscle in my body hurts and I'm ready for a complete cyborg robocop body now. I'd even settle for an iron man… https://t.co/n28YV2Bvgr"}
{"label": "NOT_SARCASM", "text": "Hey @Treyarch , any chance we can get subtitles for the unlockable specialist mission intel in #BlackOps4 ? Plenty… https://t.co/JBelNI4hI1"}
{"label": "NOT_SARCASM", "text": "I’m actually ridiculously excited about #PokemonLetsGoPikachu just because Pokemon yellow and Kanto is my childhood… https://t.co/p5TVQqyrGO"}
{"label": "NOT_SARCASM", "text": "who has a good documentary narrator voice hmu pls 😭"}
{"label": "NOT_SARCASM", "text": "y’all ever sit back and just wonder wtf am I doing lmao"}
{"label": "NOT_SARCASM", "text": "Remind me in 8 months to dedicate my dissertation to the free tea and coffee in the English department, I'd be a shell of a woman without it"}
{"label": "NOT_SARCASM", "text": "Writing in pen in library books should be a criminal offence"}
{"label": "NOT_SARCASM", "text": "Additionally @pewdiepie's video from the same day has 6.4M views. Someone explain how @YouTube trending is so broken."}
{"label": "NOT_SARCASM", "text": "@YouTube will probably continue to insist that the videos aren't hand picked by clearly their algorithm blocks actually popular videos."}
{"label": "SARCASM", "text": "Good job Liverpool signed VVD to sort out their defence isn't it?! 😂"}
{"label": "NOT_SARCASM", "text": "What a game Wolves v Lei"}
{"label": "NOT_SARCASM", "text": "Wondering how many Weetabix @BernardoCSilva had this morning. What a performance! @ManCity"}
{"label": "NOT_SARCASM", "text": "Ferna outstanding again. Let's give him half an hour's rest now ready for Sunday"}
{"label": "SARCASM", "text": "#Qricketlive I could not live without ketchup!!!"}
{"label": "NOT_SARCASM", "text": "I’m getting #BUSCHHHHH gear for drinking beer and you can too. Yes, really. Sign up at https://t.co/nvrNfq4hwp. https://t.co/M1Y4gZi7LA"}
{"label": "NOT_SARCASM", "text": "#Qricketlive I'd like to watch the ocean life but I bet there's nothing more comfy than sleeping in zero G"}
{"label": "NOT_SARCASM", "text": "Story time doesn't work for me, but how 'bout  instead you give the first line and we make a cute Limerick from that? @QriketLIVE"}
{"label": "SARCASM", "text": "Thanks freezing rain I just wanted some McDonalds very cool"}
{"label": "NOT_SARCASM", "text": "My tummy got the big hurt"}
{"label": "NOT_SARCASM", "text": "If it wasnt so cold I'd take a walk cuz I'm going stir crazy lol"}
{"label": "NOT_SARCASM", "text": "I really need to get out of my house"}
{"label": "NOT_SARCASM", "text": "What else do you get for free when it’s your birthday ? 🤔 Help me out https://t.co/04odTpEsvH"}
{"label": "NOT_SARCASM", "text": "Open for good luck https://t.co/3P7hvNXA8I"}
{"label": "SARCASM", "text": "i’ve never been so happy to be doing 3 exams a day? i got to leave a whole hour early and there’s no interventions"}
{"label": "NOT_SARCASM", "text": "i really hope i get this job or i’m fucked when 5sos actually announce dates"}
{"label": "NOT_SARCASM", "text": "found a cute jacket a few days ago but didn’t get it, went into london and found it reduced to £7 and i’ve never been happier"}
{"label": "SARCASM", "text": "Today gives some hope for a decent summer! #bbeeaaauuuttiffuuuuuul"}
{"label": "NOT_SARCASM", "text": "The Olympic tennis final has been a corker so far 🎾 #Rio2016"}
{"label": "NOT_SARCASM", "text": "I make it my mission to be as outrageous as possible in essays... it usually works #diss #controversial"}
{"label": "NOT_SARCASM", "text": "Awesome day of hockey #WhoAreRepton #Reds #SickGoal #TwoOne #CaptainMarvel"}
{"label": "SARCASM", "text": "I'd rather eat glass than revise right now"}
{"label": "NOT_SARCASM", "text": "When your teacher asks you a question you don't know the answer to and it becomes a competition of who can last the awkward silence longer"}
{"label": "NOT_SARCASM", "text": "Exam etiquette should be a thing and the first rule should be 'don't say \"that was so easy\" when walking out of an exam'"}
{"label": "NOT_SARCASM", "text": "Did anyone else get to 30 and then think... oh... now what? 🤨. I feel so lost and it’s weird!"}
{"label": "NOT_SARCASM", "text": "@NextHelp I am truly disgusted at the quality of these chairs. I only use this table and chairs when we have guests… https://t.co/jQ46UVf0Ax"}
{"label": "NOT_SARCASM", "text": "Just did the Waking Up meditation session on @Headspace and now I feel refreshed, awake, happy and rating to go with my Saturday 😄☀️"}
{"label": "NOT_SARCASM", "text": "This bus has no heating 🥶🥶🥶"}
{"label": "NOT_SARCASM", "text": "Current vibe: leading a raiding party to find the hidden biscuits at this training course"}
{"label": "NOT_SARCASM", "text": "When someone offers to put a craft club training session on for you because ‘you’re lovely’ 😌😌"}
{"label": "NOT_SARCASM", "text": "I had a dream that all the food in the world ran out so we started eating #furries."}
{"label": "NOT_SARCASM", "text": "It's no secret that I love Jeff Goldblum. https://t.co/UbxRQd1v3z"}
{"label": "NOT_SARCASM", "text": "We've made a good start so far! Now we must find this sacred item. Im looking forward to the other curses that will… https://t.co/wQ29rwWerU"}
{"label": "NOT_SARCASM", "text": "Lost 4 1/2 lbs last week, hoping for the same this week! Come on Monday!"}
{"label": "NOT_SARCASM", "text": "#GhostAdventures #scared #wtf #gah"}
{"label": "NOT_SARCASM", "text": "off out to get absolutely soaked watching the Tour of Britain go through Workington. I must be mad!  #tob2013"}
{"label": "NOT_SARCASM", "text": "RIP Alice Pyne. You truly were an inspiration x #nightnightalice"}
{"label": "NOT_SARCASM", "text": "I'm so excited.  I'm so excited for Kingdom Hearts. I'm so excited to finally be excited for something again, and I… https://t.co/EiQTxwIH73"}
{"label": "SARCASM", "text": "Told my dad I didn't want to do anything too mental, being 2 weeks post-op y'know. 62km mountain biking trip. Thanks paw #outdoordad"}
{"label": "NOT_SARCASM", "text": "Kristin Armstrong getting Gold in Rio at the age of 42 is just amazing #Rio2016"}
{"label": "NOT_SARCASM", "text": "If I were Eddie Izzard, I'd still be knackered"}
{"label": "NOT_SARCASM", "text": "my parents dressed this dog like she’s walking for eckhaus latta https://t.co/BWmtWQzu9k"}
{"label": "NOT_SARCASM", "text": "“man! i feel like a woman” blasting at this drugstore, and now i want another CVS bangers mix again"}
{"label": "NOT_SARCASM", "text": "i love this good boy https://t.co/mUVLxmdNLN"}
{"label": "SARCASM", "text": "But apparently everyone who voted Leave knew exactly what they were voting for ... https://t.co/X3EWuaOyXY"}
{"label": "NOT_SARCASM", "text": "Yes! Welcome back Billy. #billyvinipola #saracens"}
{"label": "NOT_SARCASM", "text": "This is why we need to be vigilant - Parliament should be sovereign, not Government. https://t.co/qEkgw3pL8b"}
{"label": "NOT_SARCASM", "text": "This puts me in mind of Boxer in Animal Farm. They have outlived their usefulness and need to be got rid of. https://t.co/YjxK2xXx4U"}
{"label": "SARCASM", "text": "@nyDThomas @BeckyLynchWWE But she might get to main event the biggest PPV of the year. Poor Becky."}
{"label": "NOT_SARCASM", "text": "@GailSimone To be fair, that’s the least of that panel’s problems."}
{"label": "NOT_SARCASM", "text": "@steve_lieber Someone drank their Red Bull."}
{"label": "SARCASM", "text": "New to Twitter, looking forward to seeing what the fuss is about 😂😂"}
{"label": "NOT_SARCASM", "text": "Couldn't give a crap about #XFactor or the #XFactorFinal"}
{"label": "NOT_SARCASM", "text": "Finding out you've got your dream job in Walt Disney World &lt;3"}
{"label": "NOT_SARCASM", "text": "cannot remember the last time I wasn’t tired #nosleep https://t.co/7mwaEAnbmK"}
{"label": "NOT_SARCASM", "text": "🙌🏾🙌🏾🙌🏾 https://t.co/qwWJ6NuQQP"}
{"label": "NOT_SARCASM", "text": "#EndAutismNow is literally a battle cry for eugenicists. End of discussion. #EndAbleismNow"}
{"label": "NOT_SARCASM", "text": "4 years of indignant #REDinstead selfies. Fuck @autismspeaks! #actuallyautistic #autisticacceptanceday https://t.co/SxKPGIPruN"}
{"label": "NOT_SARCASM", "text": "Belize in 8 days 🐠🌴"}
{"label": "NOT_SARCASM", "text": "In desperate need of a snow day so i can catch up on papers"}
{"label": "NOT_SARCASM", "text": "Not really sure what sleep is anymore but i finished my papers for this week and next week will be another start to several other papers"}
{"label": "NOT_SARCASM", "text": "@bloomplanners I love the stickers!  They make my planner so much more colorful and fun!"}
{"label": "NOT_SARCASM", "text": "@SmartyPig I am a single mother so we have to cut costs as much as possible in my household.  We buy all of our clo… https://t.co/HfU3R3kun2"}
{"label": "NOT_SARCASM", "text": "Save on your freelance projects with PeoplePerHour! via @PeoplePerHour https://t.co/RKUZKI2qNH"}
{"label": "NOT_SARCASM", "text": "I'm the proud new owner of this gem bought on @depop https://t.co/uUUfVIKLuF"}
{"label": "NOT_SARCASM", "text": "Thank you for entering, we'll contact you if you are the winner.  https://t.co/C0uYmbpQfE"}
{"label": "NOT_SARCASM", "text": "@josephishope @realDonaldTrump I don't think we need more VA hospitals. We just need to allow vets to choose their own doctors."}
{"label": "NOT_SARCASM", "text": "That Jussie story is sick... how could someone do that? How could someone have that much hate in their heart?"}
{"label": "NOT_SARCASM", "text": "Fuck every single person involved in that Michael doc. Every. Last. One. Let that man Rest In Peace"}
{"label": "NOT_SARCASM", "text": "Lying about rape is something that EVERYONE should be against because when people do bullshit like that it hurts AC… https://t.co/1HjxDvgIDe"}
{"label": "SARCASM", "text": "@alanwil337 @DrAseemMalhotra @richardhorton1 @TheLancet @BJSM_BMJ @DrPascalMeier @denis_campbell @piersmorgan… https://t.co/0vtfKvqn0U"}
{"label": "NOT_SARCASM", "text": "Just binge watched #Fargo series 3.  #David_Thewlis gives the performance of the year.  An acting masterclass."}
{"label": "NOT_SARCASM", "text": "@Stan_And_Ollie Charlie Hall got one, so here's hoping someone writes a Finn biography one day."}
{"label": "NOT_SARCASM", "text": "Isao Takahata.  So sad, but what joy he gave us. And then there was Grave of the Fireflies.  Never cried so much at a film before or since."}
{"label": "NOT_SARCASM", "text": "The fab @LynnTFarrell who we featured in our @cindersmag feature on #STEM has passed her viva and is officially Dr… https://t.co/7PAjNJZTQy"}
{"label": "NOT_SARCASM", "text": "Some good questions to keep in mind when considering #Pseudoscience https://t.co/tjaUnE7rQ9"}
{"label": "NOT_SARCASM", "text": "Delighted that I got an email from the #BACB to say that my papers were accepted and that I can sit the #BCBA exam!… https://t.co/YOl1Y3BDsG"}
{"label": "NOT_SARCASM", "text": "@TashaAstley Why are you making me cry on a Saturday night"}
{"label": "NOT_SARCASM", "text": "@TashaAstley This is so cute"}
{"label": "NOT_SARCASM", "text": "@dyarh_24 You’ve had 2"}
{"label": "SARCASM", "text": "so they’re just gonna hog all the awards.. ok! alright!"}
{"label": "NOT_SARCASM", "text": "omg school is starting again soon 😭"}
{"label": "NOT_SARCASM", "text": "i can finally change the Youngjae photocard in my case it’s about time"}
{"label": "NOT_SARCASM", "text": "Jesse Lingard is my Premier League Player of the Month #FIFA18 @EASPORTSFIFA #POTM https://t.co/3bsHlhRpYh"}
{"label": "NOT_SARCASM", "text": "Thanks EA For The 500 Free FIFA Points Smh 👀 https://t.co/dfxZz4hNFI"}
{"label": "NOT_SARCASM", "text": "Weird I lived above Yates this time last year and now I’m not even allowed in x"}
{"label": "NOT_SARCASM", "text": "Confused why the robber rings the doorbell on the camera doorbell advert"}
{"label": "SARCASM", "text": "A big well done to the dick that pulled out on me this evening on the Fortwilliam roundabout #ShitDriver #WhatADick"}
{"label": "NOT_SARCASM", "text": "Feel like a big kid watching #LegoMasters Get me some bricks! Lol 😂"}
{"label": "NOT_SARCASM", "text": "Cannot wait for this film! https://t.co/MPChAtHt3g"}
{"label": "NOT_SARCASM", "text": "#Jumanji was hilarious. Definitely recommend it!"}
{"label": "NOT_SARCASM", "text": "Doing some @ArchieComics fanart. Grew up reading this series ever since I was a child. I wanted to create art in th… https://t.co/HrpXfi14ob"}
{"label": "NOT_SARCASM", "text": "Superb https://t.co/qv4q4V8jZ4"}
{"label": "NOT_SARCASM", "text": "I like Mitrovic, proper centre forward!"}
{"label": "SARCASM", "text": "i DO enjoy working 10 hours every friday, saturday, and sunday and never having a social life! thanks for asking !"}
{"label": "NOT_SARCASM", "text": "someone tell me how to stop clenching my teeth while i’m sleeping"}
{"label": "NOT_SARCASM", "text": "i don’t even get fazed when inconvenient stuff happens to me anymore"}
{"label": "NOT_SARCASM", "text": "stop asking for advice and then not listening to it because it’s not what you want to hear"}
{"label": "NOT_SARCASM", "text": "If we are willing to ban people like #AlexJones from social media for incitement of #violence I don't see why… https://t.co/3Dhd0yw88F"}
{"label": "NOT_SARCASM", "text": "So I mean, the electoral system is just shit in general, but if Bernie Sanders suddenly became president after 4 ye… https://t.co/BT2UqzFhBJ"}
{"label": "NOT_SARCASM", "text": "My dad just called me to tell me a joke bless him"}
{"label": "NOT_SARCASM", "text": "Current mood: waiting for a student to read the terms and conditions on his fafsa"}
{"label": "NOT_SARCASM", "text": "Get you someone that calls you their favorite person &lt;3"}
{"label": "NOT_SARCASM", "text": "nothin just playing on thenew slim xbox"}
{"label": "NOT_SARCASM", "text": "Hey I bought an iPod!"}
{"label": "NOT_SARCASM", "text": "Hey everyone this is the best day ever!!!!!"}
{"label": "NOT_SARCASM", "text": ".@Qantas your failure to print my @united boarding pass with business has me waiting in the regular line at @Melair… https://t.co/svhYSpNrC0"}
{"label": "NOT_SARCASM", "text": ".@united would it kill you to mark what's vegan in Polaris lounge? Vegetarian is usually pretty easy to figure out… https://t.co/RsG9dqYtdI"}
{"label": "NOT_SARCASM", "text": "This shit got me all hyped up... Lessssgooo #NDFB #GoIrish #BeatSC https://t.co/u2XSE1SOZz"}
{"label": "NOT_SARCASM", "text": "Why don't Rogers ever throw to Jimmy Graham.. But he Will gladly throw a 50 yard bomb to his 4th string tight end...bullshit"}
{"label": "NOT_SARCASM", "text": "The Cubs win the Pennant! #FlytheW"}
{"label": "NOT_SARCASM", "text": "The Cubs won even without Jake having great stuff today!  One more! #FlytheW"}
{"label": "NOT_SARCASM", "text": "I get to see the @BlueAngels three times this year. Rockford, Chicago, and Thunder over Michigan."}
{"label": "SARCASM", "text": "Is it October yet ?? #missingsupernatural #needmyjensenfix #rollonseason14"}
{"label": "NOT_SARCASM", "text": "#andthebeesstillbuzz manchester girl one love sad day 😔 thinking of the fallen 22 and more xx https://t.co/85iG0KyCQD"}
{"label": "NOT_SARCASM", "text": "My new tattoo to remind myself to keep going #akf #SPNFamily #thestruggleisreal @jarpad @cw_spn @JensenAckles https://t.co/SWow8JMWTg"}
{"label": "NOT_SARCASM", "text": "Let's get the message out there @MarkRPellegrino @sebroche @jumblejim @Stands @mattcohen4real @jaimemilner… https://t.co/6IhspsrKfe"}
{"label": "SARCASM", "text": "Exciting PhD opportunity!! #FIELD study @UofGlasgow @UofGMVLS https://t.co/u8grEJS8qH"}
{"label": "NOT_SARCASM", "text": "Cracking time with the big lad this weekend - winter weather won’t stop us!! #Rua #TrainingSession https://t.co/Rcz95hq3Kh"}
{"label": "NOT_SARCASM", "text": "Back from holiday and straight back on it! Brilliant day at the @UofGlasgow Neuroscience Careers Conference, lots o… https://t.co/5A8mGCkAM7"}
{"label": "NOT_SARCASM", "text": "Loved playing a very small part in such a important event @EdSciFest. Brilliant panel, fantastic discussion and int… https://t.co/CNiAiVPDpO"}
{"label": "SARCASM", "text": "In case you were wondering what I got for my birthday today...  Tonsilitis.  I got Tonsilitis."}
{"label": "NOT_SARCASM", "text": "Seeing @RaleighRitchie live tonight has been the highlight of my year. You killed it tonight, bro! #MTVCrashesPlymouth"}
{"label": "SARCASM", "text": "I love it when I want to do some editing and my editing suite needs updating AGAIN."}
{"label": "NOT_SARCASM", "text": "Imagine if the weather was flipped around - instead of ice and snow in the Winter, it rained fire instead, in the Summer...! Earth 2.0."}
{"label": "NOT_SARCASM", "text": "Took my photographs for my Valentine's Day gift guide - just got time to edit them, tidy up then wake Thomas up for… https://t.co/bNAqnI8OOk"}
{"label": "NOT_SARCASM", "text": "I remember reading the news. I only 7-8 but starting to learn about the history of the sport and the mighty Lotus t… https://t.co/Clp7cLvkNZ"}
{"label": "NOT_SARCASM", "text": "Sport tends to be won and lost by the mistakes or moments of brilliance by the competitors. The referee and their a… https://t.co/vxCSOFVx5h"}
{"label": "NOT_SARCASM", "text": "I was never a fan of Michael. But that’s because - as JPM says here - he was the target. The guy to beat (and as a… https://t.co/ghsohk8Jnp"}
{"label": "NOT_SARCASM", "text": "#IVoted"}
{"label": "NOT_SARCASM", "text": "Ergh way too tired. Ready for some days off now."}
{"label": "NOT_SARCASM", "text": "Just wanted to praise one of your drivers who helped a lady in a broken down car move it on to the grass verge, did… https://t.co/6GripHRX30"}
{"label": "NOT_SARCASM", "text": "Mini McFlurry ice creams are a brilliant addition to the @McDonaldsUK menu! Perfect as a little treat or for the li… https://t.co/e50XraSqRe"}
{"label": "NOT_SARCASM", "text": "Designing my new application right now. It&#39;s giving me hell"}
{"label": "NOT_SARCASM", "text": "Happy birthday. Wish you more of God's blessing"}
{"label": "NOT_SARCASM", "text": "I chose the #RIGHT @virginmedia Christmas cracker. Fingers crossed! 🤞🎁"}
{"label": "NOT_SARCASM", "text": "@PepsiUK1 hi there pepsi how come I never received my pepsi perfect match prize of a World Cup football bowl and 2… https://t.co/hPEFCwFP6D"}
{"label": "SARCASM", "text": "I never knew it was so bright outside at 8 in the morning."}
{"label": "NOT_SARCASM", "text": "I know Fallout 4 is quite a new game (compared to the others at least) but it got me into RPGs."}
{"label": "SARCASM", "text": "Been at work for 32 minutes and I’m already pissed off 🙃 happy new year 🥳"}
{"label": "NOT_SARCASM", "text": "First year I’m actually so excited for Christmas instead of dreading it and anyone had told me that I would ever fe… https://t.co/WuxNtOwTev"}
{"label": "NOT_SARCASM", "text": "House of Fraser makes match of the day 😂 #MOTD"}
{"label": "NOT_SARCASM", "text": "Kane’s too deep wtf 😂"}
{"label": "NOT_SARCASM", "text": "Great day walking the city walls at Chester, helping a couple get their narrowboat through the locks on the Union C… https://t.co/e1c3DBnz7B"}
{"label": "NOT_SARCASM", "text": "We are now the proud owners of 533 sq ft of real estate, woo hoo! 🍾🥂 #downsizemyhouse"}
{"label": "NOT_SARCASM", "text": "We’ve sold all of the furniture apart from the bed, sofa &amp; kitchen ntable and have finally finished packing. Now we… https://t.co/f2wFocwV8N"}
{"label": "NOT_SARCASM", "text": "Tucking into grapes merrily, only to find out after 10+ that they’re mouldy 😭🍇 Well gutted #grapes #yumyum #yummyfood"}
{"label": "NOT_SARCASM", "text": "Happy equinox. Summer is coming."}
{"label": "NOT_SARCASM", "text": "Started putting the holiday pics on Flickr. Here's the cutest one https://t.co/MjdzNpP3iz"}
{"label": "NOT_SARCASM", "text": "Clearly we had a great summer in Edinburgh as the Harlaw/Thriepmuir reservoirs are almost empty. Pics from Jan/May… https://t.co/Gs4zsYn6Ck"}
{"label": "NOT_SARCASM", "text": "Perfect English Cream Tea!  Oh, and some great music too - from West End stage classics to trumpet and clarinet sol… https://t.co/x7RsM3nnUa"}
{"label": "NOT_SARCASM", "text": "Wonderful start to what will hopefully be a wonderful journey! https://t.co/EtpXW7y5lu"}
{"label": "NOT_SARCASM", "text": "Make sure you know what you need to vote in #Woking this May.  The list of acceptable ID is long and, if you haven'… https://t.co/SIeYGoc4eM"}
{"label": "SARCASM", "text": "Is it even Christmas if there isn’t a fight with neighbours and a broken wrist?"}
{"label": "NOT_SARCASM", "text": "Am I the only one that is BUZZING for royal baby no.3 and Princess Megan? 👸🏼"}
{"label": "NOT_SARCASM", "text": "A few things.... my baby has slept for a total of 11 hours SO FAR (with only one break)"}
{"label": "NOT_SARCASM", "text": "Not only did we have the most under appreciated team name in pub quiz history - but we also came in second...so to… https://t.co/AHZ0GMufIW"}
{"label": "NOT_SARCASM", "text": "After around maybe a minute of careful thought out decision making, I now have tickets for @JanelleMonae in London.… https://t.co/kbyX2IW6JW"}
{"label": "SARCASM", "text": "So I see the U.K. continues to be Strong and Stable ™"}
{"label": "NOT_SARCASM", "text": "The new Two Steps From Hell album is 🔥🔥"}
{"label": "NOT_SARCASM", "text": "When can we expect the next Adam Curtis documentary?"}
{"label": "NOT_SARCASM", "text": "@prodnose Norwich have been exceptional. Leeds are decent and press so well but our quality has told. Love this team."}
{"label": "NOT_SARCASM", "text": "@EveningNews \"Police said the second incident happened between 3am and 3.15am. They said they were not being linked… https://t.co/rf3vZEOZnF"}
{"label": "NOT_SARCASM", "text": "@virginmedia Why on earth are you dropping the UKTV channels? I don't care that I can't watch 10 year old Top Gear… https://t.co/annTFjCsj7"}
{"label": "NOT_SARCASM", "text": "@TheRAC_UK On hold for two hours but couldn't get through. Strangers helped me home. Filled out your online form wh… https://t.co/KGregFT9vk"}
{"label": "NOT_SARCASM", "text": "@SuperdrugHelp Thank you Yasmin for dealing with my complaint a few weeks back. Really appreciate the effort you pu… https://t.co/XupMC5jhKP"}
{"label": "NOT_SARCASM", "text": "@Groupon_UK Online Agent provided a tracking number for my parcel and said it would be delivered by 6PM TODAY. I tr… https://t.co/ZWWzhYDYxr"}
{"label": "SARCASM", "text": "love getting locked out of my account 🙃"}
{"label": "NOT_SARCASM", "text": "fuckin starving man"}
{"label": "NOT_SARCASM", "text": "canny stand people who use social media to brag about EVERYTHING bore off pls ur embarrassing urself"}
{"label": "NOT_SARCASM", "text": "I love my allotment so much - I was there today in the rain getting cut up by brambles and still having the nicest time"}
{"label": "NOT_SARCASM", "text": "Shout out to @TPExpressTrains for getting us from Manchester airport to leeds on time even though there were proble… https://t.co/juTWBgj0Et"}
{"label": "NOT_SARCASM", "text": "Man I love kirkgate market so much where else can y get all ur lentils, local produce and craft supplies in one go"}
{"label": "SARCASM", "text": "Isn’t it lovely when somebody tries to ruin your whole day and mood even before 7am? 🙄"}
{"label": "NOT_SARCASM", "text": "I do love having my evenings back after such a long time.... I’m in bed already, glass of wine, watching a DVD and… https://t.co/7kBC4TPr6R"}
{"label": "NOT_SARCASM", "text": "Such a fantastic morning making memories  ❄️⛄️❤️"}
{"label": "SARCASM", "text": "backed up the sink so that's a good start to saturday"}
{"label": "NOT_SARCASM", "text": "I wanna write a poem about how waiting to transition and waiting for KH3 were the same thing but I have no poetic l… https://t.co/S5luVdhaI4"}
{"label": "NOT_SARCASM", "text": "I'm so mad I have a snow day tomorrow but also no copy of KH3 yet"}
{"label": "NOT_SARCASM", "text": "ld7sNDQ8FPtHypkBjVw|nJNgMVl7lh0JoU1IzR6SCohkc6punuCMVhIucGpXg|I have signed up to https://t.co/RjhTWm0nhr – use my… https://t.co/SGNSGN0eEw"}
{"label": "NOT_SARCASM", "text": "Win this amazing @4RosesBourbon 2015 Release, Small Batch whiskey package, including @JoyJolt crystal decanter set.… https://t.co/bBtreajLXg"}
{"label": "NOT_SARCASM", "text": "Soooo awesome 🖤🖤 https://t.co/A9H9ST3aS1"}
{"label": "SARCASM", "text": "“I can’t believe the new Spider-Man trailer spoiled End Game! I really thought Marvel went to all that trouble to b… https://t.co/PaT5h48h7l"}
{"label": "NOT_SARCASM", "text": "It’s 4am and I’m watching Bob Ross cradle a baby squirrel. I should asleep, but this feels like the best bit of a bad week"}
{"label": "NOT_SARCASM", "text": "I kinda miss the days when a history episode meant the Doctor locking Hitler in a cupboard. Upping the drama in Doc… https://t.co/Juhv7vWPg1"}
{"label": "SARCASM", "text": "@janecdevonshire @gorillaspirits @HampshireFare You might need a drop of tonic with that 😉🍸"}
{"label": "NOT_SARCASM", "text": "I’ve left it until I’m in my late 50’s to finally invest in a company I believe in and who match my own values. Tha… https://t.co/QDavTPPl6P"}
{"label": "NOT_SARCASM", "text": "The ad' John Lewis should have used!! Brilliant from @philbeastall https://t.co/c920okxMl6"}
{"label": "SARCASM", "text": "#dearcustomer Thanks 20 mins before closing timewaster. It is not like I had tons of new freight to put away so tha… https://t.co/KpTPHI4tga"}
{"label": "NOT_SARCASM", "text": "#dearcustomer I am sorry that the mobile phone reseller in the mall fucked you over. We all aren't a bunch of sheis… https://t.co/9mbUPZDq0O"}
{"label": "NOT_SARCASM", "text": "Your #dearmanager: ready to fold up and go back on store policy that you just quoted and make you look like a dick/… https://t.co/fWlmwmKlvA"}
{"label": "NOT_SARCASM", "text": "Been an absolute shift this week on construction site, can't wait till me and @notsafeforjake clock out and hit the ale."}
{"label": "SARCASM", "text": "@O2 @wondermouse Run for the hills Mark, O2 have literally no data coverage in urban areas with a population of five people or more!"}
{"label": "NOT_SARCASM", "text": "@PatthePainter2 @ScrtDrugAddict 💪🏻💪🏻 well in."}
{"label": "NOT_SARCASM", "text": "@OriginalFunko hey guys, any chance the Sirius Black Rock Candy is going to get a UK release? He’s the only absence in our collection!"}
{"label": "NOT_SARCASM", "text": "@Tesco hey Tesco, are there are any Liverpool stores doing the buy one get one free Funko offer?! Thanks"}
{"label": "NOT_SARCASM", "text": "If the rumours are true &amp; Rodney McAree is about to be announced as the @ColeraineFC manager, I'm happy. Not my 1st… https://t.co/iptKyF3d5d"}
{"label": "NOT_SARCASM", "text": "Having said that, this is an England team as worthy of admiration as I have seen in my adulthood. Gareth Southgate… https://t.co/JnQ2KnGzTJ"}
{"label": "NOT_SARCASM", "text": "How you know you're reaching a generational transition.  You hear your wife say \"it's at this time of the evening I… https://t.co/ruAPxPQlAa"}
{"label": "NOT_SARCASM", "text": "Craig is such a terrible actor on corrie!"}
{"label": "NOT_SARCASM", "text": "#BAFTATV that magician was the worst I've ever seen. I could see him rummaging in his pockets! I've seen kids enter… https://t.co/f0AsMtQkSX"}
{"label": "NOT_SARCASM", "text": "Is this the most boring man ever on #whowantstobeamillionaire ?"}
{"label": "SARCASM", "text": "@PopChassid Probably the best way of eating one’s own though. 😉"}
{"label": "NOT_SARCASM", "text": "Still all bundled up from the polar vortex but slowly slipping off layers (and no more blankets!) And sweating inst… https://t.co/e5IlVppdK6"}
{"label": "NOT_SARCASM", "text": "So the disabled reality is we may be the most vulnerable amd at risk to extreme cold and have the same housing righ… https://t.co/ATlGAZ3uSz"}
{"label": "SARCASM", "text": "Wish one of the many people dressed as killers were actually one n killed me"}
{"label": "NOT_SARCASM", "text": "Just seen three girls take a huge vape n then dabbed to Jackie Chan by post malone in sync. Poland is wild"}
{"label": "NOT_SARCASM", "text": "Asked my mam if we had something to measure ring sizes n she started fucking tearing up asking if I was going to propose to Molly ahahahaha"}
{"label": "NOT_SARCASM", "text": "Ive known that my sister was going to propose to her girlfriend for months but I still managed to cry when I heard… https://t.co/q7FkuXKRew"}
{"label": "NOT_SARCASM", "text": "I honestly get soooo angry about the smallest little things if it makes me look like a fool, I cant stand feeling stupid 🥺"}
{"label": "NOT_SARCASM", "text": "Pineapple KA is 45p of deliciousness"}
{"label": "SARCASM", "text": "Gosh, writing research proposals are fun aren't they?"}
{"label": "NOT_SARCASM", "text": "Said \"good morning\" to stranger. Forgot I was in London, they looked at me funny 😂 #smalltowngirl"}
{"label": "NOT_SARCASM", "text": "Tried the Greggs vegan sausage roll. Yes, folks, anything wrapped in pastry is indeed great. 💚💚💚"}
{"label": "NOT_SARCASM", "text": "Finishing off an essay at home today. Consequently, I have done laundry, worried about my houseplant, cleaned the f… https://t.co/CtZHwVH0GL"}
{"label": "SARCASM", "text": "The most interesting thing I've learned during my MSc is that molecular biology research is 70% labelling things.. #science #microbiology"}
{"label": "NOT_SARCASM", "text": "@SharplesSchool It was so amazing to meet so many young students interested in pursuing science👩🏻‍🎓 #STEM #WomenInSTEM #Microbiology"}
{"label": "NOT_SARCASM", "text": "Happy Saint David’s day to all the glorious Welsh folk! ⭐️ I’ll be gracing the North with my homemade Welsh cakes later 🏴󠁧󠁢󠁷󠁬󠁳󠁿"}
{"label": "NOT_SARCASM", "text": "£700 down the toilet today :( Dropped my iPhone 4s :(  Straight down the loo  Luckily my wonderful man @BigPauz fixed it for me :) love u x"}
{"label": "NOT_SARCASM", "text": "My lucky night @therealgokwan on #HotelGB and @Ginofantastico on @CelebJuice :)"}
{"label": "NOT_SARCASM", "text": "Pro tip: if you use your coffee mug as a hand warmer, by the time your back from the coffee room it'll be the perfect drinking temperature!"}
{"label": "NOT_SARCASM", "text": "So this was a bit of a personal piece, but I wrote a blog on some of my personal struggles with illness during my P… https://t.co/mjHryvff4N"}
{"label": "NOT_SARCASM", "text": "You know you want to #SingForLee @edsheeran Do it for all the wonderful people who've lost their fight with cancer x"}
{"label": "NOT_SARCASM", "text": "Just call me mojito mo @IsaacAHeath x https://t.co/wTZlYLVShC"}
{"label": "NOT_SARCASM", "text": "Watching #SRBBRA and just had a thought re footballers and tattoos which are prevalent these days. Do you fellas ha… https://t.co/1l0eplEEl5"}
{"label": "NOT_SARCASM", "text": "I have quare memories of Feiles (Tripp to Tipp) festivals in the early 90s, travelling down from Belfast, my first… https://t.co/oIkiuKlF3v"}
{"label": "SARCASM", "text": "Think I might have frostbite ❄️☃️"}
{"label": "NOT_SARCASM", "text": "Absolutely buzzing to have got a 2.1 in my degree 🎓🎓🎓"}
{"label": "NOT_SARCASM", "text": "Stories like this in @TheSun are of no surprise to me. Disgusting vile newspaper needs closing down the sooner the… https://t.co/zme8sDCswD"}
{"label": "NOT_SARCASM", "text": "...or Spotted Dick??  https://t.co/JGpHvI8KE8"}
{"label": "NOT_SARCASM", "text": "@YorkshireMOS @TheBHF Cheers buddy, thank you for replying! Have a super day and keep up the good work 👍"}
{"label": "NOT_SARCASM", "text": "TFW you get crumbs inside your gimp mask #merrychristmas"}
{"label": "NOT_SARCASM", "text": "Even if I looked like Amber, there is no way on gods green earth I would greet my own parents, let alone my fellas… https://t.co/ZIIxLaPKtL"}
{"label": "NOT_SARCASM", "text": "In 2018, I completed my journalism degree, got married, saw my stories published in countless nationwide and local… https://t.co/8T64IltX70"}
{"label": "NOT_SARCASM", "text": "- Wenger when asked if he thinks Ozil and Sanchez will be at the club in February https://t.co/hezANdrpQI"}
{"label": "SARCASM", "text": "Thank you Agent Jo Brand for turning droves of people towards supporting the Brexit Part. @brexitparty_uk"}
{"label": "NOT_SARCASM", "text": "I gave up listening to Bercow just now. What a preposterous, narcissistic piece of work. Napoleon Complex."}
{"label": "NOT_SARCASM", "text": "BBC News over emphasising the colour of the El Paso shooter and blaming Trump for the tragedy. What happened to imp… https://t.co/ZOh7jkx25e"}
{"label": "SARCASM", "text": "Don’t you love when your dad teaches your friends and you have to warn them not to say certain things about you"}
{"label": "NOT_SARCASM", "text": "So bored I’m considering coming out to my parents because it’s something to do"}
{"label": "NOT_SARCASM", "text": "Depression is weird because your body is supposed to have a survival mode yet gives you an illness which makes you want to kill yourself."}
{"label": "NOT_SARCASM", "text": "Be the best version of you, stop whatever is holding you back"}
{"label": "SARCASM", "text": "I didn't realise Alan Davies was supporting Green Day at Reading. Extra guitarist anyone? #doppelganger"}
{"label": "NOT_SARCASM", "text": "Hey @energenie4u do you have an up to date version of your TRV spacer document you could send me?"}
{"label": "NOT_SARCASM", "text": "I did an aerobics class this morning. I'm already sore so this bodes well for tomorrow. Otherwise, today was anxiet… https://t.co/KmXoLmaSOR"}
{"label": "SARCASM", "text": "Officially revealing myself as the first person ever who doesn’t agree with terrorism"}
{"label": "SARCASM", "text": "@FreaksOfNPuds I bought the sticky toffee pudding and it was good for me because I'm fat.  It was so dry and sickly… https://t.co/dK8zF7xDBw"}
{"label": "NOT_SARCASM", "text": "When you feel fed up but these come through the door and put a smile on your face😁 #firstshowof2020… https://t.co/MuQq9x0EZ5"}
{"label": "NOT_SARCASM", "text": "@millieoconnell I'm booking tickets for Salford.  Are there any shows you're not scheduled to perform there?"}
{"label": "SARCASM", "text": "@samsanders They needed a week off from interviewing Trump supporters in the Midwest"}
{"label": "NOT_SARCASM", "text": "Great rainbow mid-storm in Wolcott just now, went all the way down to the street. @ryanhanrahan @NBCConnecticut… https://t.co/bJuBAusJee"}
{"label": "NOT_SARCASM", "text": "#killingEve is so fucking good man"}
{"label": "NOT_SARCASM", "text": "Amazing documentary raising awareness of issues faced by refugees #refugeechildren thank you @Channel4 ..hopefully… https://t.co/lphvzpxdcP"}
{"label": "SARCASM", "text": "A Millwall fan who is anti-Palace..what a surprise @DavidBondBBC"}
{"label": "SARCASM", "text": "TWITTER: Sure, sex is good, but have you ever tried making users read the same tweet over-and-over again when they… https://t.co/pbe7X9xSDc"}
{"label": "NOT_SARCASM", "text": "Some folk are just the best :) https://t.co/ySUxebyEiV"}
{"label": "NOT_SARCASM", "text": "#Dancingonice Saara's skating is awesome tonight she deserves to be in the final! 💜"}
{"label": "NOT_SARCASM", "text": "Am very shocked and saddened to hear of the death, suspected suicide, of the talented and funny Robin Williams! R.I.P! :'("}
{"label": "NOT_SARCASM", "text": "Only problem with this tweet is, I have no idea which 1 of the lying bastards shes referring to 🤷‍♂️🤦‍♂️ https://t.co/GozTl8JtPv"}
{"label": "NOT_SARCASM", "text": "Nighttime adventures http://t.co/fcKok5yOl8"}
{"label": "NOT_SARCASM", "text": "Bro I'm about 40-50% deaf right now and I am straight up not having a good time at all.  Ear congestion is going to make me kill someone"}
{"label": "NOT_SARCASM", "text": "I live for messing with telemarketers, send more please"}
{"label": "NOT_SARCASM", "text": "Not long until the release the of the Switch literally only thing keeping me going currently, fucking hate feeling like this."}
{"label": "SARCASM", "text": "@JackieFletcher4 @jeffburtle @jeremycorbyn Thanks for your brilliant insight Jackie 🤣"}
{"label": "NOT_SARCASM", "text": "My 17mo thinks this postcard's the best. Wonder why 🤔😆❤ @Alan_Measles #playingtothegallery #breastfeeding… https://t.co/v12O5edMSq"}
{"label": "NOT_SARCASM", "text": "Killing and eating animals is a betrayal of our own core humanity. Killing an… - Evanna Lynch https://t.co/Zd0L08ryau"}
{"label": "NOT_SARCASM", "text": "I've got an idea... Instead of a racist, lying, misogynist for Prime Minister, why don't we get Tommy Shelby in...… https://t.co/2S0VUSKNBr"}
{"label": "NOT_SARCASM", "text": "How i'd love to be back to being like the first year in my flat, that doesn't even know where the library is on campus.."}
{"label": "NOT_SARCASM", "text": "Michigan with a great first half. Need this quality win. Just keep feeding the German. #GoBlue"}
{"label": "NOT_SARCASM", "text": "Finished wrapping presents: 60% wrapping paper 30% brown parcel paper 10% tin foil  Don't judge me.  #christmas #parenting #sendwine"}
{"label": "NOT_SARCASM", "text": "The most decadent way to warm your baby's bottle. Thank you @PettigrewTea for making it a perfect afternoon for all! https://t.co/H6Ped8aziM"}
{"label": "NOT_SARCASM", "text": "dont think theres any joy greater than trolling internet communities"}
{"label": "NOT_SARCASM", "text": "Of course the one UK venue Rammstein pick to play on their massive European tour is the one stadium I've sworn neve… https://t.co/BQHaQl6Xkc"}
{"label": "SARCASM", "text": "Definitely not related to me. #DescribeYourFamilyIn5Words"}
{"label": "NOT_SARCASM", "text": "Old Forces buddy's daughter is doing Military Challenge to raise funds for the British Legion. Please consider spon… https://t.co/ocE3rpymIu"}
{"label": "NOT_SARCASM", "text": "The ideal place to stop for a coffee and free Wi-Fi along The St Cuthbert's Way. #StCuthbertsWay  https://t.co/UoXEDNJTXP"}
{"label": "SARCASM", "text": "Love when you have acne and people are like 'have you tried drinking water hun\" like I didn't try that easy ass solution first  Thanks hun x"}
{"label": "NOT_SARCASM", "text": "I love Riverdale. Why did no one ever tell me about it"}
{"label": "NOT_SARCASM", "text": "River City Girls is GOOD https://t.co/JnIn39jLIj"}
{"label": "NOT_SARCASM", "text": "Ponyo fucking rules"}
{"label": "NOT_SARCASM", "text": "OMG, so excited. This book arrived for me yesterday! Many thanks to the awesome @xenophage &amp; the even more awesome… https://t.co/Dfa9Q5kIOW"}
{"label": "NOT_SARCASM", "text": "@hihatchie You just carry on doing what you do; stay true to your heart...💜"}
{"label": "NOT_SARCASM", "text": "We need to stop ignoring the real issue and blaming random things. Our country needs free and easy access to mental… https://t.co/YSijVmUN0m"}
{"label": "NOT_SARCASM", "text": "I see little mix tomorrow"}
{"label": "NOT_SARCASM", "text": "Just about the coolest wedding reception ever! #camdenyards #oriolesnation http://t.co/Rz1UnqronW"}
{"label": "SARCASM", "text": "Neil DeGrasse Tyson Presents: Space Odyssey The Game https://t.co/jrItXTCRQ2"}
{"label": "SARCASM", "text": "Lunch of champions 😂 gym later so I'm allowing myself a sausage roll 💪 . . . . . . #mfp #myfitnesspal… https://t.co/W7t73KN6jr"}
{"label": "SARCASM", "text": "I will be testing the water park and the wetsuit to their limits https://t.co/3ZKVLLEJhn"}
{"label": "NOT_SARCASM", "text": "Come along to the MK Pudding Club tonight at The Fenny Kitchen and support @willenhospice https://t.co/Mfq49kJ9gh"}
{"label": "SARCASM", "text": "there's no place on this world for anyone who hates mint chocolate I'm sorry it's just survival of the fittest"}
{"label": "NOT_SARCASM", "text": "why does the almond milk in the box last so much longer than the almond milk in the carton"}
{"label": "NOT_SARCASM", "text": "would LOVE to read these:  http://tinyurl.com/cezvss"}
{"label": "NOT_SARCASM", "text": "@jjbbllkk Honestly, I had never heard the song to begin with, and actually sought it out and listened to it on yout… https://t.co/xtkx0bCUQ0"}
{"label": "NOT_SARCASM", "text": "@steampunkdrox Christ... Like, don't follow people? AT ONE IN THE MORNING? It's fucking creepy? I find it so hard t… https://t.co/PmT6osXZFT"}
{"label": "SARCASM", "text": "man i sure do love offensive line highlights"}
{"label": "NOT_SARCASM", "text": "any sharks fan who ever complains about the refs ever again can fuck right off"}
{"label": "NOT_SARCASM", "text": "I really wish I could hug you for you give so much of yourself to others and its often taken advantage of.  I know… https://t.co/Isu6ORc1Yu"}
{"label": "SARCASM", "text": "i wanted Marlow’s, jeremy wanted Osaka, so we compromised and now we’re at Marlow’s"}
{"label": "NOT_SARCASM", "text": "i really need to stop shopping for lingerie. it’s so addicting🙄"}
{"label": "NOT_SARCASM", "text": "What is your country most #worried about? https://t.co/IZP7GhrG2O"}
{"label": "NOT_SARCASM", "text": "#Technology and #evolution  https://t.co/yyduwB0pNm"}
{"label": "NOT_SARCASM", "text": "i saw britney for the first time a year ago today 😭😭😭"}
{"label": "NOT_SARCASM", "text": "If you’re pro life but you haven’t adopted any children, then shut the fuck up."}
{"label": "NOT_SARCASM", "text": "The best thing about being an introvert married to an introvert is that sometimes I have nothing to say, sometimes… https://t.co/QpvkS1zB9m"}
{"label": "NOT_SARCASM", "text": "*eats #lunchmeat* *eats #cheese* *eats #pickles*  I probably should have just made a #sandwich. 🤔"}
{"label": "NOT_SARCASM", "text": "Found my first bright red leafy boi https://t.co/uagcHM4cLj"}
{"label": "NOT_SARCASM", "text": "More football games are lost than won."}
{"label": "NOT_SARCASM", "text": "@NoamChomski they still make music videos?"}
{"label": "SARCASM", "text": "Feeling unnerved? Time to call in the reserves! Because nothing spells out fun like 2-1-1. #steelreservesaturdays #211"}
{"label": "NOT_SARCASM", "text": "I have less than zero patience for meetings and/or things that can as easily be explained  by email. #facedesk"}
{"label": "NOT_SARCASM", "text": "Fuck man, every time I hear Ministry somewhere, I'm like damn...I oughta find one of their albums. #justonefix #duffs #blackmeout"}
{"label": "NOT_SARCASM", "text": "Me feeling greet today thanks Lord. Hapi tuesday shoutout go's to @wizkidayo love ur music"}
{"label": "SARCASM", "text": "someone made the executive decision to throw out all the leftovers in the fridge and I love not having lunch or dinner"}
{"label": "NOT_SARCASM", "text": "i love that made up words like \"wangjangle\" or \"kerjigger\" have commonly understood definitions"}
{"label": "NOT_SARCASM", "text": "The dog I'm watching just walked over and presented me with the squeaker she just systematically ripped out of her… https://t.co/UVwPNyfPAx"}
{"label": "SARCASM", "text": "Lil Clitoris: The Artist Formerly Known As Shehbaaz"}
{"label": "NOT_SARCASM", "text": "S/o all the plants making oxygen today, we appreciate y’all"}
{"label": "NOT_SARCASM", "text": "More community alternatives to 911"}
{"label": "NOT_SARCASM", "text": "@HiliaryBanks @Monicakassim1 Maybe bc Beyoncé is a light skin woman who recognizes her own privilege?? She named da… https://t.co/o0XFJxgGGu"}
{"label": "NOT_SARCASM", "text": "I teared up watching #AgeOfResistance last night thinking about what wonderful things he could have done with 2019… https://t.co/L9kWnWVcFW"}
{"label": "NOT_SARCASM", "text": "I feel like Cats trailer day was our best collective internet day in a while."}
{"label": "NOT_SARCASM", "text": "I really need a productive day 😭😭"}
{"label": "NOT_SARCASM", "text": "You can't beat a cup of @YorkshireTea after work! #ProperBrew"}
{"label": "NOT_SARCASM", "text": "I’m not even that much older but I still can’t wrap my head around the fact that people born on 9/11 are adults now"}
{"label": "NOT_SARCASM", "text": "@TeaSpillYT I would really be side eyeing any kind of pesticides that the complex might be using inside and out. Al… https://t.co/9KL6vMAF9p"}
{"label": "SARCASM", "text": "Are you even bisexual if you don't mention it literally every 5 seconds? 🧐"}
{"label": "SARCASM", "text": "Shoutout to @axs tickets for their site telling me i'm a bot for the last 35 minutes &amp;kicking me every time Paramore tix came up :) U suck"}
{"label": "NOT_SARCASM", "text": "@Poundland @pepandco Done, thank you"}
{"label": "NOT_SARCASM", "text": "@VibeTickets #vibeticketssunday George Ezra in london pretty please 😊😊😊😊😊@lukesrivers"}
{"label": "NOT_SARCASM", "text": "Don't know how I'm going to survive in Morrocco, I'm too hot now and it's only 16 degrees."}
{"label": "NOT_SARCASM", "text": "Working from home today, really need some air, have Amazon delivery, do I risk it, help!"}
{"label": "SARCASM", "text": "So it's okay if the Welsh need a nap?!?! #WALvENG"}
{"label": "NOT_SARCASM", "text": "Don't normally argue with the ref, but that's his second really dodgy call this game. Definitely not a neck tackle! #WALvENG"}
{"label": "NOT_SARCASM", "text": "I'd forgotten how glorious bed is. Plus this is the first time I've felt clean since Thursday. 😍"}
{"label": "NOT_SARCASM", "text": "Top of the list of purchases for the 2019 triathlon season - a bloody decent alarm clock! Looks like… https://t.co/kLJ8ysgIHO"}
{"label": "NOT_SARCASM", "text": "Oh no, so sorry to hear about Sid Haig. Great actor. Rob Zombie staple. He will be missed"}
{"label": "NOT_SARCASM", "text": "@Klm0237 @SportsSturm It's a decent point, but for Americans watching EPL, most adopt a club to root for. Who will… https://t.co/P0ankRQ8w6"}
{"label": "NOT_SARCASM", "text": "Starting XI - Caballero, James, Guehi, Zouma, Alonso, Barkley, Gilmour, Pulisic, Pedro, CHO, Batshuayi    Subs - Cu… https://t.co/rHksgNnEWB"}
{"label": "NOT_SARCASM", "text": "@MrBrandonHee The Holy War is the nickname for a college football game between the U of Utah and Brigham Young U.… https://t.co/0fiK5QvyWt"}
{"label": "NOT_SARCASM", "text": "@SupaNintendoGrl I had a creepy moment one night as a karaoke DJ, when a singer, who's an older guy than most of my… https://t.co/EUxNWuBLhS"}
{"label": "NOT_SARCASM", "text": "In honour of a #BankHolidayWeekend, #GBBO2019 and an excuse to experiment with our new toy, my first carrot cake ba… https://t.co/CUk0bYegF0"}
{"label": "SARCASM", "text": "Good luck. Should be lovely rugby weather https://t.co/7l2Rua91R0"}
{"label": "NOT_SARCASM", "text": "So i finally  got a reply to my email @eRewardsUS , it was to give me a phone number in the usa that i phoned from… https://t.co/DrIyZJGLtF"}
{"label": "NOT_SARCASM", "text": "Sat outside detachment its like a bloody zoo, in the space of one song ive watched 2 magpies, a woodpigeon and the… https://t.co/leqwaU4AOa"}
{"label": "NOT_SARCASM", "text": "Excited to share this item from my #etsy shop: Always be grateful wooden kitchen sign https://t.co/cpzNALRODA https://t.co/JA3EFyaTO6"}
{"label": "NOT_SARCASM", "text": "@AngelaRayner Both accounts now deleted."}
{"label": "NOT_SARCASM", "text": "@tjz1100 @LouiseRawAuthor @DanielR61592267 I have. Twice. Thoroughly disappointing both times."}
{"label": "NOT_SARCASM", "text": "Av a bostin day all fellow Yam Yams! @officialBCday @BCLivingMuseum https://t.co/pOLOYGNEnM"}
{"label": "NOT_SARCASM", "text": "Lovely nostalgic visit to Last of the Summer Wine exhibition in Holmfirth. Happy, bittersweet memories.  @AndCompo https://t.co/Xgeq5Eq8Ez"}
{"label": "NOT_SARCASM", "text": "Listening to @_B1A4OFFICIAL and I'm genuinely sad for these new K-Pop fans who don't know just how many great group… https://t.co/QPnoBvQBNd"}
{"label": "SARCASM", "text": "Oh @MonsoonUK - how do we expect Year 2 children to learn their homophones when big companies can’t even get it rig… https://t.co/7YnprpsdOW"}
{"label": "NOT_SARCASM", "text": "One week with @npowerhq &amp; I’m already fuming. Been told 3 different things via phone/email/letter, &amp; just spent ove… https://t.co/y8BOtgv697"}
{"label": "NOT_SARCASM", "text": "Chuka Umunna is really reminding me of Dan Miller in The Thick Of It."}
{"label": "NOT_SARCASM", "text": "If you’re not shipping Yas and the Doctor then you’re not paying attention... #doctorwho #gayagenda 🏳️‍🌈 🏳️‍🌈 🏳️‍🌈"}
{"label": "NOT_SARCASM", "text": "Just closed 375 tabs."}
{"label": "NOT_SARCASM", "text": "Spent the morning nursing a very hungover daughter, after she came home at some ungodly hour....oh how times have changed 🙈"}
{"label": "NOT_SARCASM", "text": "Wish me luck https://t.co/hxZydULv1h"}
{"label": "NOT_SARCASM", "text": "Being gay and/or trans is just daily asking yourself “hm...is this a real thought/feeling or is it the compulsory h… https://t.co/zxD4l72zvI"}
{"label": "NOT_SARCASM", "text": "Can’t believe I’m taking the GRE on Friday and that my unmedicated adhd brain is gonna sit in a chair for 6 hours r… https://t.co/JLOdtHXgfN"}
{"label": "NOT_SARCASM", "text": "When your monthly stats back up the point you’ve been making beautifully! #goodatmyjob #mondayvibes https://t.co/5c2Ud9bkn1"}
{"label": "NOT_SARCASM", "text": "Can you put too much cuticle oil on? Asking for a friend 💅 #cuticleoiladdict #imaskingforme #imtheaddict"}
{"label": "NOT_SARCASM", "text": "Hap Hap Happy Belated Bornday Joey! Best wishes your day, life is filled with Family, Love, Joy, Friends, Chocolate… https://t.co/5In37ni5Hi"}
{"label": "SARCASM", "text": "Genuinely don’t know what I’ll do without the #WinterOlympics to entertain me all day at work"}
{"label": "NOT_SARCASM", "text": "This ranking is exactly correct and @nwalks remains a genius https://t.co/hHn6ENfI2Q"}
{"label": "SARCASM", "text": "a) trump and pence are contradicting each other, that's cool  b) does trump know what/where aleppo is?"}
{"label": "NOT_SARCASM", "text": "i just got into a big conversation w my history teacher about Star Trek"}
{"label": "NOT_SARCASM", "text": "people asking jk to cut his hair have No taste 😔"}
{"label": "SARCASM", "text": "we love another night in hospital✌🏻✌🏻✌🏻"}
{"label": "NOT_SARCASM", "text": "Everything is already going wrong and not even 7.30am yet."}
{"label": "SARCASM", "text": "This week has been physically and emotionally exhausting. I just want a big cuddle and a big sleep. I also just sno… https://t.co/cce8HL4nFp"}
{"label": "NOT_SARCASM", "text": "The mystery is solved! Turns out it's from my lovely (sneaky) team at @gwguk because they are just the best bunch of humans. 💛💙"}
{"label": "NOT_SARCASM", "text": "Holy shit, i've never seen a quicker 180 🤣 https://t.co/9Xqhhow0hz"}
{"label": "NOT_SARCASM", "text": "Love being home but never gets easier leaving again :(((("}
{"label": "NOT_SARCASM", "text": "He completely doesn't understand how a diet app can contribute to eating disorders, he needs to go away and educate… https://t.co/wK6cGzoxxB"}
{"label": "SARCASM", "text": "@sarahkendzior I have often thought that I died on election night 2016 and went straight to hell .. how else could… https://t.co/343yu83Wy5"}
{"label": "NOT_SARCASM", "text": "@JohnBrennan I am so grateful for every strong voice that speaks out against this disgrace to our nation. #WorstPresidentEver"}
{"label": "NOT_SARCASM", "text": "@bsunnenberg @eaglesnest1961 @realDonaldTrump @TuckerCarlson No. We just wait and tweet so you bots can come in and… https://t.co/PeYF0mC7EL"}
{"label": "NOT_SARCASM", "text": "Imagine that it's going to cost me 600 pound to travel to and from university for a year"}
{"label": "NOT_SARCASM", "text": "people really out here tryna argue \"you don't need soap to be sanitary\" https://t.co/kd8FdMkDEf"}
{"label": "NOT_SARCASM", "text": "@ArmyWP_Football and their relentless running game, on the brink of upsetting #7 @UMichFootball. @OU_Football knows… https://t.co/R1ea8RO6Ln"}
{"label": "NOT_SARCASM", "text": "Why is it that whether I get out of bed at 6.45 or 7.15, it's ALWAYS 7.31 on the kitchen clock when I get downstairs???"}
{"label": "NOT_SARCASM", "text": "Honestly this morning’s news about Gavin and Stacey has had me beaming all day. I’m thrilled that there’s going to… https://t.co/7IYHyfM9EF"}
